[
{"date": "Thursday, December 1, 2011", "body": "\nA friend of mine moved from here to Connecticut for the autism services.  She had refused to send her daughter to our district and homeschooled her. \n \nIn CT,. her daughter has a full time aide trained in ABA, an IPad with ProLoQuo2Go on it, and is in inclusion 12 hours a week.  I may have to stop reading her emails!! \n \nI am trying to be mature about this but I feel jealous!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/12/friend-of-mine-moved-from-here-to.html", "title": ""},
{"date": "Sunday, December 11, 2011", "body": "\nSometime between last Christmas and this Christmas, B. can sing songs with perfectly recognizable words.  It struck me when I heard \"Santa Claus is Coming to Town\"' turned around looking for G., and found myself looking at B.  How could that clear little voice be coming out of B?  When did this happen?\n\nThey both are so musical, and it is such a joy.  My husband, who has a harder time dealing with the twins' autism, has been takinf B. to a guitar store to try out instruments.  There is an employee who also has two boys with autism, and apparently he's very understanding.  My husband looks so happy when they come home from those outings.  He's planning to get the boys a drum set for Christmas.  I'm very glad they've found this common ground.  Not so excited about the drum set, but I'll live with it.\n\nWell, this started out being about articulation, but it's all related.  Music therapy, for kids and grown-ups.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/12/articulation-sneaking-up-on-you.html", "title": "\nArticulation sneaking up on you\n"},
{"date": "Sunday, December 11, 2011", "body": "\nMy husband and I both thought we might have heard B.  say \"Mommy\" today in the car.  Which would be a first! \n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/12/one-more-thing.html", "title": "\nOne more thing\n"},
{"date": "Friday, August 3, 2012", "body": "\nIt has been a fantastic summer!  We are doing Special Olympics swimming.  We went to a family reunion and brought along our sitter who was a twin chaser/entertainer for every waking hour.  My arms are healed up, and I'm trying to think what to do if the scratching starts again when school starts. \n \nB.  said his big brother's name the other day, when J. had been at day camp all day.  Lots of good things like this are going on, and of course, a lot of the usual challenges.  Hanging in there, and planning to lie on the couch for three straight hours on the first day of school.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2012/08/it-has-been-fantastic-summer-are-doing.html", "title": ""},
{"date": "Thursday, June 27, 2013", "body": "\nHaven't written a post in so long.  And looking back, either I used to be delusional, or the twins have really regressed in their talking and a few other things.  Possibly why I don't post any more.  i think they still know all the same things or more, but they are just in a less social phase?  Well, these things always come and go. \n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2013/06/havent-written-post-in-so-long.html", "title": ""},
{"date": "Friday, September 2, 2011", "body": "\nToday I dropped by the school (unannounced) to have lunch with the boys.  When I stopped by the twins' room, their teacher said, \"Look at this\" and pointed to G.  He was sitting at a study carrell, working all on his own.  No aide, no ABA therapist holding a tiny piece of Oreo.  He was just  working for the sake of working!  \r \r Also, they said that during calendar time, G. had suddenly said, \"Break time\" (something they have been having the twins request with a voice output device).  It was the first time he'd said it, so they let him take a break.  I bet he'll learn that skill pretty quickly!\r \r There are a few issues with ratios and also communication between school and home, but G's working without needing a reward is wiping that out of my mind for the moment.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/09/more-good-news.html", "title": "\nMore good news\n"},
{"date": "Wednesday, September 14, 2011", "body": "\nG. was home with pink eye today, and I got him to do so much work!  Despite liking the new teacher initially, we are back to the old problem of no one realizing a fraction of what the twins, especially G., can do. \n \n \nI had lunch with the twins, and the aide was flabberghasted that they could use complete sentences to make requests. \n \n \n \nTime to send in the old DVD of G. working with me when he was four, saying words, letters, letter sounds and so on.  It is starting to seem ridiculous.  There he is with his old orange sippy cup, doing all sorts of stuff he won't do for them in first grade. \n \n \n \nI am on a secret mission. Posting my plan here does not stop it from being secret. One advantage to having so few blog readers.  The plan is to make videos of the twins doing tons of work.  Today G. matched shape names to shapes, number words to numerals, the names of animals to pictures and more.  He navigated around the PBS Kids website with the mouse, and talked me into watching a YouTube video on present continuous verbs. \n \n \n \nMy mission is still a little vague.  Once I make all the movies proving that the twins can speak, use the IPad, etc., what will I do next?  We will still be living in Texas, in a school district that hasn't even bought any IPads yet.  Well, I'll start on step one, and maybe the next part of the plan will become clear to me.  I'll get a lot of satisfaction out of it, in any case. \n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/09/g.html", "title": ""},
{"date": "Thursday, September 8, 2011", "body": "\nI'm still deciding on this new template background.  Sometimes it looks too much like a few surfaces in my house that just won't come clean, even with the \"Magic  Eraser\" sponge. Hmmmm.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/09/artsy-paint-splotches-or-stubborn.html", "title": "\nArtsy paint splotches or stubborn autism-related stain?\n"},
{"date": "Tuesday, January 11, 2011", "body": "\nB. seems to be doing okay with this kindergarten thing.  He doesn't like the cafeteria, but who would?  I've been picking him up early, to help him ease in.  Right now he's talking in what sounds like paragraphs of babble or some language I don't know.  I may be imagining it, but I feel as if he's talking to himself more since we quit ABA.   Every once in a while I feel a jolt of surprise when I realize both the twins are in the kind of class I used to teach, with a very low ratio and goals like putting their lunch boxes away (along with some loftier things, too.)  Most of the time it seems normal, and I'm so, so glad that this year we have a teacher who says things like, \"They are both so smart, we just have to learn how to work with them\".  I'll just let last year's teacher fade into a distant memory! My mom is home, and continuing to improve.  So right now things are good, although I do miss seeing as much of the twins as I used to.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/01/even-keel.html", "title": "\nEven keel\n"},
{"date": "Thursday, September 29, 2011", "body": "\nWell, I met with the twins' teacher this morning.  It may or may not have been smart to have had two big cups of coffee and a Sudafed before driving to the school.  That's not my recipe for getting high, it's just my normal coffee intake plus a little allergy problem I'm having.  I only take half a dose of Sudafed because it makes me feel as if I'm hovering a few feet off the ground. \n \nAnyway, I brought about eight of the file folder games I've been talking about, our IPad and a box of Oreos, in case the teacher wanted me to demonstrate what either twin can do in the presence of the right sandwich cookie.  Their teacher greeted me and mentioned in the first ten minutes that she has ADHD and has been having hot flashes.  Between the two of us it was a pretty hyper and disjointed conversation. \n \nIt started out with her saying how surprised they were when one morning G. did an alphabet puzzle all by himself.  What the what?  Here we go again, I thought.  So I pulled out my file folders and gave her the Oreos, and now I'm just hoping that G.  does me proud and actually shows some of what he can do.  \n \nThere was more chit-chat, but the gist of the meeting was that the twins can do more than they'll let on, and we're going to work together to get them to do some of it at school.  I know this teacher means well and is very motivated, so I'm hoping for the best. \n \nNow if I can just figure out the secret of getting B. to show what he really knows.  One thing I'm trying (only with G. so far because he can use the computer mouse ): \n\" Teach Town Basics \" \n \n \nIt's not cheap, but the boy can do it.  If I got a touchscreen, I think B. could, too.\n \n ", "outgoing_links": ["http://web.teachtown.com/"], "link": "http://hoopdeedoo.blogspot.com/2011/09/parentteacher-conference.html", "title": "\nParent/Teacher conference\n"},
{"date": "Wednesday, August 3, 2011", "body": "\n Found the (so far) perfect pajamas: www.littlekeepersleeper.com It is such a simple product, but it has really improved my quality of life a LOT!\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-kwpwxGSNXG4/Tjor38mbPzI/AAAAAAAAAd0/izMVVf2Nf3k/s1600/0newhomepage.jpg"], "link": "http://hoopdeedoo.blogspot.com/2011/08/found-so-far-perfect-pajamas-www.html", "title": ""},
{"date": "Thursday, January 6, 2011", "body": "\nOkay, Mommy needs a drink, or a massage, or a Valium, or something!  I'm taking deep breaths, going to my happy place, etc. This morning I dropped B. off at his self-contained kindergarten.  It's the same class G. is in, so it should go fine.  When I left, he was sitting in the general ed. kindergarten for calendar time.  He was singing some Christmas song in a low, relatively quiet voice.  He tried to stretch out on the carpet and ended up sitting in an aide's lap.  I guess now he'll start coming home smelling strongly of perfume, as Greg always does. I actually feel better about it than I thought I would.  He walked into the building with a huge smile on his face.  I'm picking him up early and hoping he's still smiling or at least not crying.  So far, this is definitely harder for me than for him.  Thank God for good teachers and aides.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/01/starting-kindergarten.html", "title": "\nStarting Kindergarten\n"},
{"date": "Friday, September 16, 2011", "body": "\nMy husband and I are always joking that we could get rich by developing the M****** (our last name here) Protocol for autism.  Doesn't really matter what it would be, but if some fraction of the desperate autism parents out there got on board, we'd be set for life.  Our original plan had to do with watching the Wiggles and eating Tyson Chicken Nuggets and Leggo brand chocolate chip waffles. \n \nWe never went through with it, but just lately I've been watching G and thinking maybe we should re-consider.  If you've ever dabbled in all the bio-medical stuff, anytime there's a change in your child's development you can't help thinking, \"Is he eating differently?, etc.  Just lately G. has done so many things for me that he wouldn't have done six months ago.  In the pediatricians' waiting room I showed him how to play \"Twinkle, Twinkle\" on a music app.   He took the IPad from me and played it himself.  Then he tried to play Happy Birthday, and got a lot of the notes right.  He has also been doing all the things I mentioned in the last post. \n \nSo here are the possible  interventions: \n \n \n \n Huge numbers of Kroger brand mini-pancakes. Substitution of healthier-seeming, name-brand mini pancakes is unacceptable. \n \n \n \n \n Excessive exposure to YouTube -- in particular a medley of The Rose, Happy Birthday and We are the World.  Also endless viewings of grammar videos made by English as a Second Language websites (www.mes-english.com). \n File Folder Games-- G. will do any task that I present to him as matching Velcroed things in a file folder -- numbers, words, pictures of emotions, categories of objects.  This could be a passing phase, in which case I'll be stuck with a whole bunch of file folders filled with clip art images and velcro. \n \n \nIn all seriousness, I think a lot of the changes can be chalked up to the IPad.  Being able to operate the IPad with a touchscreen has changed the world for the twins.  I don't know if it's all the fine-motor practice, or an increase in confidence, but now they are trying to use the computer mouse and doing things with apps they could never have done before.   \n \n \n \n Click Here for the YouTube video with magical healing properties \n \n \n \n \n \n ", "outgoing_links": ["http://www.youtube.com/watch?v=8Y106CRxG4k&feature=related"], "link": "http://hoopdeedoo.blogspot.com/2011/09/autism-breakthrough-in-3-easy-steps.html", "title": "\nAutism Breakthrough in 3 Easy Steps\n"},
{"date": "Thursday, February 10, 2011", "body": "\n I'm just back from a field trip to the movie theater to watch Tangled with the twins' class (and the two other self-contained classes from their school).  There is something freeing about seeing a movie with only special needs kids and their teachers in the theater.  At times it reminded me of the old midnight showings of \"The Rocky Horror Picture Show\"-- a lot of audience participation and talking back to the characters on the screen.  When Rapunzel had Flynn locked in a wardrobe, one boy kept yelling, \"Open the door!\"   Nobody minded, and luckily she did finally open the door. I'm happy and surprised that the twins made it through the whole thing.  The last twenty minutes or so Greg started asking, \"Down? Down? Down?\", but dealt with it when we didn't take him out.   Then he limited himself to an occasional call of \"Wait, Elmo!\" for the rest of the movie.  B. drank three sodas --his, G's and mine-- and then actually waited through the whole movie til we got to the restroom. More than I could have done, that's for sure.  Maybe this will inspire me to try more movies with them although I'm not ready to try it on my own yet (if ever).\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-YrItxNYUC18/TVRQuUYrwzI/AAAAAAAAAcc/z_az0x_UbRI/s1600/DSCN4488.JPG", "http://3.bp.blogspot.com/-Niodpy-jfVU/TVRQuFRcTFI/AAAAAAAAAcU/eahuMSqZ3k0/s1600/DSCN4491_2.JPG"], "link": "http://hoopdeedoo.blogspot.com/2011/02/at-movies.html", "title": "\nAt the Movies!\n"},
{"date": "Tuesday, September 4, 2007", "body": "\n 1.  My husband does NOT think it's okay to let J. pee on the flowers in front of the mall, even when it's an emergency, and even when he was about to go on a concrete pillar next to all the people smoking. Even when my husband's parking the van and I've got all the boys with me. 2.  It doesn't help my husband's mood when I can't stop laughing about the pee situation, the madder he gets. 3.  When you put a purple crayon through the dishwasher, it can no longer be used for coloring (that was J's experiment, which I didn't know about until this morning, when I heard, \"Oh, no.  My purple crayon is gone\") 4. My college student helper is a really, really good sport when it comes to sand, mud, and mosquitos. \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/Rt3Ua7nxqbI/AAAAAAAAAEM/1OKyoZzay_c/s1600-h/brendanslide.jpeg", "http://3.bp.blogspot.com/_ccuTsPgAAcc/Rt3TurnxqaI/AAAAAAAAAEE/MLqDPE84QzU/s1600-h/gregpuddle.jpeg", "http://4.bp.blogspot.com/_ccuTsPgAAcc/Rt3RZ7nxqYI/AAAAAAAAAD0/rexWh2Bd_0c/s1600-h/DSCN1780.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/Rt3TE7nxqZI/AAAAAAAAAD8/zHEJjMWAfTw/s1600-h/DSCN1764.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/09/things-i-learned-yesterday.html", "title": "\nThings I Learned Yesterday\n"},
{"date": "Saturday, February 12, 2011", "body": "\n Now that I have all three boys in school full-time (pause here for a sniffle), I find myself trying to re-claim my old self or possibly discover some aspects of a new self.  I feel like I'm trying to re-group.  I've been donating a LOT of stuff to Goodwill, which makes me very happy.  I've also been doing some planting.  In my windowsill I have basil, thyme, lavender and rosemary.  I've bought some seeds to try growing micro-greens.  Outside I've got Texas Sage and phlox of some kind.   I haven't come up with any plan for how to earn money while still being home to get the boys off their buses.  I haven't done the \"Determination of Mental Retardation\" appointment which might get us some services.  I haven't made any nifty DVD's for video modeling. Right now I'm getting rid of old stuff and growing a few new plants and watching old episodes of  Community , and that is going to have to do for the time being!  Not a bad way to spend some time. PS That's not actually my Texas sage in the photo.  That's what my Texas Sage dreams of being one day far in the future.\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-8FK-KeWAdgE/TVcloTh5j6I/AAAAAAAAAck/Rs0cGlf0_tI/s1600/Texas_sage.jpg"], "link": "http://hoopdeedoo.blogspot.com/2011/02/gardening.html", "title": "\nGardening\n"},
{"date": "Tuesday, February 22, 2011", "body": "\n Overall, I think my mood is pretty good these days.  But one thing can still sucker-punch me... other autistic kids seem to progress so fast!  I hear people refer to their child as low-functioning or autistic or delayed, and they can do so much more than the twins.  This is not what it's cool to blog about.  I realize, but I don't have too many readers, so the pressure is off, to some extent. One thing that works for this mood is to go the blogs of parents with children with much more serious medical or cognitive disabilities.  I feel strange saying that, but it is a sure way to help me appreciate the positives in my life.  Another thing that really helps is looking at a picture of Greg trying a hamburger.\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-l6b1L1_XCc0/TWPXkiPQOGI/AAAAAAAAAcs/YS9xxWU0otI/s1600/IMG_0202.jpg"], "link": "http://hoopdeedoo.blogspot.com/2011/02/functioning-high-and-low-and-in-between.html", "title": "\nFunctioning -- high and low and in-between\n"},
{"date": "Sunday, September 9, 2007", "body": "\nBeing that I've lived in Texas for seven years (could this be true??) it is strange that I had never been to a rodeo.  Never until yesterday, that is, when the whole family attended the  Baytown Special Rodeo . This rodeo was special in the way that the Special Olympics are special, and also in every other way.  I had hired a babysitter to come with us, so the twins wouldn't be stuck in the stroller.  But when we picked up our packets (which included cowboy hats, bandana and sheriff's badges), they introduced us to our \"Rodeo Buddies\".  Each child had a buddy assigned to him or her, so that the parents could relax and have fun.  What a great idea! B. was fine with his buddy, but G. was terrified by his.  So Rob, a ninth grade boy scout, followed me around, and pretty much talked my ear off. After about twenty minutes of knock-knock jokes, and verbatim routines from sit-coms, I was starting to get a feeling about Rob.  Then, out of the blue he said to me, \"Have you heard of Asberger's Syndrome?\"  He claimed to be \"five-percent Asbergers\".  He was really a great kid, but struck me more like a sixth grader.  He spent the entire time with us, and was really as helpful as the kids would allow him to be. The best moments: B. running in circles in front of the Elvis Impersonator as he performed. G. walking right up to someone in an Elsie the Cow costume, and having a brief interaction. He even said, \"bye-bye\". J. using his free camera to record the whole event.  I hope some of his pictures turn out! We had such a good time, and I'm so grateful to all those hard-working volunteers (especially our \"rodeo buddies)\n \n ", "outgoing_links": ["http://www.specialrodeo.com"], "link": "http://hoopdeedoo.blogspot.com/2007/09/our-first-rodeo.html", "title": "\nOur First Rodeo\n"},
{"date": "Saturday, September 1, 2007", "body": "\nDue to J. not napping anymore, and my resolving to go to bed earlier, haven't been posting anything. I'll have to describe later the events which made me decide not to send the twins to nursery school.  Long story short: gossipy prejudice against special needs kids, combined with my concern about stressing them out.  so on Mondays and Fridays I'll get to be with just them, with (so far) No Therapy Appointments (heaven!). Thanks to Kristen for sending me the book \"The Other Mother\"!  I've just started it. G. has been trying to give hugs.  I think that's what he's doing, but it's a little unconventional.  He also said \"elephant\" and \"umbrella\". Right now, G. is in bed saying \"uh-oh\" and \"oh-no\" alternately.  B. is very into looking at books, especially the Backyardigan's Journey to the Tower of Power.  Not one I'd choose, but I'm glad he's starting to like books again. More later!  I miss my blog reading!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/09/due-to-j.html", "title": "\nWhere has my blogging time gone??\n"},
{"date": "Wednesday, January 17, 2007", "body": "\nOne or two people have suggested I start a blog, so I'm giving it a shot. The short version of what I'm doing is recording a log of our family's journey through PDD.  We have 25 month old twins who have some version of PDD, although they're still undiagnosed. We also have an older son (almost three) who is a fantastic brother, and a real character himself. The name of the blog comes from the Wiggles' DVD \"Hoop Dee Doo Dance Party\".  We've been watching it a lot lately.  It's has a sixties-style psychedelic feel to it, and it sums up my mental state at this point.  Nothing is what I expected it to be, so what the hell, let's have a Hoop Dee Doo dance party.   I've been reading other families' autism blogs every night lately.  I find it so helpful to see what other people have been through...how they've coped, and the progress their kids have made.  And, most importantly, seeing so many bloggers who have held on to their optimism and senses of humor.   Having never blogged, I'm not sure of what level of detail to go into, how personal to get, etc.  I think the whole concept of blogs is so cool, I'll just play it by ear and see how it goes. Our oldest boy is making strange animal-like noises from his room.  He's someone who REALLY needs a nap, so I'll ignore it for a little while, since he sounds pretty happy.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/01/starting-out.html", "title": "\nStarting out\n"},
{"date": "Tuesday, April 10, 2007", "body": "\nThis morning I  woke up feeling optimistic about the whole situation.  As far as I know, nothing in particular has changed (although G. did come back out of his no talking/no signing stage, which was, as always, a huge relief).  Anyway, I just have the feeling that things will be alright.  I spoke to my \"autism mom mentor\" this past weekend, and she gave me a lot of encouragement.  Her son was never as delayed as the twins are, but she thinks he was more distant and aloof. Now he's doing very well although of course he's still on the spectrum. Part of her advice to me was not to worry about money for the next year or two, and get all the therapy we possibly can. My husband is always more laid back about money than I am, so I'm lucky in that way.  The last few days I've put a lot of my energy into sensory integration--learning about how to do the brushing protocol, and ordering a swing which we can hang in a doorway.  Since we've put a little climbing structure in our backyard, B. has been so happy!  He has stopped biting his hand, and I suspect it may be because he now has the outlet of climbing.  I'd like to get him something to climb on inside, but right now he settles for hanging off the back of the couch. One of the reasons I love our current OT is that she gets so excited about B.'s climbing or even about his sitting on the arm of our rocking chair.  She is always able to see strengths in him that I so need to hear about right now. G. said his first three-syllable word today.  It was \"Tortoro\", the name of a character in a Japanese children's movie that a friend gave us.  It's funny, he'd only said two or three words all day (although he has been signing a lot), and then suddenly he was saying \"Tortoro......Tortoro\" very quietly. Next week we have B's MRI.  I'll stay home with the other two boys, and my husband will take him.  I wish I could go, but we couldn't find anyone  who could come over early enough to babysit.  A few weeks later, G. will have his MRI, and we can both go to that one.  I'm not expecting that there is anything wrong in their brains, but the devl. pediatrician said they have strangely-shaped heads.  They were monoamniotic twins, meaning that their cords were tangled throughout the entire pregnancy, so things have been unusual from the beginning.  For three weeks we believed that they were conjoined, and someday I plan to blog about that crazy period of our lives. Oh, the second part of the title of this post refers to a comment we got recently.  I didn't actually hear it.  A friend of mine was with B. at a playspace when a man and his son joined them.  The son really wanted to play with B., and B. was happily ignoring him.  My friend mentioned that B. has autism, and the dad said, \"Oh, I don't believe in any of that!\", along with a few comments about everyone having a diagnosis these days, etc.  When my friend told me, for some reason it struck me as funny (If an in-law of mine had said it, I'd be outraged.)  It hadn't occurred to me that I could choose not to believe in autism.  Is it like Santa Claus or the Easter Bunny?  Even if that were true, I'd  keep believing in it, because it helps me understand the odd, funny, loveable ways of my twins. For some reason, this got me wondering about what Tom Cruise and Scientology think of autism. I'll have to Google it. My new attitude about blogging is that I am going to try to stop being intimidated by the blogs which strike me as so well-written and wise and the type of thing which could actually be turned into a book someday.  I feel my style is more of a stream-of-consciousness, sleep-deprived, I'm-trying-to-ignore-the Heffalump-sounds-coming-from-my-older-son's-room style. It does feel therapeutic to blog, and it's definitely very helpful to read other autism parents' blogs and comments.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/04/feeling-optimistic-autism-vs-easter.html", "title": "\nFeeling Optimistic/ Autism vs. the Easter Bunny\n"},
{"date": "Tuesday, April 3, 2007", "body": "\nToday I mentioned to the director of the nursery school which the twins are signed up for next year that they've gotten their new diagnosis.  I was pleasantly surprised how well she took it.  She said that they were willing to try and see how things work out.  And everyone in the office chimed in with hopeful things they've heard about autism lately (this happens to me a lot these days) J. and B. have a new game to play together.  J. holds the hose, with a sprinkler attachment and waters the grass, and the deck and parts of the house.  B. stands in the spray with a huge grin on his face, laughing out loud.  J. is thrilled to be able to make B. smile.  We aren't sure but we think we heard B say \"wawa\" for the first time. G. is in a funny stage where he acts as if he's forgotten most of his signs.   But he did use the sign for \"mom\" (in reference to his large toy duck, not to me, but we're getting closer) and he did kiss me two times in the last two days.  He's kissed his toys before, but never me til now. I am going to assume that G. hasn't really forgotten all those other signs, because whenever I freak out about one of these stages, so far they have always passed. I have GOT to download that browser that will let me load photos.  We still have dial-up service which seems to be the internet equivalent of using carrier pigeons or the Pony Express, and the download says it will take three hours.  I am going to start it downloading this evening, because I've got some great pictures.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/04/few-notes.html", "title": "\nA few notes\n"},
{"date": "Thursday, April 26, 2007", "body": "\nLately I have been reading the book \"Let Me Hear Your Voice\", by Catherine Maurice.  I'd heard of it many times, but avoided because I associated it with the words \"Lovaas\" and \"recovery\", both of which I have mixed feelings about. I  was immediately drawn in by her writing, and by the fact that she's not any sort of zealot (so far, but I haven't finished it yet), just a very hard-working and loving mom.  Even though she gives so much credit to her ABA therapists, I think equal credit goes to her, and all her \"incidental teaching\". She sang songs and played and talked with her kids for hours every day. I was particularly moved by the section of the book in which she realizes that her youngest child is also autistic.  The huge effort she put into convincing herself that it wasn't true reminded me of myself almost a year ago.  I remember staring at each twin thinking, \"He just smiled at me, he can't be autistic\"...\"He is climbing up into my lap, so he can't be autistic\" and so on.  It is a little hard to read this book and not think \"If I hired enough people, and spent every second getting my boys to interact, could they also progress so fast?\"  G. is pretty easy to engage, and even seeks me out, but B. spends quite a bit of time doing his own thing.  It's hard work to get him interested in things, and it might help if I hired a fresh face to work with him. While I think he should have times to relax and be himself, I also feel like I could use some help from somebody with experience interacting with kids like him. As far as the concept of \"recovery\" goes, neither my husband nor I consider ourselves completely \"normal\", so we've never expected to have kids who were so.  To fit into our family, it really benefits one to be, at the least, eccentric. But I do find Maurice's book encouraging, because her kids started out from a point a lot like mine.  I feel re-energized, not necessarily to go out and set up an ABA program, but to believe that the songs we're singing and the goofy games we play are on the right track. Movie Note: Finally saw Little Miss Sunshine, and loved it.  I never cry in movies, and I cried all through this one, although officially it's a comedy, so that's a little odd.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/04/overcoming-my-prejudices.html", "title": "\nOvercoming my prejudices\n"},
{"date": "Sunday, April 15, 2007", "body": "\nI took G. to church with me this morning, and left the other guys home with Dad.  I teach Sunday School twice a month.  Well, it's a Unitarian Universalist church, so I hardly feel that I can say I'm teaching Sunday School.  It's pretty non-traditional, but it is on Sunday morning, and I am teaching, more or less. Anyway, I dropped G. off in the toddler room.  They only had three kids total, with two teachers, so the outlook was good.  This particular teacher hadn't had G. in there before, because the twins stayed a few extra months in the infant room, until I decided to bite the bullet and admit that they really are two.  So far, they haven't quite managed the whole hour in the toddler room.  Sometimes they end up back in the infant room, and other times a woman who has a soft spot for them ends up carrying one around with her. Usually someone ends up coming to get me because one or the other is inconsolable after 40 minutes or so. I heard some whining and complaining (in G's high-pitched \"I'm not at all happy with this situation\" little voice), but amazingly enough, no one came to get me for the entire hour.When I went to get G., the teacher seemed apologetic, and said, \"I think he may be very tired.  He alternated between wandering around the room and lying on the floor.\"  I probably confused her, because I was so excited and grateful, and said, \"You don't know how great this is.  It's the first time he's stayed the whole hour in the toddler room!\"  I really felt we'd made some important progress. Eventually we can work on getting him up off the floor, but at least he's in the room, and I'm not!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/04/matter-of-perspective.html", "title": "\nA Matter of Perspective\n"},
{"date": "Sunday, April 22, 2007", "body": "\nMy boys can all still fit in our large bathtub together.  Once we add the plastic animals and the foam alphabet letters, it's gettting to be a close squeeze, but they can do it. The boys all manage to get along in there, even with J. lying down and flopping around in order to be the \"big, white seal\" (a favorite from our last aquarium visit).   The twins always perk up once they hit the water.  In the living room they may have had the million-mile stare, especially if any music has been playing (I am in a quandary about playing CD's for them, because if they like the music they stop playing, interacting and sometimes stop moving at all, often for the duration of the CD)  In the warm water of the tub, on the other hand, their faces brighten, they babble, they play with animals or splash around. The best part comes after ten or fifteen minutes, when one or the other will come up to the edge of the tub, look right into my eyes and laugh with me.  G. has even taken to giving me kisses.  B. will grab on to my hair or my shirt, and just smile right at me.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/04/something-about-bathtub.html", "title": "\nSomething about the bathtub\n"},
{"date": "Saturday, April 28, 2007", "body": "\nOkay, my last post sounded like the publisher had slipped me a little cash, but it was truly how I was feeling at the time.  By the time I finished it, I was a bit disappointed there was no mention of valid non-ABA approaches, such as floortime and RDI.  Although I should check the publication date, because I don't know what form they were in when she was writing. I think I'm still in the \"Somebody please tell me what to do\" post-diagnosis flailing stage.  I can see how people start plunking down a lot of money to consultants and doctors, because you feel like you need to do something FAST.  When I read about DAN doctors, part of me thought, we've got to see one of those.  When I read about RDI, I wanted to sign up (still true).  The ABA thing I go back and forth on.  Initially I was absolutely not interested, but now that I've been trying my own thing for almost a year, I wonder at times if it could be good for B.  Not thirty hours a week, but maybe some kind of ABA-lite. I'm trying (once again) to take a deep breath and look at the big picture.  When I first figured out we were \"on the spectrum\", I knew the kind of approach I felt comfortable with.  I started doing what I thought was best, basically some sensory integration, PECS symbols all around, sign language, and lots and lots of interaction. I still believe in what I'm doing, the root of my doubts is that I think B. needs more.  We are starting our private OT and speech in the next few months, and I think that might help me see which direction to head in.  I've met the OT twice, and have a good feeling about her.   In any case, I still think that \"Let Me Hear Your Voice\" was a good read, as long as you also read a lot of other books along with it (and what parent of an autistic child doesn't?)  Deep down I'm still a touchy-feely, floortme, RDI type parent who's trying to keep an open mind.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/04/backpedaling-on-previous-post.html", "title": "\nBackpedaling on the Previous Post\n"},
{"date": "Saturday, March 3, 2007", "body": "\nThanks for the well wishes after the previous post. B.  went through the same lethargy as G. had.  For him it was several days after the stomach symptoms.  Because he's not as communicative to start with, it wasn't as dramatic a change.  It is a real relief to have everybody up and being as demanding as ever (a pain in the neck, but still a relief). Great new development: sometime in the last few weeks, B. has learned to raise his arms when he wants to be picked up, which I find completely irresistable.  It's interesting how those social milestones still happen, but so delayed (he's 27 months old now). G. is trying so hard to talk! Except for waffle, he hasn't added any words recently, but he will walk up to me, stomp his foot, yell out one syllable, and slap his thighs with his hands.  I'm not sure if he has a word in his mind, or if it's a more general dissatisfaction he wants to express.    I went to my first Chuck E Cheese birthday party today. Ye gods! I'm not someone who thrives in an atmosphere of a lot of flashing lights and noise. I'd say J. dealt with it well (his first birthday party that didn't eventually dissolve into tired tears), but he did spend almost all of his tokens riding on a Telletubby ride that was intended for the really little kids.  He looked so blissful that I didn't try too hard to get him interested in the flashier activities.  Last night we watched \"Walk the Line\", about Johnny Cash and June Carter.  I'd give it three out of five stars.  Reese Witherspoon didn't work for me in that role, although I've liked her in other things.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/03/back-on-our-feet.html", "title": "\nBack on our Feet\n"},
{"date": "Thursday, March 15, 2007", "body": "\nI keep starting to write a new post, and I never finish it. Everyone in the family is doing pretty well, but I'm just a bit blue.  This actually seems like a pretty normal reaction to our family situation, but until now I'd focused so hard on being super autism mom that I didn't have time to get sad.  My husband tries to be helpful.  He is still convinced they are going to grow out of this, and just be slightly eccentric.  Believe me, that sounds like a great outcome.  And I do love them the way they are (which is very sweet, most of the time), but I also worry about them too. Despite my current gloom and doom, we had a really fun time this morning.  For the first time, I took them to a playground all by myself (well, I have done it before, but usually kept at least one of the twins in a swing or stroller, to prevent anyone going AWOL).  It's a fenced playground at our local elementary school.  We even had a picnic, and they all had a blast. G. and J. jumped in puddles, and B. went down a slide a couple of times before becoming fascinated with the mulch. It's a beautiful day out, and it did jolt me out of my slump a tad.  Sometimes I'm so glad that no one (except my husband) knows I blog.  I can say whatever I like.  There are several people (family members and friends)  who are determined to say that the twins are just fine. My coping mechanism right now is to respond with,  \"hey, I bet you're right\" and change the subject.  It's not my job right now to explain early childhood milestones, and that it's strange when your child does not hug you, or know his name, or want to get your attention.  On this blog, I can go ahead and say that I'm worried and I'm not always as optimistic as I could be.  For one thing, there aren't many people reading it.  And those who do read it have probably been down this road themselves. So, bah humbug, or whatever the seasonal equivalent is.  I'm sure this mood will pass! Until then, I\"ll self medicate with chocolate. Movie Note: despite my funk, I really enjoyed watching Stranger than Fiction.  It had an unusual plot and an interesting sound track.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/03/cant-shake-blues.html", "title": "\nCan't Shake the Blues\n"},
{"date": "Saturday, March 24, 2007", "body": "\nMy husband brought home a Discover magazine which has a very intense article about autism. Much of it concerns the possiblity that many cases of autism are caused by an interaction between genes and environmental toxicity.  The article also has a lot to say about DAN doctors, chelation, dietary approaches and supplements. I have mostly focused on behavioral approaches (PECS, Floortime, etc.) so far, because I find the biomedical approaches so overwhelming.  I did take B. off of dairy products for three weeks, but I almost felt that it had a negative effect. It's so easy for me to get caught up in thinking \"Am I doing the right thing?\", \"Should I be doing more research?\" and on and on.  I know that getting really anxious does not help anyone, so I need to calm down, think things over, and make decisions gradually. It doesn't help that my husband so far wants me to make all the decisions, because I have my masters in Special Ed.  That is too much responsibility for me.  Sorry if you are reading this, honey, but it's how I feel. Just had to vent.  Having a negative moment.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/03/biomedical-approaches.html", "title": "\nBiomedical approaches?\n"},
{"date": "Thursday, March 8, 2007", "body": "\nJust in the last two weeks or so, the twins seem to have read the memo and found out that they are \"terrible\" two's.   Looking back, one of my clues originally that all was not right in twinland was that they were just so quiet and agreeable, almost all the time.  Their brother could take a toy from them, we could go anywhere, leave anywhere, put them down for a nap, pay attention to them, ignore them, and no matter what, they were mellow and relatively happy. G. was always more attention-seeking by far.  He'll whine, or do a dance, or use signs or a word to get our attention.  With B., I've never known just how much he understands of what's going on around him. Suddenly they are trying to out-do each other in attention-seeking, with most of it being the wailing, throwing-yourself-down-on-the-ground variety.  They get mad if the other one's waffle looks larger, or if I comfort one after a tumble, seemingly neglecting the other, and on and on.  It makes for a noisy household, but it feels far more \"normal\" than the quiet of the previous two years. I have to admit that they've gone through cranky stages before, but this is the first time that the crankiness has seemed related to other people (rather than colic or teething, or some such thing). J. on the other hand is in a really sweet, affectionate stage. As I put him to bed last night he said, \"I love your teeth, Mom\".\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/03/attack-of-two-year-olds.html", "title": "\nAttack of the Two Year Olds\n"},
{"date": "Monday, March 19, 2007", "body": "\nSeem to be feeling better, which is a relief.  We've been getting outside a lot, running into neighbors and chatting, which cheers me up. This Wednesday I'm supposed to accompany a friend to some sort of champagne lunch with aromatherapy and massage at a fancy clothing store in downtown Houston.  This sounds great, but I am going to have to do a mini-makeover on myself between now and then.  Yesterday I found myself applying \"stain stick\" to my shirt while I was still wearing it.  And I hate to say, but I didn't take the shirt off right away, I continued running around with it on for another hour.   When I go out into the world, I assess my clean shirts for the one with the fewest Aquaphor and Desitin stains.  I'm not sure why it is, but the ointments we use for diaper rash seem to be the hardest things to get out of clothes.  And the twins flip and flop during diaper changes like huge fish fighting to get back to the sea. That sounds like a bad thing for a mom to say, but it's the analogy that always comes to my mind. By the time I get Aquaphor onto the key areas of the boy, there is usually also some on me. On the other hand when my husband will watch the kids so I can go have champagne and aromatherapy, I'll go in a shower curtain if I have to. My sister is coming to visit from Massachussetts next week, and I'm so excited.  We always have a great time together. She's going to be here to help out when we take the twins to TX Children's Hospital to see a developmental pediatrician.  G. goes on Tuesday, and B. goes on Wednesday.  I can't imagine they'll tell us anything too surprising, but I'm hoping they'll have some helpful suggestions.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/03/better-weather-equals-better-mood.html", "title": "\nBetter Weather Equals Better Mood\n"},
{"date": "Thursday, March 22, 2007", "body": "\nLately B. has taken to plopping down in the grass and gently touching the white clover blossoms which are everywhere right now.  That sounds so lovely, and looks pretty sweet, too.  The thing is, his interest in objects usual progresses through three stages: - lightly touching with the fingertips (a couple of days) - putting object gingerly up to his lips (one day) - consuming whatever the object is as quickly as possible (indefinitely) Well, we are only in stage two with the clover at this point, but there is a certain drawback which comes along with the whole exciting Texan lifestyle:  Fire Ants. Due to a very brief clover appreciation session today, both B. and I have fire ant bites on various body parts.  He is doing much better than I am at ignoring them.  I am a big baby about fire ant bites.  I alternate between looking at them, scratching them, asking my husband to look at them, and so on. After one dose of Benadryl, B. doesn't seem to notice them at all. I am ready to start a campaign to bring in some very tough breed of aardvark, but of course this might throw off the whole delicate armadillo/fire ant/flying cockroach ecosystem that we enjoy here in southeast Texas. I really do try to hide it, but sometimes my ambivalence about the Lone Star State comes sneaking out. But seriously, I'm wondering if a social story about fire ants would help.  My three-year-old recognizes their ant hills and steers clear, but B. and G. still see them as an inviting pile of sand.  So far I just yell out \"Ants, bites, boo-boo\" and things like that, and sometimes that does startle them into changing direction.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/03/ants-in-our-pants.html", "title": "\nAnts in our Pants\n"},
{"date": "Friday, February 9, 2007", "body": "\nHaven't felt very bloggish lately. Recent occurrences: While being careful to avoid neighbor's kids playing at foot of driveway, backed the mini-van into the basketball goal and removed the side mirror.  Made a big impression on J., who has now finally stopped yelling, \"Careful, Mommy!\" when I pull into the driveway. Was lent a book about RDI by a friend, and am reading over Stage 1 activities.   Have hubby's permission to turn downstairs bedroom into a sensory, gross-motor play room. Which it unofficially is anyway. Joined Blockbusters' online movie service, and intend to order as many feel-good, chick-flick movies as humanly possible.  So far I have Ocean's Twelve, which I seem to remember getting awful reviews.  Okay, not exactly a feel-good movie, but in a purely visual/esthetic/George Clooney and Matt Damon sort-of-way, I think it will fit the bill. Discovered Double Chocolate Milano cookies. G.  was able to say \"please\" (\"peez\") for exactly one day.  I'm sure it'll come back eventually.  He retained the ability to say, \"Ho, ho, ho\"  whenever we read Spot's First Christmas, which we have out of the library this week.  B. says numbers sporadically when other people are counting, and is still in the increased giggly eye-contact stage, which I'm loving. J. is as always keeping me on my toes.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/02/bloggers-block.html", "title": "\nBlogger's Block\n"},
{"date": "Monday, February 12, 2007", "body": "\nWhen I bent down to kiss G. good night, he started fake snoring.  After carrying G. up to bed, I started down the stairs to get B., and met him crawling up to meet me, with a big smile on his face.  This had never happened!  He also had his bedtime animal, Sprinkles, with him.  It's a little thing...he realized it was bedtime, and he was coming upstairs on his own initiative.  But it's also a huge thing, in my book. Quick review of Ocean's Twelve: the most unlikely plot I've seen since Ocean's Eleven, but I still enjoyed it.  At no point in the movie did anyone in a dinosaur costume sing or dance, so right there you know it's got something going for it. Next in the queue, Impromptu.  Un-nerving moment of the day: J (the supposedly NT big brother) has discovered dimmer switches, of which our house has many.  As I tried to clean up this evening, he dragged a little chair around and adjusted the lighting in each room until I finally put a stop to it.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/02/its-little-things-that-get-me.html", "title": "\nIt's the Little Things that Get Me\n"},
{"date": "Tuesday, March 20, 2007", "body": "\nSome unrelated notes: This evening B. was being so friendly and playful.  He kept looking me right in the eyes and smiling and laughing as we played.  I kept thinking back to what he ate today, or what activities we did.  Nothing in particular was different.  I did buy him a sugar cookie at the mall, which I don't usually do. Hmmmmm. He also seems more interactive after drinking milk, which goes against so much of what I read. I bought some particularly \"stimmy\" toys today, in hopes to use photographs for choice-making play sessions.  One is a deck of cards with Nemo pictures and alphabet letters on it, another is a squishy ball that lights up, and one a helicopter with a thing you can spin (can't think of the word....need sleep!)  I want to find some more cheap and irresistable toys which we will only use for this type of activity.  Each Early Intervention therapist has said to me, \"We have to get them to stick with an activity longer, they just run from thing to thing\".  Well, this is partly true, and partly that they are actually running away from the therapists.  With grown-ups they are fond of, they will sit and play for stretches of time (not compared to what their  brother was like at their age, but for short periods).   G. has become attached to a creepy-looking toy bat which we were given at Halloween.  He carries it around and signs \"bird\". The other evening, we were watching Barney.  When Barney started singing his final, sappy song, B. jumped in my lap and looked up at me and smiled.  Most likely, he was fleeing his older brother, who tries to put the twins in a head-lock of a hug every time he hears this song (he means well...he also tries to hold their hands and sway back and forth, which both twins hate).  Whatever the reason was, it was a nice moment.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/03/why-are-some-days-so-different-and.html", "title": "\nWhy are Some Days So Different? and other thoughts\n"},
{"date": "Friday, February 16, 2007", "body": "\nThis'll be quick, because I'm preparing for our first actual children's birthday party.  Up until now it's been just the family, but now that J is turning three, I have found the wherewithal to invite other people and their children into our home/therapy center.   Note to Self:  Next year, don't invite ten children thinking that half of them won't come.  Not only are most (maybe all?) of them coming, some are bringing siblings.  Luckily, the twins don't seem to mind crowds, as long as they can do their own thing. I'm very excited about seeing other adults who don't work for either Early Intervention or for me. Most of these people don't know that the twins have autism, so I asked my husband if he wanted me to take down the picture schedule and other PECS-type choice boards we have around.  I didn't know if he wanted to spend the party explaining  things to people.  But he's more laid back about such things and said to leave them up.  Movie Note: Impromptu was not as good as I'd remembered it.  I've ordered Stranger than Fiction, which looked funny.  Wish the previews wouldn't give away so much of the plot!   I have been trying to add pictures to this blog, and so far have not succeeded.  Maybe because we have an Imac?\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/02/birthday-preparations.html", "title": "\nBirthday Preparations\n"},
{"date": "Sunday, February 18, 2007", "body": "\nI'm happy to say J's party was fun from start to finish.  Six kids and a baby showed up, with their respective adults.  The grown-ups were able to talk because the kids basically entertained themselves.  B. and G. did their best to ignore the presence of other people, which seemed to work pretty well for them.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/02/tons-o-fun.html", "title": "\nTons O' Fun\n"},
{"date": "Saturday, February 24, 2007", "body": "\nG. has recently recovered from a stomach bug, and B. just came down with the same thing.  Their different reactions to it are fascinating to me. G. stopped signing and talking, and alternated between lying listlessly on the floor or asking (whining) to be held.  I held him and rocked him a lot, and tried not to worry about his not communicating.  Even after his tummy seemed to be better, he acted listless for a couple of days, and I was getting set to take him to the doctor.  He was the twin who had a harder time in the NICU, and has always been a little smaller, so I worry about him.  Then suddenly he was back to his old self, and even using a new sign, \"play\", and a new word, \"waffle\" (sounds like \"ra-ra\", but close enough). B. on the other hand seems more connected when he's sick.  He actually held onto me with his arms when I picked him up today.  And he noticed my return from the grocery store.  More and more, I realize that he shows the most reaction to me when under duress (visiting my in-laws with 6 cousins, at J.'s birthday party, or when he's sick).  Just have to work on transferring that reactions to happy times, too. I've been getting up a little after 6 and taking a walk most mornings, and it's been wonderful.  Many birds seem to be migrating through now, and it's been warm and a little foggy. The dog still refuses to get up, but I have to admit I enjoy being completely by myself.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/02/stomach-flu-and-its-effects.html", "title": "\nStomach Flu and Its Effects\n"},
{"date": "Thursday, March 29, 2007", "body": "\nTo get the whole hospital visit thing out of our system, my sister and I took the boys to the Moody Gardens aquarium on Galveston Island today.  it's so wonderful having my sister here.  When I was living my single life back in Boston, we saw each other every weekend, which was great. The last time we went to the aquarium in July or so, B. and G. seemed completely unaware of where we were.  This time they loved it.  G. (who has a slight penguin obsession) stood with his face squashed up against the glass, staring at the penguins.  Some of them swam right up to where he was to check him out.  B. went into his happy dance, clapping his hands and doing his fancy footwork the whole time that he watched the penguins.  J. enjoyed it, too, although he was torn between the penguins and the seals and had to keep running back and forth.  He especially liked a glass tunnel in which you could see sharks swimming overhead.   We had a picnic lunch and then walked down to look at the water.  We happened upon a great playground, and spent a while there until all three boys started to hit the fatigue wall and get cranky.  This time it was J. who got into the fire ants, but we got them off before they bit him.  He wanted to play with the giant chess set which was near the playground, so we gave it a try.  He's starting to be very interested in playing games, although chess for him right now consists of hugging the knights and ignoring all the other pieces. I can't wait until we can really play board games. This afternoon I felt as if B and G were trying to prove the doctor wrong about the MR thing (which at this point is pretty meaningless to me, anyway).  B has been saying \"up\", and a few other things.  G. was trying to do the motions to \"Head, Shoulders, Knees and Toes\".  When J. and I were playing hide-and-seek, both the boys tried to chime in whenever I counted to ten.   Playing hide and seek with J. is funny, because first of all, he usually hides in plain sight.  Then when I try to ham it up, and look all over, saying \"Where could J. be?\",  he can't help yelling out, \"Here I am!\"  Today the twins got very excited whenever I counted, and ran around the house when I got to ten.  It was nice because we were all playing together, even though they weren't actually looking for J., as far as I could tell.  Although, I can certainly see how the point of the game isn't clear to them, given the way we play it! My short term goal right now is to replace some of G's lost wooden penguins.  He started with three, and right now we are down to one, which has been chewed on quite a bit by the dog.  I actually called the toy store in Massachusetts where my friend bought them, but they were out.  I'll try the internet.  I know he'll deal with it if the last one gets lost, but he's so cute when he plays with it.  It jumps around, goes for a ride on a kiddy bike, kisses other little animals, etc.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/03/moving-onward-and-upward.html", "title": "\nMoving Onward and Upward\n"},
{"date": "Wednesday, March 28, 2007", "body": "\nWell, I finally realized why I'd been feeling so negative lately.  Our appointments with the dev. ped. were coming up, and I know deep down that we wouldn't hear \"mild autism\" or \"sensory integration problems\", which is what Early Intervention said originally. So we went in to TX Children's Hospital, yesterday and today.  B. and G. dealt with it amazingly well.  G. was especially excited by all the fish tanks, and Brendan was just happy to run around the waiting room with a big grin on his face. Everyone kept commenting on how calm and happy they were (they were there on different mornings, but we got the same comments).  Mom and Dad weren't so calm, but we did okay, considering.  We always seem to get along best in real high stakes situations. The doctor saw G. first.  She (the dr.) has a very nice manner, relaxed and encouraging.  Even though G. and B. basically couldn't do much of what she presented them with, she still said lots of positive things about them.  In the end, though, she said that she believes they both have autism, and fall in the category of mental retardation.  They each have their areas of strength, of course, but overall her assessments of them were similar. She did say that they have lots of potential, and she's impressed with how much expressive language they have already learned.  When she was observing G., he kept making his little toy man kiss his toy duck, which I thought was pretty impressive (not to mention very cute).   Her diagnoses weren't a surprise for me, but I still feel like I'm grieving in a way. It's one thing for me to believe they are delayed and autistic, it's another to have a specialist tell me they definitely are.  On the other hand, we now have letters of medical necessity, which we hope will force the insurance company to pay for private therapy.  They had to get blood drawn, to check for genetic anomolies.  G. was relatively okay with it, except for the actual stick. B. was so mad about being held still that he didn't even react when the needle went in.  It took him a long time to settle down.  They both fell right to sleep on the ride home. We are supposed to schedule MRI's, and also speech and OT evaluations.  For the MRI's we have to go back to TX Children's, but I'm happy to say we can do the other evaluations and therapy practically in our own neighborhood. I feel like this post sounds kind of detached and cold, but I'm a bit burned out after the last two days.  Telling my parents was the worst part, although by the end of the phone call we were all just talking about what wonderful happy boys they are, and my mom had basically convinced herself the diagnosis is wrong. I don't blame her.  It doesn't matter that much what the label is if they are happy. Thank you to everyone who's posted such encouraging and helpful comments.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/03/developmental-pediatrician-etc.html", "title": "\nDevelopmental Pediatrician, etc.\n"},
{"date": "Saturday, January 20, 2007", "body": "\nWe took one of our favorite outings this AM: Petco and then \"Sweet Mesquite\".  We made a speedy tour through Petco, checking out fish, cats, birds, chinchillas and other creatures in under fifteen minutes. B's favorite moment is always passing through the aisle of dog toys...\"BALL, BALL, BALL!\" (I've given up on the Wiggles'-based pseudonyms...I don't get enough sleep these days to keep such things straight) After this we always stop at a family restaurant, Sweet Mesquite (now under a new name, but I prefer the original).  They have a cuarto de familla (sp?) which features a slide, one of those sliding bead toys, and various video games.   The last few times we've been, B. has become absolutely fixated on one video game, which features various combinations of scary looking men fighting with each other.  He stands in front of it, shaking with excitement.  G. and J. are indifferent to it, although at one point when a muscle-bound Ninja type was boxing with a giant kangeroo (!!), J. did comment, \"That's not nice\". I tell myself he likes the quick movements and flashing colors, but I really don't understand it. We did manage to distract B. for short periods, during which he climbed up the slide several times.  We lucked out and had a really understanding group of kids there.  One boy joined B. in climbing up the slide, and the other kids just moved aside. G. spent most of his time eating, but did a little playing, too.  J. formed an alliance with a cute little girl, who tolerated him following her around. I think he prefers to play with girls, which is interesting. It felt like such a laid-back, run-of-the-mill family outing, and I was thrilled. The twins seem to be decreasing in their instinct to run immediately in opposite directions when released from the stroller.  And, I may have imagined it, but I thought B. just possibly might have turned around when I said his name today. All in all, it was a very good morning.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/01/very-good-morning.html", "title": "\nA Very Good Morning\n"},
{"date": "Thursday, January 25, 2007", "body": "\nYes, yes, yes!  The sun is shining after what seemed like weeks of rain!  The beautiful winter weather is what usually makes me feel that living in Texas is somewhat reasonable (my apologies to Texans, but I'm a dyed-in-the-wool Yankee who can't help herself) The past few days have begun to make me feel a bit loopy, or I should say, loopier. This morning I'm taking J., my NT son, to be given a full evaluation by the school district.  He only receives speech therapy right now, but he failed the motor skills screening, so they want him back.  He didn't like the testing last time, so he wouldn't even try on a lot of tasks. I've packed a bunch of bribes or shall we say positive re-inforcers.  Last time we were there I found myself thinking, \"He's at least average, I'm sure he is!\"  Having two younger ones who will definitely need special ed, I find myself really hoping against hope that J. will be for the most part \"typical\". J. is adopted, and I don't think he got great prenatal or postnatal nutrition, but he's the funniest, most creative kid around.  With all the articulation problems that he has, I imagine that learning to read will hold some challenges for him. That may be the dyslexia teacher in me jumping to conclusions. Well, I'm taking the sunshine as a good omen, and we'll just see what comes.  I'm trying to cultivate a more Zen-like approach to things in general. Yoga breathing while in traffic, etc.  So far, so good.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/01/early-morning-pondering.html", "title": "\nEarly Morning Pondering\n"},
{"date": "Thursday, January 18, 2007", "body": "\nWe took the twins to Chik-Fil-A (great indoor playground) this morning, for a chance to interact with other kids, and let's face it, to get out of the house.  Jeff (big brother) is at nursery school, and Lori, one of our amazing helpers, was along to toddler-wrangle. On our last few outings, I've noticed some funny looks, and I'm realizing that the twins' differentness is becoming noticeable to others.  I believe we're are entering into a whole new phase of autism-parenting: deciding how much to tell to whom.  For a long time I've been relying on saying, \"They're very shy\", which is true in a very extreme sort of way, I suppose. So far it's not actual misbehavior setting them apart.  They have an unusual way of approaching playgrounds, they tend to dance around a lot, especially in front of mirrors, and they use signs rather than speech, most of the time. It makes the twin situation feel so much more real now that others are finally noticing.  For months, it's been me trying to convince people (Early Intervention, their dad, their pediatrician) that there was a problem, namely PDD.  Now I find myself wanting to explain to strangers that it's not a problem, it's just the twins being who they are.   Favorite twin moments of the morning: Murray sitting calmly in a \"big-boy\" chair at Chik-Fil-A, enjoying his chicken nuggets Anthony attempting to dance \"The Pigeon\" with Bert on a Sesame St. DVD Favorite Jeff moment: The return of his Captain Feathersword pirate costume (flowered sun hat, sunglasses, rain boots, and a giant feather)\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/01/other-people-are-starting-to-notice.html", "title": "\nOther people are starting to notice\n"},
{"date": "Monday, January 29, 2007", "body": "\nFor reasons mostly having to do with my husband worrying about me, I'm  no longer blogging as \"momontheverge\".  That had just popped into my head when I first started commenting on blogspot.  I was thinking of the movie \"Women on the Verge of a Nervous Breakdown\", and meant it as humorous.  Not that it didn't seem pretty apt.  At that point I was sleeping between three and six hours a night, and feeling pretty loopy.  I've calmed down quite a bit since then. Anyhoo, I want to mention how sweet and giggly B. has been the last few days.  And not just the kind of giggly that he gets in the middle of the night, or when the credits of a movie start scrolling past.  He'll look right into my eyes and giggle back and forth with me.  We took him off milk a little while ago, but he keeps getting hold of G's sippy cup, so I don't know if  I could point to that as the reason. On an unrelated note, I had resolved to start getting up at 6:30 and walking the dog, figuring this would reduce B's tendancy to run through, jump in or sit in the doggie waste which we have failed to spot and clean up.  I was up, dressed, and feeling oh, so, virtuous when it became clear that the dog did not want to be walked.  The dog had jumped up onto my side of the bed, where it was nice and warm, and she was not going to budge.  Maybe I can get up at 6:30 and patrol the backyard with the \"pooper scoop\".  Somehow that's less appealing.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/01/no-longer-on-verge.html", "title": "\nNo longer \"on the verge\"\n"},
{"date": "Thursday, September 13, 2007", "body": "\nWell, the twins will be three in December, and the powers that be would like me to send them to PPCD (preschool program for children with disabilities).  Having taught special ed in this district, I've formed the opinion that for kids with HFA (which we don't have), PPCD can be great.  For others, it can be less than great, to be polite. There is one program for kids with language issues only, and another for everyone else.  My guys would be part of \"everyone else\". I'm generally a soft-spoken type of person, and right now I need a potion to drink which will make me ferocious, or at least, assertive and articulate.  I know my reasons, but I want to be able to express them in a way that doesn't (completely) alienate the school district, while letting them hear what could be better.  Right now the twins get hours of 1:1 services, and to sign them up for PPCD, I'd have to give up many of those hours.  What I need to do now is sit down and write out my reasoning, read it over, and practice (each time an ECI therapist brings it up) expressing what I know is best for the boys.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/09/and-so-it-begins.html", "title": "\nAnd so it begins!\n"},
{"date": "Saturday, September 15, 2007", "body": "\n Warning: self-pitying vent ahead I'm up too late, tonight, seeking solace in reading other bloggers' thoughts.  I feel as if almost every day someone says to me, \"I don't know how you do it\"  I usually say something about caffeine, or that I'm lucky the twins are very mellow. Recently that mellow-ness is disappearing, which may be good for them, developmentally (I think!), but not for my ability to cope. I feel as if I've hit a wall, and I can't find the energy and optimism that usually gets me through the tough parts.  J. can't understand why B. cries so much, or why G. plugs his ears and cries in response to B's crying. J. acts out, and then I end up mad at him.  It's not a great cycle to get into, but it happens at least once a day.   Going places with all three kids on my own is really, really difficult. Even with just the twins it's hard.  I'd like to take the twins to parks while J's at school, and let them get some exercise. Both are pretty good climbers on playgrounds, but their balance and judgement has not kept up with their ability to climb.  They won't walk places with me...they go limp and lie on the ground, or try to run away.  Occasionally one will walk well with me, but I can't risk it with two, especially if there are cars around.  So they end up in the stroller, which they are out growing.  What will I do when they don't fit in the stroller? Right now my plan is to find a bigger stroller. The twins hardly eat any foods that are really food, if that makes sense.  I know this is common, but I'm not sure what to do about it. My husband says maybe we are at the hardest age right now.  Once the twins can communicate better, and when J. is old enough to understand the situation better, things will get easier (we hope)  And, most likely, they will graduate from the stroller in the next couple of years. I remember when I worked at a private school for kids on the spectrum, almost all of the kids would follow along when we took walks through the neighborhood.  There was some bolting, occasionally, but I don't remember many kids lying down on the ground and refusing to move.  So maybe that's a toddler thing. I really look forward to being able to take walks with all the boys, and I've got to believe it'll happen. Usually I fixate on the bits of progress I see, and that keeps me going.  G. is a riot these days, saying new words all the time and trying his best to sing the alphabet song.  He is replacing \"Oh, no! Careful!\" with \"Okay!\" as his favorite utterance. B. has taken to quietly reciting the alphabet, but almost without moving his lips (I don't know if it's progress, but it's interesting to watch).  J. is really liking Pre-K, and is asking tricky questions like \"Do clouds sleep?\"  I feel a little better having written this.  I'm thinking of finding another college student to help us get out of the house more.  With another adult I can actually work on the walking problem, and go to playgrounds, the mall, etc. Something needs to change to get us back to our old happy state. \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/RuzYJIOso8I/AAAAAAAAAEc/5t9ylNmby9o/s1600-h/IMG_2988.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/RuzXIoOso7I/AAAAAAAAAEU/mnms9hm0YPY/s1600-h/DSCN1766.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/09/down-in-dumps.html", "title": "\nDown in the Dumps\n"},
{"date": "Monday, January 22, 2007", "body": "\nIt's funny, I would normally feel uncomfortable \"bragging\" about my kids' achievements, but since they're so far behind, it feels okay to go on at length.  Tried to get G. to wear rainboots for the first time.  He threw a big fit, and kept pulling them off.  I heard J. say to him, \"You want to wear boots or shoes?\"  G. then signed \"shoes\", which he's never done before.  J. answered him by saying, \"Good choice,\" which sounds like an echo of my special ed. teacher-y way of speaking. G. later allowed me to put the boots on him when he realized it was the only way to get to splash in puddles with J.  Luckily the pants I was wearing were essentially mud-colored to begin with. Other recent G. triumphs: I said, \"This is a book about hats\", and he patted his head. He pretended to sleep on a pillow on the floor, and imitated our fake snoring. He falls down on purpose, and laughs when we do it together. I hate to ignore B. in this post.  His progress is a little harder to track, because we have a lot of \"Did he just say that?\" moments.  The speech therapist heard him say \"Ready, set, go!\" very faintly.  He also said \"Q,R,S\", after we paused in an attempt to get him to sing \"P\".  He uses a few signs, but very tentatively, often when he thinks no one is looking at him. On the other hand, he is definitely the only boy in the house ever to have urinated in the potty! This happened last night at bath time, and I think it was an accident of timing, but we cheered like crazy.  Now if it would just inspire some competitive feeling in his big brother.   A funny J. moment:  After having a toileting accident, J. apologized to the character on his underpants-- \"Sorry, Benny!\"\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/01/seeing-progress.html", "title": "\nSeeing Progress\n"},
{"date": "Sunday, September 16, 2007", "body": "\nToday my hope is creeping back.  We went to church, and B. did great--walked from the car into the classroom, tried to color with a marker, didn't cry much, and so on.  Then J. and I took two toy fishing poles and went \"fishing\" at a local park.  It was very relaxing.  The only way I can possibly enjoy fishing is to be absolutely certain I won't catch anything.  The thought of actually having to do something with a poor, panicky fish is not my idea of recreation. We had magnets on the end of our lines, so I felt pretty confident.   Right now we are experiencing the miracle of three kids asleep at the same time, and I'm going to go watch an episode of \"The Office\" (American version).  My \"Office\" dvd's are my favorite couch-potato escape these days.  I watch everything: the deleted scenes, the commentary, everything.  I just love that show. Thank you to Burgiboogie for letting me know that you can put four-year-olds in strollers!  I should be in really good shape by that point, considering that they are already pretty hefty.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/09/had-better-day.html", "title": "\nHad a better day\n"},
{"date": "Friday, September 21, 2007", "body": "\n About a year ago, I kept thinking that the twins were due for their \"language explosion\".  Wnen their big brother was almost two, he started saying all sorts of words, adding new ones every day.  When the twins were almost two, although I was well aware of their being on the spectrum, I hoped that they'd suddenly start talking.  Echolalia, song lyrics, whatever, I didn't care, I just wanted to hear words. It didn't happen, although once we started watching sign language DVD's, we did make leaps with language for a while. Lately I think we are having the long-awaited explosion where G. is concerned.  For a long time, he amazed me with the signs he could pick up from DVD's, but somewhere in the past few months, he's begun to prefer speaking.  Today he said \"guitar\" and \"slow\" and \"stuck\", and probably some others that I've forgotten.  I just love hearing his voice, and I especially love how he'll turn toward me, hold something up, and then name it.  A year ago I remember worrying that he never showed me things (one of those classic diagnostic questions). Now he is so eager to show off.  He even said \"hi\" when a neighbor came over today.   This makes me feel all the more determined to hear what B is thinking about.  I know he will have things to say, eventually.  He is chugging right along with his ABA, so we're headed in the right direction. He's a man of mystery--usually aloof, but then coming out with a word or a killer smile when you least expect it. And every one of those words and smiles is so worth waiting for. \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/RvSUVynWGvI/AAAAAAAAAEs/yXNXwJwQ6eI/s1600-h/DSCN1718.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/RvSTtinWGuI/AAAAAAAAAEk/Qdr86lhFOsg/s1600-h/DSCN1770.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/09/language-explosion.html", "title": "\nLanguage explosion\n"},
{"date": "Wednesday, September 26, 2007", "body": "\nWe still haven't developed the disposable camera from the rodeo, but there is a video on their website. www.specialrodeo.com If you have some extra time, and are in a sentimental mood, watch it.  One of the twins is in it, looking at someone in a cow costume (very briefly) There is some debate in our family about which twin it is! Well, they are identical. In other news, we are getting a physical therapy evaluation.  This is nothing to do with autism. The twins each have a slight leg length discrepancy, due to extensive birthmarks (fading gradually) which somehow inhibit growth and muscle development.  This used to be what kept me up nights, before the whole autism thing.  Our pediatrician sent us to a leg lengthening specialist, before the twins were even a year old.  What I learned from that visit is that leg-lengthening is something you really do not want your child to need. I'm hoping the physical therapist will check them out and say that the discrepancy is nothing serious.  They don't limp, as far as I can tell at this point.  If the discrepancy stays small, they can wear lifts in their shoes, which sounds great compared to the alternative. G. had a little feeding therapy today, and ate a speck of whipped cream on a goldfish cracker. Every day has its triumphs!\n \n ", "outgoing_links": ["http://www.specialrodeo.com/"], "link": "http://hoopdeedoo.blogspot.com/2007/09/video-from-special-rodeo.html", "title": "\nVideo from Special Rodeo\n"},
{"date": "Monday, August 29, 2011", "body": "\nIt may be time to exhale, relax, and stop waking up at 4 AM feeling panicky.  We have a new teacher again this year, but I think she's another good one.  The twins actually seem happier in the afternoons this year, which is an encouraging sign. Last year G. used to hide in his bed and have to be coaxed out.\r \r The twins are back at their home campus, which makes big brother J. extremely proud.  I also get to hear snippets of their day from him.  For example, last week the Cookie Dough Fundraiser assembly was briefly halted so G. could leave.  Apparently he kept getting louder and louder.  I think it must have been one of those assemblies where they try to whip up a lot of enthusiasm by yelling into a microphone.\r \r This weekend at the pool, B. kept yelling out something that sounded like, \" COOKIE DOUGH! Hey, what??\" over and over.  Our favorite lifeguard, who is fascinated by the twins, is sure that B. is ready to get out there and sell.\r \r And, luckily, despite the yelling, and having to stop school assemblies, J. still says he is \"super proud\" to have the twins at his school.  \n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/08/another-good-teacher.html", "title": "\nAnother good teacher\n"},
{"date": "Thursday, September 27, 2007", "body": "\nThe ECI physical therapist came today to check out the twins.  She said the leg length discrepancy looks minimal. There's a more noticable difference in circumference, but that shouldn't cause problems.  She also said she had worked at Shriners' Hospital with kids going through leg-lengthening, but those kids all had dramatic length differences.  Apparently, if the difference is small, a person may limp, but might not even need a lift in the shoe. So, overall, very reassuring.  It's a great feeling  to have an evaluation turn out this way.   To be fair to ECI, they are really redeeming themselves in my eyes lately (somewhat).  They've hired an autism specialist, who comes to our house weekly, our new developmental specialist is great, and an OT showed me how to massage B., and lent me a book on massage for children. Although, the main reason I'm judging them less harshly lately may be that they are just supplemental to all the private therapy we're getting. I tried to show how much better the birthmarks have gotten with these two pictures, showing G's right arm.  i hardly notice them anymore. \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/Rvx9aSnWGzI/AAAAAAAAAFE/7kOKlfKci6Y/s1600-h/DSCN0726.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/Rvx-OSnWG0I/AAAAAAAAAFM/vea4pvX2G7o/s1600-h/DSCN1789.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/09/legs-are-looking-good.html", "title": "\nThe Legs are Looking Good\n"},
{"date": "Thursday, May 12, 2011", "body": "\nIn homage to Susan Senator's occasional lists of what really makes her happy, here are some of my keys to the universe: 1. a planned trip to see my parents, my sisters, my nephew and my dog-nephews 2.  newly-discovered Chai tea bags 3. watching 30 Rock DVD's with my husband after all the boys are in bed 4. watching Dancing with the Stars with my oldest son 5. spring rolls from Pho 21 6. painting the bathroom with the radio cranked up 7. walking on the abandoned golf course in our neighborhood 8. going swimming with B. and watching him teach himself to swim 9. sitting out on the deck after dark while G. marches around singing his Christmas song medley That is a very satisfying exercise.  It's a good antidote to compulsively going over my worries in my head!  I am going to make these lists more often.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/05/keys-to-universe-la-susan-senator.html", "title": "\nKeys  to the Universe, a la Susan Senator\n"},
{"date": "Wednesday, July 20, 2011", "body": "\nRight now, everything is about toilet training, and I do not feel like blogging about it. Although if anyone can recommend pajamas which absolutely cannot be stripped off, please let me know.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/07/right-now-everything-is-about-toilet.html", "title": ""},
{"date": "Thursday, May 26, 2011", "body": "\nIn the last few months before we quit ABA, our insurance suddenly deigned to cover a fraction of it.  Now the therapy center is asking us if we'd like to come back for some hours this summer.  Ahhh, the joy of deciding how much and what therapy to get! To be honest, I haven't seen any big regressions since we quit ABA.  Also, the twins qualified for 18 days of Extended Year Services (that's the most you can get, so I am happily surprised). Right now, there isn't even a little part of me that wants to take them back to the ABA center although I do miss the therapists.  Am I denying them something that might help them?  My gut says no, but who knows? The alternative summer plan: They will be getting many, many hours of aquatic therapy (aka floating around in the neighborhood pool with Mom).  Also ample opportunity to use technical interfaces (IPad), and various community outings (Target, Walmart, Kroger).  They will have access to an embarrassingly large library of children's books (my shopping weakness) and opportunities for play in inclusive groups (the neighbors' children and their big brother). We will be working on trying new foods, using the toilet (God willing) and staying clothed.  Even to myself I sound defensive, but we'll see how it goes.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/05/to-aba-or-not-to-aba.html", "title": "\nTo ABA or not to ABA?\n"},
{"date": "Saturday, December 18, 2010", "body": "\nRecently my mom was in a one-car accident, which caused what was essentially a stroke.  When she first woke up, she seemed very alert and able to converse.  Since then she has talked less and less, and now comes out with occasional clear sentences every day. As I talk to my dad, who is there with her, I keep being struck by the similarities with my first years that I knew the twins had autism.  They would say something, and then not talk for weeks at a time.  It was a kind of torture.   I don't really know if it's true, but I told my dad that I believe my mom still has it all inside her.  Right now her body is working on another part of her recovery-- she's getting a lot of physical and occupational therapy.  Maybe that's taking all of her brain power right now.   One thing I've found, even though the twins still don't talk much, is that it's ALL still in there.  They still know what they used to know, and much, much more.  And I'm pretty sure that my mom does, too.  It's another situation that calls for more patience than I ever thought I had.  Hopefully we'll go back to making progress soon, but meanwhile don't look too far ahead, and find joy in every little good thing that happens.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/12/strange-parallels.html", "title": "\nStrange parallels\n"},
{"date": "Monday, April 11, 2011", "body": "\n Since our first family beach trip last year, we've resolved to go down more often, especially in the off times.  No one in our family likes a big crowd, but we all love the surf and an empty-as-possible beach.  So, this past Saturday we packed up and headed back down to Galveston. If you are used to New England beaches, it's a bit of an adjustment.  To me it doesn't seem as clean, and there's no zoning, so the development on Galveston isn't exactly quaint or charming.  On the other hand, you find a nice cross-section of the local poplulation on the beach, with a fun, multi-lingual, multi-cultural feel. It was very grey and very windy.  The boys loved the waves, which seemed a lot bigger than usual.  Afterwards we went out to Mooyah Burger, which everybody liked or tolerated really well.  When we go out and have such a normal family day, it's a really great feeling.\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-4PIfCnZj_u8/TaNXJ338DZI/AAAAAAAAAdg/togHfUZTQ7g/s1600/IMG_0294.jpg"], "link": "http://hoopdeedoo.blogspot.com/2011/04/galveston.html", "title": "\nGalveston\n"},
{"date": "Monday, December 20, 2010", "body": "\n My dad just called and said that this morning my mom was suddenly conversational again.  She told him where the Christmas tree ornaments are, and which grocery store has the chicken nuggets that the twins like. Keep the faith!\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/TQ-m_LXOsMI/AAAAAAAAAbo/C2bRKg82t5A/s1600/DSCN0475.JPG"], "link": "http://hoopdeedoo.blogspot.com/2010/12/my-dad-just-called-and-said-that-this.html", "title": "\nWoo hoo!\n"},
{"date": "Wednesday, April 27, 2011", "body": "\n J. had a different friend over the other day, and i was appalled!  B. was sitting in a chair on the deck, looking around at the trees, as he often does.  I overheard our neighbor's son saying, \"He's so boring!\"  J. just laughed nervously.  Then the little boy said, \"Make him scream again!\"  I think he was talking about the happy shouts that B. tends to make when he's jumping around the house.  J. was at a loss and just looked at me.  I was so disappointed in this boy's attitude, but I tried to think to myself that he's nervous around B., and doesn't understand what's going on.  So I did my best to explain autism in a few sentences, but I couldn't tell if it made much impression.  I was so annoyed by the whole interaction.  I don't know the boy's parents well, but I know the dad is always very kind toward the twins, and invited us to join a camping group he's in.  I think I'll ask the dad to talk to his son about it. Afterward I talked with J., and said there will always be some kids who don't know much about autism, and if he wants, I'll explain things to any of his friends.  J. seemed much less concerned about it than I was.  Looking back, I'm realizing that the rest of J's friends are amazingly accepting about the twins.  Our next door neighbors have a daughter with developmental delays, so between our two houses there's a lot of happy shouting, partially-clad escape attempts, and toilet-training mayhem.  To live on our street is to have at least some understanding of six year olds with special needs!  I think it was good to have a wake up call that there will be rude questions and clueless comments from kids J's age, and I need to think up some strategies to deal with them. To me the twins are so adorable, I can't imagine anyone saying anything mean about them, but it is going to happen.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-xjipPYMdXQk/Tbg4Vp1ZVtI/AAAAAAAAAdo/LrRSIYnR1bA/s1600/DSCN4485.JPG"], "link": "http://hoopdeedoo.blogspot.com/2011/04/on-other-hand.html", "title": "\nOn the other hand...\n"},
{"date": "Wednesday, April 13, 2011", "body": "\nWell, apparently I am backing off on the potty training once again.  Although we were focusing on G., it was B. who made some improvement.  G. just became stressed, aggressive, and started saying, \"Sleep?  Sleep?\" in the middle of the afternoon, hoping I'd put a pull-up on him and put him to bed.   I know that some day, G will use the bathroom.  He can wait hours and hours, he can ask for what he needs and he can go when he decides he's ready.  We just need to change the location of where he likes to go or actually, HE needs to change the location of where he likes to go.   On a related note, a Hoover SteamVac should be arriving at our house in 3 to 5 business days, and boy is it going to be busy!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/04/potty-training-update.html", "title": "\nPotty Training Update\n"},
{"date": "Saturday, April 16, 2011", "body": "\nJ., my oldest son, had a friend sleep over last night.  His friend is an only child and is always  surprised by the reality of our household.  With the candor of a seven-year-old, he has suggested a few times that I clean up the house more often.  He also reports the twins' escapades to me in a panick=y voice at frequent intervals.  It's usually along the lines of \"B. is naked!\", \"G. is on the kitchen counter!\" or \"B. is jumping on the IPad!\".  Actually those are all actual quotes from last night. This morning, while B. and my husband were still sleeping, I took J, G and J's friend out to the kolache and donut shop.  We got our treats and sat at a table to eat.  After we'd been there a while, J's friend said, \"Hey, Greg is doing really well!\" That warmed my heart so much.  For one thing, J's friend is getting some perspective on the whole situation.  And,  he was right, G. was doing really well.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/04/j.html", "title": "\nThanks for noticing\n"},
{"date": "Wednesday, March 23, 2011", "body": "\n As the twins begin to out-grow any standard pull-ups except the overnight huge ones, the time has come to get serious.  We are trying an underwear-only, use the potty every thirty minutes approach.  Well, not every thirty minutes for both of them or I'd be totally nuts by now.  But we are really doing it with G., who up til now has specialized in waiting seventeen hours to go and then flooding himself and anyone nearby. And, despite his complete lack of interest, an even smellier house, and tons and tons of carpet cleaner and wet towels, Greg is occasionally going in the potty!  He would prefer to hide in a closet, or wait til bedtime when he finally gets a  pull-up, but for the first time in his life he is sometimes sitting down on the toilet and actually going. It's only been two weeks or so, and I foresee many months of this, but it is progress and I am so happy.\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-mt302o-4OzY/TYrLAS7DSOI/AAAAAAAAAc0/9LuFQ575ufo/s1600/IMG_0213.jpg"], "link": "http://hoopdeedoo.blogspot.com/2011/03/potty-training-and-i-mean-it-this-time.html", "title": "\nPotty training, and I mean it this time!\n"},
{"date": "Friday, January 21, 2011", "body": "\nI just wrote a depressing post about how G. used to use language in a more social way back when he was two.  But I decided not to hit \"publish\".  Now he comes up to me and puts his hands on my cheeks, or presses his nose into my face and inhales lovingly.  So what's to complain about really? Also, on the big news front, B. has decided that his big brother is funny.  If J. hops into B's bed, or gives him a bear hug, or better yet, lies down on top of him, B. gets a fit of the giggles.  It doesn't always work, but when it does, it is such a joy to see!  They'll wrestle around and laugh, until it usually ends with B. getting over-excited and grabbing his brother by the throat.  That doesn't sound so great, but it's meant in a loving way, I\"m pretty sure. It's so nice that things like this can come up and surprise you, even if you have to wait til they turn six.  I think of myself back in my desperate Floortime days--trying so hard to get them to do pretend play or interact with each other.  So many things just have to happen in their own time.  As frustrating as that sometimes is!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/01/brothers-acting-like-brothers.html", "title": "\nBrothers acting like brothers!\n"},
{"date": "Tuesday, January 25, 2011", "body": "\n Just putting this in here to remind myself of my pledge to take more pictures.  Not that this idea will go over well with the twins... Then there are some people who don't mind at all!\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/TT84ruOcXTI/AAAAAAAAAb0/G9PxXYxNdjM/s1600/DSCN4398.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/TT85V70j9NI/AAAAAAAAAb8/Va_hSCBLKgY/s1600/DSCN4239.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/TT87A4XtGwI/AAAAAAAAAcE/aGV_8jbGC30/s1600/DSCN4371.JPG"], "link": "http://hoopdeedoo.blogspot.com/2011/01/just-putting-this-in-here-to-remind.html", "title": ""},
{"date": "Thursday, May 5, 2011", "body": "\nThis Monday we went on a field trip to the Houston Zoo.  It was a beautiful day, and we had a great time (although the twins aren't at the point of being very interested in the actual animals yet).   At the very end, in a huge crowd of Houston schoolchildren waiting for buses, a paraprofessional spaced out, and Brendan disappeared.  I had G., and I walked up to the group of aides, and asked, \"Where's B.?\"  They hadn't noticed he wasn't there.  Next came fifteen minutes of running around like a mad woman, asking the zoo officials to close the zoo gates, and saying to random people, \"If you see an autistic-looking boy in a blue shirt, grab him\".  The teacher had stayed back at the school, so I had to take charge of the situation. Despite all these years of private therapy, public education, etc., the twins have no sense of danger, and no sense of the need to stay with a group. They might respond to their names in a quiet setting, but definitely not outdoors in a crowd.  Luckily, a para found him standing in the gift shop.  We still don't know exactly how it happened--he was sitting in a wagon, and the para thought he was buckled in. Today we are going on another field trip, to a boardwalk, which is right next to Galveston Bay.  I almost stayed home with both of them, but I can't keep them home from everything.  Letting my guys go off to school, on trips, etc. requires so much trust of people I don't really know very well.  I don't know how to balance worry/caution with trust.  It's written into both boys' IEP's that they will run off, and I'm trying to think of other precautions we could take (including getting B. a service dog).  With J., their big brother, I don't have any of these concerns.  I need to find a way of trusting in aides, teachers and fate more than I do right now.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/05/b-gets-lostand-how-to-trust-that-it.html", "title": "\nB gets lost...and how to trust that it won't happen again?\n"},
{"date": "Tuesday, October 4, 2011", "body": "\nIf anyone is actually reading this blog (other than my sisters, who only comment in emails... which is fine, by the way), I have to recommend TeachTown. It's Discrete Trial Training, so limited in that way.  On the other hand, if you have a child who is hard to motivate to do work, it could be just the thing.  G.  is working up a storm, although he still wishes it were YouTube.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/10/if-anyone-is-actually-reading-this-blog.html", "title": ""},
{"date": "Friday, October 28, 2011", "body": "\nTomorrow will be our second Saturday of Special Olympics bowling.  I think what I like most about it is that it's purely for the kids.  No discussion of treatment, cure, progress and so forth.  Just fun. \n \n \n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/10/lets-get-physical.html", "title": "\nLet's Get Physical\n"},
{"date": "Tuesday, June 28, 2011", "body": "\nThe ABA-less summer is proceeding fine.  So far we are all about toilet-training and going to the pool.  Unfortunately combining those two things is not necessarily so great.  I think of taking the twins to the pool as \"swim diaper roulette\".  We haven't been banned from any pools, but that may be because of lifeguard cluelessness.  Enough on that topic. J. is having a mixed summer-- the days are going okay, but in the evening he is falling back into some old behavior issues.  I think he keeps a lot of frustration about life with the twins inside, and when it's too much, he unleashes it toward my husband and me.  In the daytime he is usual creative and funny self. One night lately I managed to sneak out and meet another local autism mom.  We talked so late they closed the restaurant before we'd realized it (we were on the patio).  She is trying hard to move to the Northeast and says she refuses to send her daughter to Texas schools.  I will miss her if they move, but I understand wanting to get somewhere with more services.  I've actually been avoiding support groups lately, but a support group of two was probably what we had both been needing.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/06/so-far-so-good.html", "title": "\nSo far, so good\n"},
{"date": "Wednesday, April 11, 2012", "body": "\nI am a true blog slacker.  For a brief update, we are having some problems with scratching and biting.  I wear long-sleeved shirts.  Other wise I get looks and people asking, \"Do you have a cat?\" J. (the non-autistic brother) is absolutely obsessed with Michael Jackson and dancing to the Wii game \"The Michael Jackson Experience\".  It's actually a fun thing for us to do together. Potty training continues, and we are making glacial progress.  J. has a group of understanding friends who can handle the occasional partially clad twin running through, usually being chased by me (fully clothed) and the fact that you have to take your own soap and toilet paper into the bathroom.   School is going all right.   Some administrator decided the twins cannot skip art class, which they had been doing because of the art-supply eating fixation they both have.  Of all the issues I have with Texas special ed., missing art class is not an important one.  It was not even on my radar.  God forbid they are not getting the Texas TEKS in Art!  Meanwhile they can't even get 1:1 Speech therapy or OT.  Uh-oh, here I go.   I had been resolving to be more positive or at least keep more of my sarcasm to myself.  Hence the dwindling number of blog posts.  Although the blogs I enjoy reading are often pretty sarcastic. \n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2012/04/blog-slacker.html", "title": "\nBlog Slacker\n"},
{"date": "Friday, February 17, 2012", "body": "\n I was looking back at the blog archives and realized I used to post a lot more than now.  I would pay so much attention to each word the twins said, or especially to anything they stopped doing.  That was such an intense time.  Well, it's still an intense time, but I feel more sure of who the twins are.  I always used to be looking for a clue that they'd turn out high-functioning.  Oh, those words... \"high-functioning\"!  They were like Harvard or Yale, or \"gifted and talented\".  Now I feel like I know they have a lot in there, but I also feel pretty sure they will need a lot of help throughout their lives.  \"High-functioning\" has been replaced in my mind with \"toilet-trained and able to communicate what they have to say\".  Now I think i'm more able to enjoy their quirkiness, and less apt to see everything as a clue to what they'll be like as adults (on the good days, anyway). Going to get them early today, to use the IPad and IPod.  Would like them to be able to use the IPad at school, but that's a whole other can of worms. \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-L0d0rRxroTs/Tz6YAQ5G7HI/AAAAAAAAAd8/ndKbfWs8Yqw/s1600/IMG_0077.jpg"], "link": "http://hoopdeedoo.blogspot.com/2012/02/too-busy-to-blog.html", "title": "\nToo busy to blog!\n"},
{"date": "Sunday, May 6, 2007", "body": "\nThank you for all the supportive comments. It really helps. I did send an email to the doctor, but she has not responded.   Strangely, we had a really nice weekend.  I just can't let myself believe that anything really bad is going on, so I'm in serious denial mode.  We took all the boys to Petco, without a stroller, which was a first.  My husband had B., who isn't interested in looking at all the animals, but does like to jog around the store.  I had J. and G., both of whom are very interested in the fish and the birds, so we did well.  I kept wondering how my husband was doing with B., and then I'd hear a loud \"Zubadee, zubadoo!\", which is one of the \"jargon\" phrases that B. likes to say when he's very happy.  This morning I took B. and J. to church with me.  As J. later reported to me, \"Him just cry a little\".  B. even sat at the table for snack, so the morning was a success. When I went out to the playground to pick the boys up, B. was up on the play structure, looking very pleased with himself.  G. stayed home and napped, because he had woken up at five saying \"Ah-doo! Ah-doo!\", which means all done with sleeping, apparently. I figure, if we are going to find out that the MRI doesn't show serious problems, then I won't need to have worried.  And if there is a real problem, then it's good that we had a weekend together of enjoying ourselves before we start dealing with it.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/05/havent-heard-anything-about-mri.html", "title": "\nHaven't heard anything about the MRI\n"},
{"date": "Saturday, June 23, 2007", "body": "\n In ABA the other day, B. stacked one block on top of another.  Just one, but that was a missing milestone that always stuck in my head, because it seemed so basic.  He also picked up a bean off the table and dropped it in jar.  These aren't things he's working on...his therapist helped him do them a few times, and then he did them himself.  That is a big, big change. More importantly, he seems to look at us a little more, and smile at us a little more, as the days go by.  G. is very into \"hiding\" these days.  When I say \"It's time for bed\", he runs and hides behind some curtains.  Then, If he manages to sneak his tiny penguins into bed with him, he bunches up a blanket and holds the penguins under it.  To me, that shows some \"theory of mind\".  He knows the penguins are there, but he thinks we won't. He's not at all subtle about the hiding, which is kind of cute. J. has been coming out with comments like, \"This is a fun morning\", \"This is a good breakfast!\", etc.  Maybe he's learning to butter me up, but hey, it works.\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/Rn2ELlJncrI/AAAAAAAAAB0/bj3j-aUCiX4/s1600-h/2936.jpg"], "link": "http://hoopdeedoo.blogspot.com/2007/06/nice-little-moments.html", "title": "\nNice Little Moments\n"},
{"date": "Wednesday, March 30, 2011", "body": "\nOh, I'm so excited!  I'm talking to some other people from my church about having a special needs class next year, at least one or two times a month.  We've got some boys/young men with moderate autism, a young man with Angelman Syndrome and another young man with Down Syndrome who don't really have anywhere to go during church.  They end up in the infant room, which is okay, but not really the best for any of them.   We are thinking about music, sensory activities, crafts (not my idea, but okay), bubbles and so forth.   Inclusion is wonderful, some of the time, but sometimes the opposite of inclusion is even better (well, not exclusion, but you know what I mean).\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2011/03/church-for-all.html", "title": "\nChurch for All!\n"},
{"date": "Monday, May 7, 2007", "body": "\nI've found a new way to feel good about autism:  spend a weekend thinking your son has not only autism, but also some weird myelin-depleting condition.  Just plain autism sounds great to me now. The doctor finally called and said, \"Oh we see hypomyelination in lots of our kids [meaning patients with autism].  We don't refer them to neurologists, because there's nothing you can do\".  So whatever it is (she didn't explain it, and I was too relieved to formulate questions), it's not getting worse, and according to the doctor, could actually improve as he starts to use more parts of his brain.  That doesn't sound very medical, but she said something along those lines. Yikes, what a crazy situation.  If only that staff member could have kept quiet!  I'm sure she's in some kind of trouble now.  I feel as if my brain has turned to mush.  My husband kept asking if I'd asked her this or that (for example, does B. have the same condition).  I don't think I asked anything once I realized it wasn't anything progressive. I was thinking. \"Yippee!\" and wanting to get off the phone.  She also told me that his bloodwork is normal, which was good to hear.   So now I'll spend a lovely afternoon enjoying my merely-autistic twins and their merely-articulation-challenged big brother. Ahhhhhh......\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/05/phew.html", "title": "\nPHEW!\n"},
{"date": "Wednesday, August 1, 2007", "body": "\n The retreat is over, and things are back to normal, such as it is.  I had an absolutely wonderful time. Whenever I called home and spoke to my sister, she said things were going great.  The one time my husband answered things didn't sound so rosy, but I think it was just a matter of perspective. Getting away for a weekend was the best thing I've done in months!  There was a lot of silliness, chatting, eating, chick-flick watching and even actual full-fledged conversation.  Everyone there was a teacher or former teacher, but I managed to stay off the topic of special education for the most part. I made a little scrapbook for the boys with pictures of them and very short sentences describing the pictures.   It's good to be back, but we are having some new sleep, or really non-sleep, issues, so it's difficult to blog coherently. A big thank you to my husband and my sister for letting me get away  and goof off! \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/RrEAvZGdqLI/AAAAAAAAAC0/MUuKJphlH_w/s1600-h/sweeping+porches.jpg", "http://3.bp.blogspot.com/_ccuTsPgAAcc/RrEA9pGdqMI/AAAAAAAAAC8/GlFzk3sxEzI/s1600-h/Wallis+Scrapbook+Retreat+126.jpg"], "link": "http://hoopdeedoo.blogspot.com/2007/08/back-from-retreat.html", "title": "\nBack from the retreat\n"},
{"date": "Saturday, August 4, 2007", "body": "\nB. has always loved to dance in front of the mirror.  Lately, he has added in more vocalizations.  It used to be a lot \"Aaaaaah\"s, but more and more it is strings of syllables that have the intonation of speech. Yesterday, he was listening to a Signing Time CD (I'm embarassed to even mention Signing Time again, but it seems to have a magical power in our home), and started trying to sing along with a song... Lay down on your bed, Pull your blanket high. Turn out the light. Welcome the night. Dream, dream, Sweet dreams. It's sung as a round, which I would think would be confusing, but it is the first time he has ever tried to sing along with a song! He has filled in final words, but that has such a different feel.  Since then, I have overheard him trying to sing it a few times while looking at the mirror. For so long, I felt I mostly had G's progress to blog about, and it feels so great to be writing this about B! \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/RrU6zpGdqNI/AAAAAAAAADE/H23I2f0MBxA/s1600-h/DSCN1744.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/08/starting-to-sing.html", "title": "\nStarting to Sing\n"},
{"date": "Monday, August 13, 2007", "body": "\n Our one remaining ECI therapist just called to schedule the twins' annual IFSP meetings. She said, \"Hard to believe it's been a year, isn't it?\" I wanted to say, \"Oh, honey, it feels as if it's been a lifetime\".  But she's new, and I like her, so I just said, \"Yeah\". Last summer the ECI evaluator told me she thought I was imagining PDD because I was a special ed. teacher, and was over-reacting.  She thought it might be sensory integration problems or maybe mild PDD.  I have never, ever wanted so much to believe someone, but I just didn't.  I called this blog \"Hoopdeedoo and PDD\", because that soundsd milder, and I was still hoping for \"mild\".   I love my boys for the wonderful, silly, sweet guys that they are.  I also would love for them to have a milder kind of autism, whatever that means.  My oldest son calls any food which isn't absolutely bland \"spicy\" (yogurt, orange juice with pulp, etc.)  I was thinking that rather then considering our situation \"severe\", I could think of that other opposite of mild: spicy.\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/RsDInZGdqOI/AAAAAAAAADM/jlzxrlJFpEY/s1600-h/DSCN1740.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/08/opposite-of-mild.html", "title": "\nThe opposite of mild\n"},
{"date": "Sunday, May 4, 2008", "body": "\n Won't even try to explain my lack of blogging... Ever since a family with five kids moved in next door, J's life has changed.  He's over there, they are over here, we're all playing in the front yard (only possible when one twin is asleep or I have an extra grown up).  J. is in heaven. Today he has spent the entire day helping them sell lemonade, and he cannot stop smiiing.\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/SCNzte_0IEI/AAAAAAAAAN4/5TZ0WCGDeQ0/s1600-h/DSCN2500.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/SB4gyx8WRtI/AAAAAAAAANg/mwEzbQlyLe8/s1600-h/DSCN2500.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/05/j-goes-into-business.html", "title": "\nJ goes into business\n"},
{"date": "Tuesday, May 20, 2008", "body": "\n I was going to call this post \"Flunking out of ABA\", but it was tongue in cheek, and I don't feel all that glum about it. After a surge in imitating words from B., ABA hasn't yielded many noticeable results lately.  Outside of ABA, both boys are doing well.  G. is using little phrases here and there (\"come on, Mom\", \"My turn\", etc) The phrases are echoed from DVD's, but he uses them appropriately!  He was in a phase of reciting entire Backyardigans episodes, mostly in his own jargon.  That was getting old, but he seems to be moving out of it. B. is progressing in his own way, at his own pace.  He knows what he wants more than he used to, and he notices other kids more, and he is great about being affectionate. Now to the flunking out of ABA part.  G. has had them stumped from the beginning. G. knows his letters, numbers, colors, shapes and so on, but he was not going to do a thing for the ABA therapists. Nada. Every week, the head therapist would tell me some new approach they were trying with him, to the point that we joked about it at home. B. tries hard, but imitation is not his thing right now(oh, those mirror neurons!), so he has them stumped, too.   Lately the ABA center keeps scaling back on what they are working on with both boys.  Each week they cut back on something.  Last week they decided not to work on motor imitation anymore because they are \"not ready\" for it (fine with me, it was just stressing them out).  Then they decided not to focus on fine motor skills. Okay.  Today they said they are going to try to make them \"feel successful\" and really reinforce eye contact and pointing. For three hours?  That's a lot of eye contact and pointing. The therapists themselves are wonderful and warm.  But I have to say, I don't know how long we are going to stick with this  G. learns things on his own, no matter what we do.  B. has definitely gotten something out of the ABA, so I'm more willing to send him for longer. I'm formulating some questions for the lead therapist, but deep down I'm relieved that ABA is not the be-all and end-all for us. For whatever reason, the twins learn more by playing at home than they do at any therapy we've tried. We do a mix of sensory integration, hanging out, being silly, going to playgrounds, watching movies and goofing off. We eat a lot of gluten and casein. And starting in the fall...preschool.  We are going through with it this time! Really, I mean it. I'm glad we are giving the ABA a try, and I think we'll stick with it through the summer. Part of each week, and the rest of it will be the usual summertime business.  \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/SDOSZg0MkXI/AAAAAAAAAOQ/VCPfIswCwss/s1600-h/DSCN2058.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/SDOPFQ0MkVI/AAAAAAAAAOA/KV4fhgJtCn4/s1600-h/DSCN2525.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/SDOPvA0MkWI/AAAAAAAAAOI/zpVITxp7TmI/s1600-h/DSCN2516.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/05/applied-behavioral-what.html", "title": "\nApplied Behavioral What?\n"},
{"date": "Wednesday, January 2, 2008", "body": "\nMy brother-in-law and nephew did some fidddling for us, while B. danced. \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/R3xgVlfyLDI/AAAAAAAAALI/h_A4LPTZYmo/s1600-h/DSCN2298.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/R3xe-FfyLBI/AAAAAAAAAK4/-Gcs-DqoLCo/s1600-h/DSCN2302.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/R3xfaVfyLCI/AAAAAAAAALA/GaKpG-VfDfk/s1600-h/DSCN2308.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/01/wordless-wednesday.html", "title": "\nWordless Wednesday\n"},
{"date": "Wednesday, March 19, 2008", "body": "\n At the twins' eighteen month check-up, a little light went off in my head which said \"autism\". The first month after realizing this was the hardest, partly because no one believed me. Feeling sure that I was right, I went into a flurry of researching, reading, and generally freaking out. By the time they turned two, no one tried to argue. The last year and a half or so, i've often thought of my state of mind as \"waiting to exhale\" The phrase comes from the novel by Terry McMillan, which I read in the early nineties.  My life is so different from the women in her novel, but the title exactly fit the feeling I had. For the first year, I threw myself into Floortime, combined with what I could figure out about Sensory Integration.  I put all kinds of pressure on myself (and the rest of the family), trying to create \"circles of interaction\".  G. seemed to respond, and B. remained ever-cheerful and pretty much happily self-absorbed.  Finding the Signing Time DVD series jump-started our communication, and gave me more hope, but I was still worried and driven. That whole time, I never relaxed, never stopped spending every day wondering if I was interacting enough, engaging them enough, should I be doing GFCF, etc.  I'm still this way, some of the time, but I feel...like I'm thinking about exhaling.  I don't know if it's turning three or starting at the new ABA center, but the twins are changing.  G. is talking and making connections (he looked at a little CD player, glanced at me and asked \"Telephone?\" B. is showing interest in activities (coloring, painting, looking at books), and is repeating all sorts of words to get what he wants. More importantly, he is seeking us out for attention (which he used to do a couple of years ago). In G., it's a speeding-up of his usual learning style. In B. it's sometimes a subtle change, but a really, really nice one. The twins have always been sweet and wonderful.  And now it's great to have the experience of \"When did he start doing that??\" with them--that feeling of realizing they are growing up, and you don't know if you are ready. I feel it all the time with J., and now I'm beginning to think it about all three of them.   \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/R-HYAKmJI_I/AAAAAAAAANA/SLnK07FaVM8/s1600-h/DSCN2469_1.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/R-HXp6mJI-I/AAAAAAAAAM4/EhZrrtaOvQE/s1600-h/DSCN2473.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/R-HW86mJI9I/AAAAAAAAAMw/zIeoi_38Cpk/s1600-h/DSCN2460.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/03/thinking-about-exhaling.html", "title": "\nThinking about Exhaling\n"},
{"date": "Thursday, May 8, 2008", "body": "\nG. loves to name the letters, but had never tried to put them in order.  Here's his first shot (It starts in the middle, goes right, then left, and then skips back to the far right): And one more sleeping picture, this time with the dog. You can see from these photos that even when your only criterion for choosing a carpet is dirt-hiding capability, you can only do so much.  :)\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/SCNyX-_0IDI/AAAAAAAAANw/wx7qsjGiOWE/s1600-h/DSCN2502.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/SCNyFO_0ICI/AAAAAAAAANo/WpShgJtAOR4/s1600-h/DSCN2490.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/05/alphabetical-order-hoopdeedoo-style.html", "title": "\nAlphabetical order, hoopdeedoo style\n"},
{"date": "Thursday, November 6, 2008", "body": "\nI spent election day with a lump in my stomach.  Living in Houston, Texas, where Obama yard signs were stolen on a regular basis, I just couldn't imagine that the US could elect Obama.  Watching the returns, I felt a bit hopeful, and then after they announced Ohio, my husband started celebrating, and my dad called, but I still didn't believe it. The day after the election I kept getting teary-eyed with happiness.  I feel as if I'm still coasting on the good feelings.  I know he's got a lot of work to do, but I'm just so, so happy.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/11/si-se-puede.html", "title": "\nSi se puede!\n"},
{"date": "Saturday, August 16, 2008", "body": "\n My husband is en route to Iceland, school is about to start, and I'm thinking fondly of our vacation. (apologies to my sister for posting a picture of her eating, but it's just so sweet)\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/SKeXjzckLNI/AAAAAAAAAQA/neyRUQj755U/s1600-h/DSCN2657.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/SKeXXmaytsI/AAAAAAAAAP4/IfSwKXsg-t4/s1600-h/DSCN2655.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/08/vacation-pics.html", "title": "\nVacation Pics\n"},
{"date": "Thursday, November 1, 2007", "body": "\n Here I am, at three am, searching the internet for yet another of G's favorite toys (obsessive love interests, security object). Last time it was the little wooden penguins, another time it was a fire engine which we got at Sonic. We lost G's yellow Fisher Price \"Peek a Block\", with a little dog in it.  I found the set of blocks on the Fisher Price site, but they seem to have been discontinued.  There are tons of peek a blocks on ebay, but none of the simple, primary color ones which G. loves.  He walks around the house saying \"yellow?\"  \"please?\". We left it at the ASA picnic on Saturday, and my husband drove back to look for it, to no avail.   I know he has so many other toys, but there's something about how he looks up at me and signs please that makes me turn to mush. So, if you happen to have a set of these, I'll buy them at a premium price!\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/RymKinwT3JI/AAAAAAAAAHw/YkMdNKnOkCg/s1600-h/41RE51W0VKL._AA280_.jpg"], "link": "http://hoopdeedoo.blogspot.com/2007/11/have-you-seen-these-blocks.html", "title": "\nHave you seen these blocks?\n"},
{"date": "Friday, November 28, 2008", "body": "\n Yesterday we had the best Thanksgiving we've had since we've had kids. We started out at the Houston Zoo, where the big \"first\" was that both twins spent most of the time holding our hands and walking (!)  Also, we all rode the merry-go-round together, with no tantrums, panic-attacks, crying, etc.-- just lots of smiles and sitting up, and only a little chewing on the merry-go-round equipment.  It all felt like a normal, fun family outing, and less like a desperate attempt to have a fun family outing. Next I made a sweet potato casserole.  Making it was fun, but it turned out more like a dessert than a casserole.  Not too healthy unless they discover the life-extending effects of two sticks of butter very soon. Finally we actually went to a Thanksgiving get-together with a bunch of friends from my husband's work.  For the last few years we've had quiet Thanksgivings at home, but this year I was determined to change things up. The only other child there also has autism, and had brought many alphabet-related items, so the living room was filled with boys looking at letters for a good part of the evening.  It was great to see people I hadn't seen in a while, laugh, eat too much and relax.  J. had a nice time with a box of space-shuttle type toys, and also experimented on the piano. I wondered what he thought of the evening, having been the only \"NT\" child there, but as we drove off he announced, \"I had a lot of fun.  Let's go back soon\".\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/STDDzCq1njI/AAAAAAAAAY0/IVSfQkExWHM/s1600-h/IMG_5726.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/11/thanksgiving-of-firsts.html", "title": "\nA Thanksgiving of Firsts\n"},
{"date": "Sunday, November 23, 2008", "body": "\nLast night I spent more than an hour in Barnes and Noble, and did NOT read any books in the Special Needs section! I walked past it and thought to myself, \"No, I'm going to go find something else\".  I ended up with  Learning to Bow: Inside the Heart of Japan , by Bruce S. Feiler.  I've just started it, so I can't say much about it yet. I also went into the music section and listened to various CD's.  It was a nice, relaxing night.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/11/mom-milestone.html", "title": "\nA Mom Milestone\n"},
{"date": "Thursday, January 10, 2008", "body": "\n We started with new ABA therapists last week, six hours per week for each boy.  There's a clinic about fifteen minutes from our house which uses a Verbal Behavior approach, and had been recommended by some parents in our Meet-up Group.  So far, B. ssems to love it, and G. is okay with it.   I was dreading the first few days, because I've seen a pattern where therapists have seemed to be angry with G., because they know he knows a lot, but he won't do anything for them.  It drove me nuts both times, but I tolerated it, because things got better once G. got to know each therapist. At this place, it's completely different.  The therapist is so sympathetic to G.  He tells me, \"No one should be forcing him to do anything.  Right now we'll just play together and earn his trust\".  Of course, this is how everyone should have approached G. I feel so much better about this man.  G. has enough anxiety without pushy therapists trying to force him to perform. I don't even know if I think ABA is right for G., but at this clinic, I think they understand him. I don't know if it has to do with the new clinic, but B. is down-right chatty, by his standards.  He counts to ten, sings \"Tinkle, tinkle, ya, ya, ya\" and murmurs the alphabet under his breath.  It's mostly for his own entertainment, but I'm fine with that. One thing that's a definite improvement in our quality of life: we have zero therapists coming to our house and driving J. nuts with jealousy.  I liked the ECI women, but I don't miss rushing home for thirty minutes of \"developmental services\". Now J. and I have two mornings a week to spend together, and I can see him relaxing and acting happier. PS the picture above is J. wrestling with his cousin.  They played together for four days straight over the holidays.\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/R4azklfyLEI/AAAAAAAAALQ/-8vSocn36fM/s1600-h/DSCN2292.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/01/trying-some-new-things.html", "title": "\nTrying some new things\n"},
{"date": "Tuesday, September 9, 2008", "body": "\n Today we had the little boy from next door over.  B. seemed to be following him around somewhat.  Then, three different times, B. picked up a paper hat that J. had made in Pre-K, and put it on the neighbor boy's head.  He has never, ever done anything like this!  After that he lost interest, but I keep thinking about it. I feel so excited about this and I have to admit, I needed a pick-me-up in that department. Seeing the other kids in the twins' PPCD class, I am realizing how easily this type of thing would come to all those kids.  In that class, the twins seem so, so far behind socially.  But I try to remember how cuddly B. can be with adults, and how he'll look into my eyes and smile. I love him just as he is, but once in a while I get a jolt of reality when I see other kids, even kids with special needs.  Can't think of any wise insight to end this post, but he is always the sweetest boy (along with his brothers) that I can imagine.\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/SMdBGeBU5dI/AAAAAAAAAQY/anZTDkhycC0/s1600-h/IMG_4162.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/09/thoughts-about-b.html", "title": "\nA little about B.\n"},
{"date": "Saturday, September 6, 2008", "body": "\n I haven't been posting much. We've been having uneventful days, which is nice.   J. had a friend over to play this afternoon.  They were acting out the \"tractor-tipping\" scene of the movie Cars (if an NT child can be said to perseverate, then J. definitely perseverates about Cars).  G. was watching the two boys, which is very unusual in itself, and then he started to laugh and laugh.  J. and his friend were running around, moo-ing, falling down, honking and generally doing the four-year-old boy thing.  I was so happy to see G. laughing at them.  He'll laugh at Baby Einstein puppets or Pingu the penguin, but never (before) actual kids.  We've been having other children over a lot lately, and I think I see enjoyment in both the twins' eyes.  It's subtle, but it's real.\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/SMM0k77S7cI/AAAAAAAAAQQ/Dl_OHz61aKE/s1600-h/DSCN2601.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/09/ordinary-life.html", "title": "\nOrdinary Life\n"},
{"date": "Wednesday, September 10, 2008", "body": "\nWe are all packed, and planning to get up at 4 AM and leave.  Hurrican Ike may not be too bad, and isn't aiming straight for Houston, but people are in moderate panic mode.   My sister is visiting from the Boston area, and has a pretty good attitude, considering that she's about to leave town in the wee hours with a family of five and a dog.  The twins will probably love the whole trip, but J. is not happy when his routine is disrupted.  The family we are going to see has a sixth grader, and I'm hoping he'll take J. under his wing. I am going to bed and, I hope, sleep!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/09/evacuating.html", "title": "\nEvacuating\n"},
{"date": "Monday, March 2, 2009", "body": "\nI don't think I've written much about pre-school experience.  We took B. out of the program in December, after he actually regressed and became aggressive.  we left G. in, and he seemed to enjoy it, although his IEP progress reports read \"minimal progress\" in all areas, while he was talking and spelling and such at home. I hate conflict, so I've complained behind the teacher's back, mostly.  My impression of her so far have been summed up by the phrase \"phoning it in\".  I've decided I'm fed up. I emailed last week and asked if she could tell me of some areas in which G. had made progress this year.  I heard nothing back, so I emailed again, asking if she had received the first email.  She wrote back saying she'd been very busy, and she'd send a note home. Today I got a Post-it note, yes, a Post-It note, saying that he is sitting better with the group and attending.  Also he is doing great with his letters. This is a boy who knew all his letters, letter sounds and could put his letters in order before PPCD started in the fall! Ay, yi, yi.  Anyway, she is recommending that he go to the summer school program, and I am recommending that he not go.  I know this is Texas, but is this really the best they can do?\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2009/03/post-it-notes-worth-of-progress-really.html", "title": "\nA Post-It note's worth of progress? Really?\n"},
{"date": "Tuesday, March 3, 2009", "body": "\nTo balance out the disappointing preschool stuff, I should mention that both boys are making unprecedented progress at home and ABA.  Yesterday the ABA therapists said that they'd tried G. on matching words to pictures, and he seemed to get it.  He won't do picture-matching tasks-- we think he just doesn't see the point.  They also started working on writing letters.  When they originally tried to get him to trace letters, he got very upset, I guess because it was messing up a perfectly good letter. But writing his own letter isn't so upsetting, or so we hope! B. is singing up a storm.  He is stuck on the line \"the mommies on the bus go \"shush, shush, shush\", for whatever reason (??), and he also keeps repeating \"I like to eat, eat, eat apples and bananas\".  Either one of those things would have seemed impossible a few months ago.  And with some encouragement, he'll point to the sentence strips I have around the kitchen and mutter, \"Wan nuk (milk), peezh\" or \"Wanna cookie\". That is really, really amazing for me to hear.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2009/03/and-in-other-news.html", "title": "\nAnd in other news...\n"},
{"date": "Wednesday, March 11, 2009", "body": "\nToday I had a migraine, and all I could think (besides thank God for the college student who helps us out in the afternoon) as I lay in bed with my head under a pillow was that I really, really need to get away. My sister is coming to visit next week, which will really help.  But how do you get away when you have twins who aren't potty-trained, will put anything in their mouths, climb the furniture, don't usually respond to their names?  My husband is not used to watching all three of them, or I'd sneak away for a day or two.  I must brain-storm about this, because I think things are getting harder, as far as caring for the twins.  They can say more, they notice more, and they can do more, which includes climbing over safety gates, opening the fridge and, well, I'm sure you know what I'm getting at.  Mommy is getting a little loopy, here! Just to illustrate, here's a picture of the attempt to take a group photo at the twins' birthday party.  Some ASD kids made it into the photo, but neither of the twins! \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/Sbh23y66A3I/AAAAAAAAAZc/7H5WjzamRkU/s1600-h/DSCN3522.JPG"], "link": "http://hoopdeedoo.blogspot.com/2009/03/respite.html", "title": "\nRespite!\n"},
{"date": "Tuesday, September 16, 2008", "body": "\nDespite my cavalier attitude (aka denial), Ike was a real hurricane, as anyone who has a TV knows by now.  Our house is okay, but we haven't returned due to lack of power, and now lack of good drinking water.  Hopefully going home tomorrow.  Everyone I've been in touch with came through okay, with just some damage to their homes.  We are very grateful that our neighbors and friends didn't get hit too hard.  I feel especially bad for those people who are just barely making it financially, and then get hit with this.  Luckily, on the post-Katrina Gulf Coast, aid arrives a lot more quickly than it used to.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/09/after-ike.html", "title": "\nAfter Ike\n"},
{"date": "Monday, July 14, 2008", "body": "\nFrom Saturday til today, G. has - hugged J. spontaneously - pulled J. up from the floor by the hand - taken J. by both hands and done a little \"circle dance\" (twice)  It makes tears come to my eyes just to type this. G. looks very serious in this clip, but I suppose he's way out of his comfort zone! \n \n \n \n \n \n \n ", "outgoing_links": ["rtsp://v7.cache6.googlevideo.com/ChoLENy73wIaEQnJsgV6G1eUnBMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://hoopdeedoo.blogspot.com/2008/07/time-for-happy-dance.html", "title": "\nTime for the Happy Dance!\n"},
{"date": "Friday, September 12, 2008", "body": "\nWe had a dream of an evacuation--no traffic, beautiful weather, cactus and cattle-spotting for J.   Now we are safely ensconsed in the town of Dripping Springs, TX, outside of Austin.  Deer wander through the backyard, hummingbirds buzz around the feeder, and \"Mom to JBG\" is more relaxed than I have been in months.  G. is showing signs of home-sickness for the first time, but it comes and goes.  The other two boys are in heaven. This would all be a great vacation if I weren't worried about the people whose homes are right on the coast, and people who may not be able to evacuate.  The storm is only a category 2, but for some reason it is causing a record-breaking storm surge. Our house was in a mandatory evacuation zone, but i don't expect it to flood.   Back to my mini-break, as Bridget Jones would say.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/09/mini-vacation.html", "title": "\nMini-vacation\n"},
{"date": "Thursday, July 31, 2008", "body": "\nWe are back, and it all went well.  There is one Hertz mini-van that will never be quite the same, and one seat on a 737 (D30, to be exact) which had to be \"swapped out\", but the whole family is thriving. J. got to catch fireflies, the twins swam in freezing cold NY water, everyone rode on the Bear Mountain carousel and a good time was had by all. My father-in-law was briefly back in the hospital, but is now in the nursing home and hoping to go home in a week or so.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/07/mission-accomplished.html", "title": "\nMission Accomplished\n"},
{"date": "Sunday, September 21, 2008", "body": "\n We're back in Houston, but things are not quite back to normal.  Some things actually feel like an improvement.  Everyone's fences are down, and neighbors wander from yard to yard, talking and helping each other out.  Half of our neighborhood still doesn't have power, so we swap laundry, baby-sitting and chances to sit in an air-conditioned house.   The Little Gym near us opened up for free open-play sessions, so the twins finally got to experience gymnastics.  We went two days in a row, which really helped out.  School is out for another week, due to power outages and flooding.   The grocery store smells really, really bad (a little like our mini-van on occasion...think sour milk mixed with a couple of mystery smells).  It is gradually getting re-stocked, and is very uncrowded.  B. and I had a nice shopping trip today.  B. is a real pleasure to shop with.  He sits in the cart with a huge grin on his face. We all feel so lucky that for us Ike has mostly been a long series of inconveniences. And a lot of really great moments, as guilty as I feel to admit it. Here's one of the nice moments-- G. was trying his first ice cream cone: \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/SNbA42qQQnI/AAAAAAAAAQg/SpHIx23aUVY/s1600-h/DSCN2963.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/SNbBTjyskqI/AAAAAAAAAQo/zVhKWgiXYOQ/s1600-h/DSCN2794.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/09/putting-things-back-together.html", "title": "\nPutting things back together\n"},
{"date": "Wednesday, September 17, 2008", "body": "\nWell, we are still here in Dripping Springs, and that vacation feeling has pretty much evaporated.  Our power is still not on at home, and while Houston's water has been declared drinkable, our town's water is not.   On the upside: Away from home, the twins are slightly more adventurous eaters: B. has eaten an apple and a banana, and chewed then spit out some PB and J.   what, what, what??! My husband just walked in and said a neighbor called to say our power is on.  Hooray...I must go pack!   The family we are staying with are definitely getting a giant karma boost for everything they've done the past week. If for any reason Austin someday has to evacuate, and Houston is a safe haven, they will always have a place to go.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/09/no-longer-vacation.html", "title": "\nNo longer a vacation\n"},
{"date": "Thursday, October 16, 2008", "body": "\nFor whatever reason, increased focus on the potty has meant decreased blog-reading and blogging for me. B. continues to surprise me with his toileting successes, although I still have to be happy with peeing/pooping in the general potty vicinity.  In the morning when he's still dazed, things go where they're supposed to, but once he's awake, it's literally hit-or-miss. Yesterday was the four-year anniversary of J. joining our family!  We took him out to one of those hibachi-table Japanese restaurants.  We'd been there with friends, and thought J. would enjoy the silly patter and the showmanship of the chef.  Unfortunately, we ended up with the first  scary/cranky/clumsy hibachi chef we've ever met.  I think he was trying hard, but he kept addressing J. in a gruff voice as \"Boy\", and J. looked a little nervous most of the time.  He still enjoyed it, probably because he rarely gets to go out with just the two of us.  He kept saying \"Let's talk about Barack Obama and John McCain!\" and \"Let's talk about the debate!\"  I think it was part of the fun of being out with the grown-ups.  It was hard to keep a conversation about the debate going for long, but he tried.   The first picture we ever saw of J. (at three months old) J. last month in Austin (we are so lucky to have this sweetie in our lives!):  \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/SPdrrfEuH3I/AAAAAAAAARY/sQQP9KpZ8Fw/s1600-h/Joey2.jpg", "http://4.bp.blogspot.com/_ccuTsPgAAcc/SPds0Bi-i-I/AAAAAAAAARg/SD9cb-ad_HM/s1600-h/DSCN2833.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/10/message-from-land-of-potty.html", "title": "\nAdoption Celebration\n"},
{"date": "Saturday, October 4, 2008", "body": "\nI don't want to jinx this, but I'm getting more serious about potty training, starting with B. I put a portable DVD player on the edge of the bathtub, and let B. sit on the potty watching it.  Yesterday he peed twice, and today even had a poop!  I have to admit, only one of these events actually ended up going into the potty. But it was all very, very close to the toilet, and I'm seeing that as a big step in the right direction. Unfortunately, due to the nature of life at our house, I end up leaving him alone sometimes, and when I return, things are not always good.  I'll spare you the details, but I will say that the DVD player may not smell as nice as it once did. I'm trying to tell myself that even if this is one of those blips of progress that disappears again for months, it means that someday this really will happen.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/10/potty-training.html", "title": "\nPotty Training\n"},
{"date": "Saturday, October 25, 2008", "body": "\n Lately we've been listening to CD's from the \"Bounce\" Collection ( Spectrum Connections ).  The songs invariably get stuck in my head, which I guess is the point, because yesterday G. looked at me and said, \"Give me a cookie\".  That's a direct quote from a Bounce song, and he said it just after I had said, \"No more cookies.  You just brushed your teeth.\"  I almost fainted when he said a sentence, and you better believe he got a cookie!\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/SQOR1Cm-XeI/AAAAAAAAAYs/pr6RIsDYkHY/s1600-h/DSCN3118.JPG", "http://www.spectrumconnections.com"], "link": "http://hoopdeedoo.blogspot.com/2008/10/give-me-cookie.html", "title": "\n\"Give Me a Cookie\"\n"},
{"date": "Tuesday, August 19, 2008", "body": "\nI usually save my product testimonials for Signing Time, but today I have two other companies I need to thank: Essential Whites (makers of size 4T onesies) and  CARES airplane harnesses The first company has helped my guys make it through the night in a diaper and also helps G. keeps his hands out of his pants, all day long. Sorry to be so blunt, but it was really getting to be a problem.   The second company has helped us on our flights to New York.  We are officially growing out of them at this point, but they worked great while it lasted. I may add some cute pictures at a later time!\n \n ", "outgoing_links": ["http://www.essentialwhites.com", "http://www.kidsflysafe.com"], "link": "http://hoopdeedoo.blogspot.com/2008/08/companies-that-have-saved-my-tushy.html", "title": "\nCompanies that have saved my tushy\n"},
{"date": "Thursday, June 12, 2008", "body": "\nI just wanted to clarify that in the picture below, B. is standing on his head and resting his foot on the chair.  It might look as if he's falling onto his head, and I don't want you to think I'd post a picture of that! Both he and G. have been seeking deep pressure to their heads lately.  B. comes up with inventive ways to do it himself.  G. comes up to me and rubs his head and whimpers, and then I give him some head rubs and he's happy. Also, B said his first original (almost, it was prompted) two word phrase: \"want cookie\"!! And yesterday in Toys R Us he sang the entire Wonder Pets theme!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/06/about-that-last-picture.html", "title": "\nAbout that last picture...\n"},
{"date": "Wednesday, September 24, 2008", "body": "\nI keep saying I'm going to start a catalog for families of kids with autism.  My catalog won't have any items to help you cure your child.  The focus will be on getting your family through those tough days (and nights) My ideas so far: Self-Cleaning Mini-Van: Using a dishwasher style mechanism, this van will fill with hot water and detergent at 1:00 every night, swish around for twenty minutes, then drain and dry itself Mini-Van Febreze Mist: Every time you lock the doors of your mini-van, a fine mist of Febreze is dispensed from the ceiling. One-piece pajamas, available in any size (if you don't know why you would need these, thank your lucky stars) Vitamin fortified Play-Doh, crayons and watercolor paints (for the extremely picky eater who for whatever reason loves to devour art supplies) \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/SNq5JGlh5qI/AAAAAAAAAQw/HzUXbcnVWw8/s1600-h/DSCN1321.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/09/catalog-that-will-make-me-rich-part-i.html", "title": "\nThe Catalog that will make me rich, Part I\n"},
{"date": "Thursday, August 28, 2008", "body": "\n This week the twins started PPCD on Mondays, Wednesdays and Fridays. Tuesdays and Thursdays are still ABA. The teacher hasn't responded to my email or phone call asking how it's going...I think she's a little overwhelmed.  She's very competent-seeming and warm in person. So all we have to go on are the two words B. kept saying after his first day...\"Careful!!\" and \"Shick!\"  We understand \"careful\" (B. is quite the climber and acrobat), but we are wondering about shick.  We think there might be another final consonant sound. The paraprofessional looked as if she might cry after escorting  the two of them to the front of the school where I pick them up. They are very good at flopping to the floor and staying completely limp when you try to coax them.  By Wednesday the school had decided I should park in a handicapped spot and come get the boys at their classroom. I had had visions of PPCD finally teaching them to walk well from place to place, but so far they actually walk better for me than for the teacher or aide.  It's just the first week, so I still have high hopes for the walking thing.  I'm glad we are still doing ABA, so I mostly think of PPCD as a chance to be in a group of other kids.  The other kids are so sweet, and for the most part pretty social, which I'm thrilled about. The special ed director wanted to bus them to another school with a smaller class, but I'm hoping this one will work out.  I do think they need another aide.  Right now it's seven children with one teacher and one aide (possibly the source of our new word, \"shick\"). I'm in constant communication with the special ed. director due to my stubborn-ness about keeping them in ABA.  And to think that in some states the school districts actually provides ABA!  It's as if we were in another decade from the east coast.  I send all my communications in bulleted-lists, trying to make the impression that I'm a parent who has a lawyer on retainer. At the same time I try to be diplomatic, because I might actually want to teach in this district again.  I'm being paged by J. to lie down and help him sleep.  Tomorrow is his Pre-K meet=the-teacher day, and he's got a bit of the jitters. Hopeing PPCD will turn out to be helpful.  But why hasn't the teacher returned my email or phone call.  Tomorrow I am dropping them off at the classroom door, and I'm going to ask her to call me. Now I'm off to snuggle with J.\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/SLdcjcQBMWI/AAAAAAAAAQI/TLnBEdzJxME/s1600-h/IMG_4142.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/08/school-days.html", "title": "\nSchool Days\n"},
{"date": "Saturday, September 27, 2008", "body": "\n\"Disaster Fatigue\" was a headline in the Austin paper while we were still there.  People around here definitely have it. The biggest problem for me right now is that every big intersection is a four-way stop (all the traffic lights were blown down).  Very gradually, the lights are being fixed, but after days of making our way tentatively through four-way stop after four-way stop, Houston drivers are confused, and I think every one of us has stopped at a green light, or driven ahead at a red light.  They even mentioned the phenomenon on the news. I feel as if I could find some analogy for life with autism in this, if I had had more sleep.  Or maybe not! If traffic lights are the biggest problem, things must be improving.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/09/disaster-fatigue.html", "title": "\nDisaster Fatigue\n"},
{"date": "Thursday, June 19, 2008", "body": "\n Last Saturday we attended a party for a friend's son. He is also on the spectrum, although more mildly affected than our guys.  He has just started talking, and it was great to hear him spouting out words all afternoon. I'd say our family livened up the party: the only two instances of nudity were thanks to us (and one of those was J)  Once he was dressed again, G. spent most of the time with the Leapfrog letters which were on the fridge (and the floor eventually). For the first time I can remember, B. recognized a cake, and let us know he wanted some by saying \"cake\" very clearly.  He also ate with a spoon (!) until my back was turned at which point he attacked a piece with his hands. This is me trying to contain him as the cake is cut: J. did a great job the whole time. The next day (Father's Day), J. and his dad bonded over Lego for hours. They built a Mars rover together, and played with it endlessly, like two peas in a pod. \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/SFq7iS-B5BI/AAAAAAAAAPI/p9YRZw-eFVU/s1600-h/DSCN2618.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/SFq8psqgJbI/AAAAAAAAAPQ/Ku5u6k6WgVI/s1600-h/DSCN2616.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/SFsg5JlUbjI/AAAAAAAAAPY/NLas2GAx83w/s1600-h/DSCN2620.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/06/birthday-party-fun.html", "title": "\nOn the town\n"},
{"date": "Monday, June 9, 2008", "body": "\n A few posts ago I mentioned the feeling that we were flunking out of ABA.  Despite the stated plan to work only on eye contact and pointing, we are still chugging along and making some progress.    At home, G. is always saying new phrases, and  B. is babbling and singing all day long.  J. is interested in Kung Fu Panda (a movie I hope he doesn't see for a few years!)  He can't remember the name and calls it various things.  My favorite was \"Punch Fruit Panda\". J. is also interested in Knock Knock jokes.  He can successfully tell the \"Dwayne the bathtub I'm drowning\" one, but his other favorite is Knock Knock Who's there? Knock Knock Who's there? Repeated numerous times, and finally ending with Knock knock Who's there? Orange you glad I didn't say banana? \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/SE4ApnSRnHI/AAAAAAAAAPA/mfM1fHUTBls/s1600-h/DSCN2566.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/SE4AadGmGRI/AAAAAAAAAO4/KJll9aFEuoM/s1600-h/DSCN2532.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/06/usual-fun.html", "title": "\nSummertime\n"},
{"date": "Tuesday, May 27, 2008", "body": "\n Two days to go...I'm almost ready to leave for my \"Broads' Retreat\" on Block Island.  I am so nervous about leaving the boys, but so, so, so ready to see my old friends and have \"girl time\".  we haven't gone away since the year before we adopted J., so we are very overdue. My sister is here, learning the ropes.  (Thank you a million times, Sis).  My little Sister will actually be on the retreat. We are in the grip of a serious alphabet obsession, so I leave you with one of my favorite phonics videos from the PBS show \"Between the Lions\". It takes me back to the music of my college years. Sloppy Pop \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/SDx7oaIt4BI/AAAAAAAAAOY/r62AZAKvpMQ/s1600-h/DSCN0156.JPG", "http://www.youtube.com/watch?v=bgJpcvDTEfw"], "link": "http://hoopdeedoo.blogspot.com/2008/05/two-days-til-big-trip.html", "title": "\nTwo Days til the Big Trip\n"},
{"date": "Thursday, February 26, 2009", "body": "\nI don't know why I seem to have abandoned this blog!  There just doesn't seem to be time. All the boys are doing well.  B. can answer the question \"What is your name?\", provided the asker is holding an Oreo cookie, or something equally appealing.  Most of the time he says, \"What is your name...B.\", but it is so cute, who could quibble? J. is five!  He is a pleasure to converse with these days, and seems to have hit the \"why\" stage a few years later than some other kids. Really complicated why questions, that have me stammering and trying to explain the concept of re-incarnation or gravity or some such thing. G. is interested in the movie Cars.  He comes up to me and says, \"Do you want Cars?...Yes, yes\", with lots of head-nodding.  This is big progress for him.  We had finally gotten J. out of his Cars obsession, and here we are again.   I am making a disorganized attempt at potty-training both twins.  That may be the real reason for my absence from the blogosphere.  I am going on blind faith that some day, some how, the twins will actually use the potty as it is intended to be used.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2009/02/checking-in.html", "title": "\nChecking In\n"},
{"date": "Friday, January 18, 2008", "body": "\n On our flight up to Newark, we had the most frightening flying experience I've ever had (for the record, I'm not scared of flying.  I can't stand it when people say \"it's so much safer than driving\" because I have an actual phobia of driving fast) We had had a great flight, and were making the descent into Newark when the plane pulled up sharply, and continued flying.  The pilot made an announcement that the instruments indicated that the nose gear was not coming down.  He said something vague about having someone check it out. I immediately got a very bad feeling in my stomach.  I looked at my husband, and he said, \"Oh, we can land without nose gear!  We'll just have to get out the emergency exit fast\".  My husband has always taken a sunnier view of things (he is still certain the twins will grow out of their autism), but I can't say I was convinced. The plane started making a grinding sort of noise, which my husband guessed was the pilot trying to \"shake the landing gear down\". That's when I decided he probably wasn't lying to me to calm me down, or else he was doing a bad job at it.  I buckled the twins into their harnesses, but my hands were shaking, and a neighbor across the aisle had to help me.  After a while, maybe ten minutes, of me thinking some pretty grim thoughts, the pilot announced that everything was okay.  I was still nervous until we got down, and the actual landing was pretty bumpy.  As we looked around, we saw fire engines and ambulances standing by.  This seemed dramatic to me, but as my sister says, \"If they haven't sprayed foam on the runway, they aren't expecting the worst\". I'd like to think I gained some wisdom and perspective in those shaky moments, but the most I've taken from it is a desire to appreciate every moment, stop worrying so much about the future, and stop worrying so much what other people think.  All cliches I suppose, but cliches because they are all things worth doing. And above all, look at my boys every day and be simply happy. \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/R5FjoFfyLFI/AAAAAAAAALY/Xilf2E3rhCk/s1600-h/DSCN2198.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/R5Fq11fyLII/AAAAAAAAALw/91w2de2t98Q/s1600-h/DSCN2144.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/01/bumpy-landing.html", "title": "\nBumpy Landing\n"},
{"date": "Tuesday, January 29, 2008", "body": "\n B. discovered his medium yesterday...he likes to work in watercolors.  Over the past couple years I've tried getting him to paint every once in a while, to no avail.  But yesterday he loved it. He also said \"paint\" and, I think, \"painting\" several times.  And when I tried to put things away as it started to rain, he said a very clear \"NO!\" I'm hoping the paints really are truly non-toxic, because most of the time he had one brush in his mouth, and he drank part of a cup of the painting water.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/R5_rRcLXZiI/AAAAAAAAAMI/-XDWcdZ3HAw/s1600-h/DSCN2379.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/R5_q58LXZhI/AAAAAAAAAMA/yrWAPDbMrDE/s1600-h/DSCN2378.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/01/artist-among-us.html", "title": "\nAn Artist among Us\n"},
{"date": "Wednesday, January 23, 2008", "body": "\nAbout a year ago, B. was in a stage when he would complete the lines of some familiar songs...\"Old McDonald had a ...\", and a few others.  I used to love hearing his voice sing those words.  I didn't like to push it too much, but it was so nice to hear the sound of his voice.  He doesn't fill in words as much as he used to, only once in a blue moon. Every night lately, the boys have been listening to songs from Winnie the Pooh movies, sung by Carly Simon, as they fall asleep. Usually we play it several times before they actually go to sleep.  This morning, B. was upset about something, and I started singing Winnie the Pooh to him.  A few minutes later I recognized him singing \"Winnie the Pooh, Winnie the Pooh\" a few times.  It sounded like \"Weee ah pooh\". And this afternoon he sang some syllables that sounded like \"tubby little cubby\".  This was all very faint and garbled, but so wonderful to hear.   When I hear him singing a string of words, it makes me wonder what it will be like to hear him speak in phrases or sentences.  I believe it will happen, in its own time.  Meanwhile I enjoy the singing and babbling and whatever else he has to say.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/01/tubby-little-cubby-all-stuffed-with.html", "title": "\nTubby little cubby all stuffed with fluff\n"},
{"date": "Tuesday, February 5, 2008", "body": "\n The last few weeks I've been having trouble sleeping, feeling uneasy without a real reason, knowing something was bothering me. Last Thursday, as I walked the dog through the dark neighborhood, i admitted what was wrong.  i didn't feel right about sending the twins to preschool.  It came down to the ratio--one teacher and one aide to work with seven boys with autism.  I like the teacher, I liked the IEP goals, but I don't think those numbers make sense.  Therapists who work with my boys individually sometimes seem \"challenged\"! Once I knew what was wrong, I knew what I had to do.  It was embarrassing calling on a Friday to say that the twins wouldn't be starting on Monday, but who cares?  If I learned anything from all these evaluations, and therapies, it's that my gut instincts are usually right. We are going to get a few more ABA hours each week and hopefully a second OT session, but mostly things will stay the same. I get to be with my sweet boys, and I'm going to enjoy every minute of it.   \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/R6kj9sLXZjI/AAAAAAAAAMQ/3148Pnnf8-8/s1600-h/DSCN2376.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/R6kkdMLXZkI/AAAAAAAAAMY/2HTIV3wF2AQ/s1600-h/DSCN2170.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/02/keeping-my-boys-at-home-little-longer.html", "title": "\nKeeping my Boys at Home a little longer\n"},
{"date": "Wednesday, April 2, 2008", "body": "\n I feel superstitious about blogging this...is it real?   B. is having a mini language explosion.  He is using words to ask for things, usually repeating what he has just heard, but also saying things spontaneously, some of the time. In the past he has sporadically come out with surprising things (\"kite!\", \"clothes\", \"boy\" and so on). This is much more consistent, and he is saying the words to us, rather than to himself. He's excited about his new powers, and wants to be able to do more.  He'll come up to me and \"talk\" in a perfect imitation of the dog from Blue's Clues.  I talk back to him the same way, and we have happy little exchanges with all the intonation of English, but no actual words. Sending out a big thank you to the universe!\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/R_Q5b6mJJCI/AAAAAAAAANY/CVv-RCKQByY/s1600-h/DSCN2478_1.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/04/knock-on-wood.html", "title": "\nKnock on Wood\n"},
{"date": "Thursday, June 5, 2008", "body": "\n The trip to Rhode Island went well.  All my worries were for naught, although there was one phone call home when my husband sounded like he might either cry or fall asleep at any second.  Block Island was beautiful, my friends were as funny and relaxing as always, and I hope we will do it all again next year.  It was the strangest feeling to be able to sit around, with a glass of wine in my hand and just chat.   B. actually expressed the most emotion about my being home.  He sat in my lap and gave me a long list of his grievances, or that's what it sounded like he was doing.  Several times the first evening I was home, he started to cry and wasn't happy unless I held him.  All three boys looked taller than I remembered them, and J. seemed to have matured in the five days I was gone. It was good for me to find out that the family can survive without me for five and a half days.  And it is very, very, very good to be home! The \"chicas con sombreros\", exhausted but happy, waiting for our ferry: \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/SEhmk1dUUfI/AAAAAAAAAOg/44N7E2-Gs0M/s1600-h/DSCN2573.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/SEhnRmYWx5I/AAAAAAAAAOo/ioIAeEY-9RE/s1600-h/DSCN2577.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/06/reunited.html", "title": "\nBack at home\n"},
{"date": "Friday, February 22, 2008", "body": "\n Haven't been posting because I've been interacting with live people (grown-ups, specifically) more than usual.  Can't seem to fit both the blogosphere and real-live adults into my life at the same time! I'm feeling very good about keeping the twins home.  They are still doing ABA and OT.  G. is taking off with language, and is seriously obsessed with letters, numbers and colors.   B. has been saying some new words (\"cook\" is one of them, which makes no sense in this household, unless he's suggesting that I try it sometime)  Also \"ice cream\", a word everyone should learn as early as possible. Today I was trying to get him to say \"baby\" to request a Baby Einstein DVD, and he said \"Signing Time\".  That one knocked my socks off. J.  is very, very interested in Spiderman, although he still secretly likes Disney princesses. He is trying to write his name, which is fun. He is also determined to get the twins to play with him.  He can get them to laugh, by lying on them and putting his face right up to theirs.\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/R79dsBbXnxI/AAAAAAAAAMg/uBe44QJ2-k4/s1600-h/DSCN2362.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/02/moving-right-along.html", "title": "\nMoving right along\n"},
{"date": "Tuesday, December 18, 2007", "body": "\n Had the IEP meetings today, met the teacher, saw the classroom.  I was pleasantly surprised by what i saw. It was strange because I kept running into people I knew from my teaching days, and having to explain what I was doing there. I emphasized in the meeting that the twins have some risky behaviors (running off, climbing anything, etc.)  I'm trying to lay the groundwork for asking for another paraprofessional in the future (hope they don't find this blog!) Somehow we ended up spending an inordinate amount of time talking about the possiblity of G. sticking things up his nose (!)  Apparently during the evaluation, they tried to get him to play a drum, and he stuck the drumstick up his nose.  This hasn't been much of a problem at home, so when they kept mentioning it and making sure it was noted in the IEP, I got the giggles.  I'm sure it was nerves... I had thought I might start crying, but instead I guess I went the other way. The IEP goals they set for them looked very ambitious to me.  If they achieve them, I'll be thrilled.   Recently realized that I could be subscribing to blogs.  This would be so much more efficient than what I currently do, which is check all my favorite blogs every day.  I have to look into this when I get back into town.  Which reminds me that I should be downstairs doing the final packing.  J. will be carrying his own things.  I bought him a chapstick, a little pack of kleenex and a lot of snacks.  He can't get enough of his chapstick...he applies it to various parts of himself that he says have dry skin. I didn't explain it well enough before I handed it to him. Wonderful holidays to anyone who happens by here!\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/R2iTj1fyK9I/AAAAAAAAAKY/MRii5miZL-4/s1600-h/DSCN2175.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/12/on-road-to-preschool.html", "title": "\nOn the road to Preschool\n"},
{"date": "Tuesday, December 4, 2007", "body": "\n Updates from the past week or so: The twins had their school district evaluations.  B's was either depressing or funny, depending on my mood as I look back on it.  There were 5 well-intentioned women, coming at him at all different angles, trying to do a cognitive, speech and motor assessment concurrently.  I think one woman was an intern... she kept chasing B. around the room with some little blocks, saying \"Can you give me a block?\" B.  ended up very giggly and wild, jumping around and singing \"Mail!\" (his latest obsession, by way of Blue's Clues).  He basically did nothing for them.  I heard one woman say to another \"Have you seen him gaze at an object for five seconds?\" Now, B. might not be much at the usual academic tasks, but he definitely has extended gazing down, when he's not completely over-stimulated.   At the end, just to show them a little of what he is capable of in calmer settings, I did the manual alphabet, and he said the letters up to \"g\", when he started skipping around and then said \"sing with me...Yay!\"  They seemed to think this was miraculous, which I guess it would seem to be if you've watched someone jump around a room for 90 minutes singing the word \"Mail\". Wow, didn't know I had that in me.  Guess it's still bothering me.  Anyway, I called the diagnostician and suggested that they have fewer people in the room when testing G.  They listened, and G. actually was able to concentrate fairly well.  He still did what he wanted to do, when he wanted to do it (including a very lengthy rendition of Old McDonald in a kind of Darth Vader voice), but he did do some of what they were looking for.  On the junk food front, B learned to say \"fry\", as in french fry.  J. is completely caught up in the Christmas excitement this year.  Almost nightly, we drive to a neighbor's house and sit in front of their yard with the windows rolled down, listening to a cycle of three Christmas carols, in time with which a multitude of lights flash on and off. J. tries to sing along, which sounds great except for one which he thinks is \"Pop Goes the Weasel\". I think  it's really \"On Christmas Day in the Morning\". He is also very interested in taking pictures. Some of his efforts are below: \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/R1XgrMjjKwI/AAAAAAAAAJ4/KCMElNALG88/s1600-h/DSCN2084.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/R1XeasjjKtI/AAAAAAAAAJg/3URynU0IIso/s1600-h/DSCN2099.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/R1XfCcjjKuI/AAAAAAAAAJo/_2KT1wmuuDM/s1600-h/DSCN2119.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/R1XfrMjjKvI/AAAAAAAAAJw/dCTBHAK10LM/s1600-h/DSCN2129.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/12/evaluate-this.html", "title": "\nEvaluate this!\n"},
{"date": "Monday, December 10, 2007", "body": "\nOnce again, we are undertaking the probably-foolhardy task of flying to New York to visit both our families.  As anyone who reads this blog much knows, I am a big baby about being far from family and old friends.  I'd be willing to go through a lot of travel angst to get there. And that's a good thing, because there will indeed be angst. Last year it all went surprisingly smoothly.  The hardest part was getting through security with three two-year-olds.  We had to let them X-ray the strollers, so there was a scary moment when all three boys were \"loose\", and we were scrambling to hold onto them while getting everything through the X ray machines.  Biggest lesson learned: take off all their shoes and stow them away, long before you actually hit security.  I am going to try to have everything as stream-lined as possible...no one wearing shoes, no change or keys in the grown-ups' pockets, and anything else I can think of.   Last year I got an adrenaline rush out of schlepping everything through the airports...this is embarrassing, but I imagined it was the reality show the Amazing Race, and it really helped my attitude. The Amazing Race with two-year-olds would be entertaining, but not ethical to produce, I suppose. This year we'll have two two-year-olds and a three-year-old on the way North, and three three=year-olds on the way home. I can feel the adrenaline kicking in already. \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/R14CCsjjKxI/AAAAAAAAAKA/aATxVdkycq4/s1600-h/DSCN1418.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/12/countdown.html", "title": "\nThe Countdown\n"},
{"date": "Monday, December 17, 2007", "body": "\n Tomorrow I have the twins' first IEP meetings.  I've decided I will send them to PPCD after all, although only 3 or 4 days a week, if possible.    I'm going back and forth about how much information to bring with me (sensory suggestions, words they can say, what we've been doing at home that worked, etc.)  IEP meetings are rushed as it is.  I do want them to know that I have my masters in Special Ed., and I've got definite opinions about what the twins need. After the meetings, it will be full-steam ahead with travel preparations.  I can't remember how we got from Newark baggage claim, on and off the little train, and to the rental car office last year.  We'll have two suitcases, two car seats, carry-on bags and two strollers and everyone's coats.  My husband wants to have J. walking, but I think we should have his stroller just in case.  A major advantage of strollers is that you can hang things off of them. While making a list of the words B can say, I realized he has about 30 words that he uses now. It was nice to see this on paper, because he speaks so rarely, I don't notice how many new thing's he's saying.   Yesterday was my husband's birthday.  G. sang \"(about 10 unrecognizable syllables)...birthday oo you\"  It was the best of all possible birthday presents! The photos are from a trip to the Adirondacks with J. two years ago.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/R2b7L1fyK7I/AAAAAAAAAKI/yla-dZvOhBU/s1600-h/IMG_3112.jpg", "http://2.bp.blogspot.com/_ccuTsPgAAcc/R2b8Q1fyK8I/AAAAAAAAAKQ/zKGIniq3pOc/s1600-h/IMG_3097.jpg"], "link": "http://hoopdeedoo.blogspot.com/2007/12/busy-days.html", "title": "\nBusy Days\n"},
{"date": "Sunday, December 30, 2007", "body": "\n It was a wonderful trip in every way.  I miss all of our family so much, and coming home has made me realize that I am trying to do too much with too little support.  Having family around was so helpful, emotionally and just in the simple fact of having others to talk to and play with the boys.   All three boys loved the snow.  J. couldn't get enough of sledding, building snowmen (the snow was all wrong, so the snowmen were very short, but he didn't mind...they had miniature carrots for noses, which looked about right). We found out that B. is obsessed with lamps and fireplace screens.   Our house is so child-proofed that he can't get into much.  Being at relatives' houses was an eye-opener.  Both G. and B. were cuddly with family members, which was a nice new development. Not back to speed with computer use, but hope to find time soon!\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/R3hb61fyLAI/AAAAAAAAAKw/UFzTR7GIPnY/s1600-h/DSCN2331.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/R3ha4lfyK_I/AAAAAAAAAKo/yaMiuUK7FZI/s1600-h/DSCN2352.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/R3hapFfyK-I/AAAAAAAAAKg/LAEa8MEucPQ/s1600-h/DSCN2328.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/12/home-from-great-white-north.html", "title": "\nHome from the Great White North\n"},
{"date": "Friday, November 2, 2007", "body": "\n Regarding the last post, we seem to be doing well without the beloved yellow block.  Red is the new favorite, and a plastic spoon (??) is running a close second. Ah, the simple pleasures of life.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/RyvubXwT3LI/AAAAAAAAAIA/GSWbrU2dKSY/s1600-h/DSCN1980.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/11/yellow-block-withdrawal.html", "title": "\nYellow Block withdrawal\n"},
{"date": "Sunday, November 4, 2007", "body": "\nG. struggled out of several costumes, so we just told people he was a duck farmer. The twins really are very happy kids, but won't smile in front of a camera. \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/Ry5FWXwT3OI/AAAAAAAAAIY/e4HyopJUknQ/s1600-h/DSCN2029.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/Ry5E9HwT3NI/AAAAAAAAAIQ/XLhpTXFT38o/s1600-h/DSCN2027.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/Ry5EpnwT3MI/AAAAAAAAAII/JCwsoo871HQ/s1600-h/DSCN2033.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/11/two-tiggers-and-duck-farmer.html", "title": "\nTwo Tiggers and a Duck Farmer\n"},
{"date": "Saturday, November 17, 2007", "body": "\nMy last post mentioned that my parents moved down here for six months when the twins were born.  Thought I'd post some photos from that time: during a colicky period, only a hair dryer and a front-pack would keep the twins happy! My mom helping J. take some of his first steps\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/Rz-7vQljF1I/AAAAAAAAAIg/oiixS_uX2ac/s1600-h/DSCN0639.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/Rz-8qQljF2I/AAAAAAAAAIo/y-Pe9owMVJ4/s1600-h/IMG_2514.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/11/mimi-and-granddaddy.html", "title": "\nMimi and Granddaddy\n"},
{"date": "Sunday, January 20, 2008", "body": "\n I'm making a concerted effort to get out more with the boys.  Last night we went to our neighbors' housewarming, and after some initial ear-plugging and wailing, all the boys had a good time. Our neighbor's youngest daughter has developmental delays, and is exactly the twins' age.  They are also big \"Signing Time\" fans, and it was nice to have some other signers around.   This evening I brought J and G. to a church-related pot-luck.  B. was asleep when I left, so he stayed and watched an important football game with Dad. I had to force myself to go, and the group is not quite what I'm looking for, but I'm glad I went for the boys' sake. Ideally I'll find a group that I like for my own sake and that's also good for them  So far the autism groups I belong to come closest, but they don't get together often. I want a place where I can really be myself (goofy, combined with sarcasm and liberal views)  But, I digress. G. preferred staying downstairs with the grown-ups for most of the party, which was fine.  He counted things, played with toys (!) and generally had a good time exploring.  At dinner, he sat at the kids' table with no protest, and I wished I had my camera--he looked so mature. And next time he may even eat something more than a frozen waffle. And now for my favorite moment: All of us adults were lingering over dessert when G. climbed into a chair across from me and sat down.  He looked at a lit candle for a little while, and announced \"Birthday!\" I'm so happy about this, I can't describe it.  I don't know exactly what it is, but I feel like he's moving to a new kind of thinking--making connections between things and events. It's so exciting to watch.\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/R5QfpFfyLJI/AAAAAAAAAL4/uUCAIWq4eYk/s1600-h/DSCN2260.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/01/reason-to-party.html", "title": "\nReason to party\n"},
{"date": "Tuesday, November 13, 2007", "body": "\nMy posts have been tending toward a Wordless Wednesday, Everyday kind of style.  My parents were visiting for the last week, and I chose staying up talking to them over blogging.  They lived here for six months after the twins were born, and I've missed our late night talks, attempts at the New York Times crossword puzzle, exploration of Texas ice creams and just the chance to hang out with them. It was interesting to see that they both really connected with B.  I think it was really good for them to have him come up and put his head in one of their laps, or touch their cheeks.  I know my dad loved it when B. took him by the hand and led him places.  G. tried to ignore them for the most part, and stuck to acting out scenes from videos using wooden alphabet puzzle pieces (this is new, and interesting to watch, but distracts him from actual live people). This morning while waiting for the cab to the airport, my dad picked up a toy guitar and started strumming.  B. stood and stared at him, and then started hopping around and making elaborate arm movements.  My dad loved it, and kept up the strumming til B. finally wandered off to other things. Last night was a dramatic end to their visit when my doctor told me to take G. to the ER, due to shallow, rapid breathing.  Right before I left home, we managed to get a good dose of Tylenol in him.  By the time we saw the triage nurse, he had made almost a full recovery.  He ended up running around the waiting room, yelling his version of the Bob the Builder theme (\"bah bah buh buh, uh ee ill ih\" and so on). I finally took him home without having him seen.  I did learn that a fever can cause rapid breathing, and that you can buy Tylenol suppositories, so it wasn't a complete waste of time. Our other excitement this past week was a trip to the audiologist in the Medical Center.  B. passed his hearing test, and G. failed his.  The technician had given G. some stickers which he got all stuck to each other.  I think a freight train could have gone through the room and he wouldn't have flinched, he was so intent on unsticking the stickers.  He did respond to voices, but that wasn't enough to pass the test.  Now we are scheduled for him to have a sedated test (ABR, I think?).   I am able to write this because I am letting J. watch a Disney Princess movie (!) on a little DVD player in his room.  He is fascinated by all things \"princess\".  I used to try to steer him to Diego or Cars, not wanting him to get made fun of, but I've decided I should let him be who he wants to be.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/11/last-week.html", "title": "\nThe last week\n"},
{"date": "Friday, November 23, 2007", "body": "\n When it gets to be the holiday time of year, I go into a weird state of remembering the last months of my pregnancy with the twins. It was one of the scariest times of my life. I've mentioned before that we had just accepted J's adoption referral when I realized I was pregnant.  It was quite a surprise, but we were thrilled at the idea of a sibling for J.  During the same ultrasound which told us they were twins, we were told they were conjoined.The doctor could see two brains and two hearts, but below that you couldn't tell what was going on.  He couldn't get them to move apart. After three weeks of that situation (there are not many support groups for parents of conjoined twins on the internet...it's almost the opposite of the autism situation in that regard) we found out they were not conjoined, but monoamniotic (sharing an amniotic sac and placenta, but with two umbilical cords, which were extremely tangled from the outset).   The ob said, \"Don't go looking on the web, because you'll just get worried\".  When has anyone ever taken that advice, I wonder? The websites we could find all mentioned 50% survival rates for monoamniotic twins. If one twin doesn't make it, the second twin can't survive.  There is not much you can do except monitor things, and then deliver the twins as early as is safe.  The other parents on the website  www.monoamniotic.org  probably saved my sanity.  There were stories of loss, but also a lot of wonderful stories with happy outcomes. It was such a strange experience.  I didn't feel the twins moving that much, which in a way was a blessing, because when they did move I kept thinking about their umbilical cords, and wondering if they were getting more tangled.  On the ultrasounds, B. was very active, and G. seemed to be asleep.  I'd have to drink a really sweet drink to get G. moving to the ob's satisfaction. We didn't choose names until right before my c-section, and we didn't decorate their room at all, because we felt superstitious about doing too much preparation. Once the twins were born, and doing okay in the NICU, we just assumed everything was fine. And it is fine, but a complicated kind of fine, as you all know! But I think this time of year will always have a shadow for me, remembering all the ultrasounds and the waiting and wondering \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/R0cyzAljF5I/AAAAAAAAAJA/9DFENqXL_zw/s1600-h/DSCN0531.JPG", "http://www.monoamniotic.org", "http://3.bp.blogspot.com/_ccuTsPgAAcc/R0czTgljF6I/AAAAAAAAAJI/k6_vRfJ6Aac/s1600-h/DSCN0532.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/R0c4qAljF8I/AAAAAAAAAJY/cKaE7beHeIc/s1600-h/IMG_3354.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/11/three-years-ago-this-month_23.html", "title": "\nThree years ago this month\n"},
{"date": "Saturday, November 24, 2007", "body": "\nGot this idea from  Mcewen, over at Whitterer on Autism   1. the sight of Boston, as the plane circles while landing at Logan Airport 2. the smell of my boys when they first wake up (usually) 3. steamed dumplings at Mary Chung's in Central Square, Cambridge 4. my husband's voice when he's making a puppet (or baby unicorn, etc) talk when he plays with J. 5. rocky out-croppings along the side of winding road\n \n ", "outgoing_links": ["http://whittereronautism.com/2007/11/friday-five-good-things"], "link": "http://hoopdeedoo.blogspot.com/2007/11/five-good-things.html", "title": "\nFive Good Things\n"},
{"date": "Friday, August 17, 2007", "body": "\nWe're all in a tizzy around here, watching the progress of Hurricane Dean.  We think we learned a lot from our Hurricane Rita evacuation, two years ago, but we're hoping not to put it to the test.  The wonderful family we stayed with last time has emailed us, offering to take us in again.  They live in a very different type of area: scrubby woods with cacti, lots of deer, even scorpions.  I thought it was beautiful...a great change from suburban Houston. In a way, I'd love to go back. On the other hand, twenty-five hours in the van would be a lot more difficult now that the boys are much more active (and opinionated!) We would leave earlier this time, hoping to beat some of the crowds (most of the twenty-five hours was spent sitting still or inching along). Last time we were given some gas by a local man along the way.  This time they say that fuel tankers are being sent to areas along the evacuation route. Lots of people have bought gas cans to bring their own extra fuel.  G. will only drink milk, so we'll bring a lot of that in a cooler.  B. will drink soy milk in a pinch, so I can have some cartons that don't need to be refrigerated.  Last time I thought we could buy food along the way, but most stores were closed.  I wonder if they would drink water or juice if they got thirsty enough? I hope so! According to the projections, we may not even need to evacuate, but you have to prepare, just in case. If we do go, I'll update from Austin. Edit on Saturday:  Looks as if it will miss us. Yay! A photo from the last evacuation: \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/RsZy47nxqVI/AAAAAAAAADc/Qg7Z_3YCKmI/s1600-h/DSCN1003.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/08/watching-hurricane.html", "title": "\nWatching the Hurricane\n"},
{"date": "Tuesday, October 2, 2007", "body": "\n Lately, in the midst of some discussions about \"recovery\" and \"cures\", with some talk of high- or low-functioning kids mixed in, I've had a real chance to think.  I've realized that so often I think about the twins in terms of their relative progress.  Who has said what word, who can take their own shoes off (neither!), who can stack one block on top of another.  It's exhausting.  And it's making me feel like a failure at mothering B. Not a failure, that's too strong.  But I try the same things with each boy, in fact B. has gotten more therapy, and their development is so dramatically different. But starting now I've had enough of seeing B. in terms of what he's not doing yet. I want to enjoy him for his B.-ness.  He dances in front of the mirror.  He shakes with pleasure when he sees an FBI warning on a favorite DVD.  He says a word now and then, for his own enjoyment. He absolutely loves the pool and the bathtub. He finds Angelina Ballerina hilariously funny. When he hears the \"Between the Lions\" theme, he screams with excitement. He likes to rough-house and jump on the big bed. Occasionally he'll stare into my eyes.  I've read a lot of other moms describing this feeling, but I didn't get it.  I was still too new to the situation, trying to squeeze all the floortime I could into their \"window\".  Tonight, I'm content (and unbelievably lucky) to be B's mom, just as he is, and however he ends up being. \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/RwMTCCnWG3I/AAAAAAAAAFk/WgLB7GBdHNk/s1600-h/DSCN1810.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/RwMRFSnWG2I/AAAAAAAAAFc/Mqapa4EWNXY/s1600-h/DSCN1801_1.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/10/in-appreciation-of-b.html", "title": "\nIn Appreciation of B.\n"},
{"date": "Wednesday, November 21, 2007", "body": "\n This evening, after a complete failure of an attempt at giving the twins dinner, I was sitting around, holding G. in my lap.  He was being particularly \"engaged\", which was nice since lately he's been very self-contained. Out of the blue, he looked up at me and said, \"socks\".  Then he said, \"shoes\".  Next he said,\"car\", so I was beginning to get the picture.  Finally he did the sign he's made up for french fries and said \"fries\". Looking back on it now, maybe I should have popped him in the car and gotten him some fries, because that's the longest original speech he's ever made!  On the other hand, he is starting to say \"chicken....fries\" whenever I put him in the car-seat, so I am trying to cut back on the drive-through stops.  In the last week, B. has said two new words(!): \"goldfish\" and \"candy\".   \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/R0T9zwljF3I/AAAAAAAAAIw/fD163tpUkkw/s1600-h/DSCN1650.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/R0T-JgljF4I/AAAAAAAAAI4/zfbmB0PT3AY/s1600-h/DSCN1651.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/11/junk-food-as-ultimate-motivator.html", "title": "\nJunk Food as the Ultimate Motivator\n"},
{"date": "Wednesday, October 10, 2007", "body": "\n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/Rw2LSynWG6I/AAAAAAAAAF8/JMbNUEPDMyk/s1600-h/DSCN1808.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/Rw2K3ynWG5I/AAAAAAAAAF0/8RJOdMlOo_8/s1600-h/DSCN1812_1.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/Rw2KUSnWG4I/AAAAAAAAAFs/04aa-fB-Fjo/s1600-h/DSCN1807.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/10/wordless-wednesday.html", "title": "\nWordless Wednesday\n"},
{"date": "Sunday, October 14, 2007", "body": "\n We had a terrific day yesterday, at the Zoo with a local autism group.  I'd never met any of the families, but connected right away with a few of the other moms.  One was a fellow New Yorker, there with her 13 and 11 year old sons, the younger of whom has autism.  She is appalled at the services available here, and kept advising me to move back to NY as soon as possible (we'd love to, but need a job!).  She's been going to school district meetings, and says \"No one here speaks up or complains!\"  She was very supportive of our decision not to send the boys to PPCD. J. loved her two boys, and they helped him ride the merry-go-round, while I rode with G.  He was desperate to get on the thing, and then was afraid to sit on an animal.  So we sat on a bench, with him covering his ears and grinning from ear to ear.   We ended up separated from my husband and B., because B. fell in love with the fish building, which was dark and cool, and which allowed him to run free.   J. discovered the goat-brushing area, and happily brushed goats for a long, long time. G. did not want to get close to the goats, but was interested in the chickens, and kept trying to find a way into their pen.  Shortly after that, my friend's 11 year old disappeared, and we spent twenty minutes locating him.  She stayed amazingly calm (I would have been frantic, but I guess he doesn't usually go far).  He is pretty quiet, but can write his name and address, if someone thinks to give him paper. She said he used to have a medic-alert bracelet, which I've thought about for the twins. We all met up for lunch, and got a chance to get to know one another. Both twins fell asleep, and J. talked me into a giant bag of popcorn, so I actually talked to adults for almost an hour!  We live all over the greater Houston area, but many of us want to get together again soon. We automatically had so much to talk about. especially food issues.  There were at least four kids having goldfish crackers and not much else for lunch.  I didn't used to be much of a \"joiner\", but autism seems to be turning me into one.  \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/RxLazCnWG-I/AAAAAAAAAGc/wQnTgoWdFgc/s1600-h/highres_2317938.jpeg", "http://3.bp.blogspot.com/_ccuTsPgAAcc/RxLZ0CnWG9I/AAAAAAAAAGU/KN7jvawpk9o/s1600-h/DSCN1916.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/RxLY-CnWG8I/AAAAAAAAAGM/spfG3Stlpw0/s1600-h/DSCN1938.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/10/zoo-day.html", "title": "\nZoo Day\n"},
{"date": "Friday, October 19, 2007", "body": "\n I've been having some lovely times with B. lately.  He is determined to jump with two feet off of the ground, so we stand in front of the mirror and jump together.  We also do a sped-up type of jogging, which I think is inspired by the Wiggles.  He loves to be swung back and forth with my arms under his armpits, watching himself in the mirror (although I don't know how long my back can keep that up). I feel connected to him when we do these sorts of things. He'll look right at me and smile, and maneuver me into a position to keep me doing what he wants.  If I work at it, I can get him to say \"jump\" or \"swing\", but sometimes I'd rather let him enjoy what we're doing. I was just saying to someone that B. doesn't name his letters anymore.  I figured he still knows them, but has moved on to other things.  Then tonight in the bathtub, he started picking up foam letters, saying the name, and throwing it into the air behind him. He may not do it again for months, but it was nice to hear it.  A little trip down memory lane. I can't even begin to say all the things G. is doing lately.  Naming his colors, trying to count things, giving me kisses.  He also sometimes calls some of his ducks \"mommy\" and \"daddy\", but still not his actual mom and dad.  J. is doing great at school, and giving me a real run for my money at home.  He is so jealous of any time I spend with the twins.  But when I try to take him somewhere for special \"mommy time\", he wants to bring the twins.  I can't figure him out, but I'm trying hard to stay calm and understand what he needs. \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/Rxl0CinWHBI/AAAAAAAAAG0/B8HCicZFbqA/s1600-h/DSCN1909.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/Rxl0jynWHCI/AAAAAAAAAG8/upMOL3kLDQU/s1600-h/DSCN1794.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/Rxl09ynWHDI/AAAAAAAAAHE/vUFDpviwpi8/s1600-h/DSCN1871.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/10/ive-been-having-some-lovely-times-with.html", "title": ""},
{"date": "Tuesday, August 21, 2007", "body": "\nJ. doesn't get much mention in this blog, because he is generally doing well, I suppose. One area he has found challenging is having a poop anywhere other than in his pull-up, which he wears at night (I write this blog assuming that it won't be around by the time my kids are old enough to be embarrassed by it!) I kept upping the positive reinforcer ante (okay, bribes), to the point where he was getting a full-blown party once he accomplished the deed.  Well, he finally did it, and we had the party.  He ended up confused, and told one person we were going trick or treating, told others that it was his birthday, and actually asked us to sing \"Happy Birthday\" to him at the height of the festivities, which we did.  So, there is a light at the end of the potty-training tunnel. \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/Rsu6S7nxqWI/AAAAAAAAADk/zsX61Db49G8/s1600-h/DSCN1300_1.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/08/number-one-son-goes-number-two.html", "title": "\nNumber One Son goes Number Two\n"},
{"date": "Wednesday, October 24, 2007", "body": "\nWe went back for our six month check-up with our developmental pediatrician.  The twins went together this time, which worked fine and saves a lot of driving and child-care scrambling. The dr. hasn't given us her report, but she did say B. is about where G. was six months ago.  I have to say that while I like the dr's manner, I don't put much stock in her assessments. B. and G. are so different, it really has no meaning to say that B. is where G. was at any given time.  She also said that they are both at about 12 months in their fine motor skills.  They are light years apart in their fine motor skills, as far as I can tell.  I don't know if we'll bother going back again in six months.  She also wants us to put both of them in intensive ABA programs.   I was feeling very ready to leave when G. gave me a pick-me-up.  The social worker and I walked into the exam room together, when  G's face lit up and he said \"Hello\" in a loud cheesy voice.  The social worker was thrilled.  Only my husband and I knew that he was being King Midas from a \"Between the Lions\" CD we have in the car.  I almost shrugged it off at the time, because G. is constantly singing something from a movie or CD these days. Once I thought about it, though, I realized it was the first time he's said hello to me. Wow. I'll probably take this back someday, but right now, I'm loving echolalia. \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/RyAcYHwT3EI/AAAAAAAAAHM/f8z0oDpjz34/s1600-h/DSCN1647.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/10/bring-on-echolalia.html", "title": "\nBring on the Echolalia\n"},
{"date": "Saturday, May 5, 2007", "body": "\nThis is the worst weekend of my life.  Yesterday someone from the developmental pediatrician's office called and said, \"I forgot to tell the doctor that you called about the MRI results, but I'll tell you what it says.\" I wasn't really  processing what she was saying, but first she said \"otherwise normal\", and I just heard the word \"normal\" and started to relax.  Then she said \"I'm trying to look up this word...hypomyelination...\"  And she said \"Don't tell anyone we had this discussion, I'm just clerical\".  Now I keep thinking I should have said, \"Stop talking, let the doctor tell us!\" Anyway, the doctor had already left, and we just have this word \"hypomyelination\" to think about.  Googling it led me to things like muscular dystrophy, so I'm trying to stay very, very busy, and pretend I've never heard the word. But I don't know what to think.  G. is the one who is saying words, and smiling at me, and pointing, and laughing at silly things.  Could he just be missing some myelin, not losing it? And if the twins are identical, how could this be on G's MRI and not B's?  Although a lot can happen after the egg splits. It seems to cruel that G. would have autism and also some problem with his myelin.  In my googling, I couldn't seem to find any benign myelin problems, but I did have to get off the internet at a certain point, just to save my remaining sanity.   We don't know how to page this doctor, but it just occurred to me that I have an email address. I'm going to try emailing. To anyone who might be reading this, would you find a way to page the doctor if you were me?  My husband has decided it must be something benign, and thinks we should wait for Monday.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/05/mri-trouble.html", "title": "\nMRI Trouble\n"},
{"date": "Tuesday, May 1, 2007", "body": "\nI had a revelation yesterday.  G. did what I thought was his sign for banana, and then said \"Chugga, chugga, woo, woo!\" (the woo, woo is a new accomplishment, and I'm thrilled about it).  He ran across the room and got a train.  A light went on in my head, and I finally understood why he'd been signing banana in strange contexts  and refusing the bananas I offered him (when they make a request, I fall all over myself trying to respond, thinking it'll encourage them to keep requesting).  Overall, G. is much more interested in trains than bananas, so it all makes a lot of sense.  I wonder how many other of these misunderstandings we're having.  It's got to be frustrating for him, but I think he's getting a lot more motivated to make us understand, which is so great.  Yesterday he said \"hot\" and \"backpack\"--two new words in one day On the B. front, I'm meeting with a woman who may provide us with ten hours of ABA a week, just for B.  She seems very experienced, and is really reassuring to talk to.  Really, I felt so relieved talking to her that I think I'd pay her just to come to our house and hang around.   Tomorrow is G's MRI.  Now this is a child who has never drunk a clear liquid in his life.  And the MRI is at 12:30, so he is going to be like an angry grizzly cub at that point.  My plan is to give him apple juice in a medicine dropper and see how that goes.  B.'s MRI came back totally normal.  it almost seems that we could cancel G's, since they're identical twins, but I don't think the doctor would go for that. I signed up for a scrapbooking retreat in July.  I'm not that much of a scrapbooker, but I am definitely ready to retreat. I have never, ever been away from all of my children since the day J. came home.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/05/why-does-she-keep-giving-me-bananas.html", "title": "\nWhy does she keep giving me bananas?\n"},
{"date": "Thursday, May 10, 2007", "body": "\nThis morning Ms. Marie, the young woman who will be doing some ABA with B., came over to talk.  She is an extremely optimistic, bubbly person, which makes me feel like the cranky New Yorker I often am, but so far I love her. The twins seemed to react positively to her, which is great for a first meeting.  G. was lying on the floor making his baby duck kiss the mommy duck, and B. was jogging around smiling.  At this point we are going to do ten hours a week, for B. only.  I got the feeling she'd like to work with G. also, but since he's progressing pretty well, and we aren't rich, it's just going to be B., so far. My husband is a bit worried about how much ABA will cost, but I think it's worth trying.  I was very pushy with Early Intervention, but I ended up with each twin getting two hours of services a week (up from 30 minutes/week). That's speech and OT.  For kids with so many challenges, that's just not enough. I think it's worth spending our money now, while they are so little. I don't mean put ourselves into financial ruin, but do what we can with what we have. (Piece of advice: if you have kids with special needs, do not move to the Lone Star State.) Off and on during Ms. Marie's visit, B. was trying to get himself one of the Signing Time DVD's, which was hidden on a very high shelf  (running around looking at a DVD case is a current preoccupation).  He even dragged a chair across the room, and kept looking from the chair to the shelf, but couldn't decide what came next.  I find it so interesting that he can think of bringing a chair over, but hasn't figured how to use the chair to reach something (I know it's just a matter of time!) G. is singing songs all the time now, although  much of the time we aren't certain which song it is.  One of the lines he gets stuck on is from a song the Wiggles sing in Italian (something like \"baila, bambina\").   A friend of mine heard him singing it and said, \"You're teaching him Italian?\"  Okay, I'm a bit of a crazed autism mommy, but not that crazed!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/05/new-ventures.html", "title": "\nNew Ventures\n"},
{"date": "Sunday, May 27, 2007", "body": "\nAbout the following post: my mom and my husband have convinced me that a two-year-old screaming about having to leave the pool is not such a huge deal.  It was the end of a long day, and I was feeling overwhelmed.  Today I'm feeling good about having heard two new words in one day. For the first time today, I took G. to the pool.  i had taken J. and G. to the neighborhood playground, not realizing that our pool had opened today.  They both ran to the fence and stuck their faces through, staring at the people in the pool. Last year, during the summer of realizing all was not well, I never got my nerve up to try taking a two-year-old and a one-year-old to the pool (not to mention all three of them). This year I feel it's going to be possible (two at a time, as long as one of them is J.)  We had a lot scrambling around looking for swim diapers and pool shoes, and headed out. G. loved it from the start.  He  splashed around, and smiled at our neighbor who was splashing alongside him.  We stayed in the baby pool, I don't think I could have managed it otherwise.  G. tried two new words in one day, which never happens: splash and pool.  He ventured off on his own a little, coming back each time to sit in my lap. We were there for almost an hour, with both of them perfectly content. After I had marveled at how well it was all going, I tried getting them out of the pool.   J. was stubborn but managed not to have a tantrum.  Despite being the NT brother, he's been the most tantrum-prone until just recently.  G. started to scream as soon as he realized we were leaving, and kept it up almost continuously for 20 minutes, until I finally got him in the door of our house.  I had taken them there in the stroller, so we provided a screaming spectacle for all the pool patrons for our entire walk home.  Our next door neighbor came out to see what was happening.  I'm not sure if he knows what's up with the twins, but this may have given him an inkling. I'm trying to focus on how much he loved the pool, and how happy we all were in the water.  But I'm so discouraged by how hard it was to leave.  I know that I've been lucky so far...I'd read about other kids' tantrums in public and wondered if that was in our future.  Apparently it is, and I'm going to have to develop a thick(er) skin.  Last week we also had a huge meltdown in the grocery store. That one involved J. crying, which made G. plug his ears and start his own yelling to block out J's noise. Luckily B. was blissfully unaffected.  I decided I would stand there in the bakery department until it blew over, and it worked.  I may not try taking all three of them to the store again for quite a while. I'm telling myself it's the terrible two's combined with autism, and thinking that once the boys can communicate more, the screaming will decrease.  I really, really hope this is right!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/05/tantrums.html", "title": "\nTantrums\n"},
{"date": "Thursday, May 17, 2007", "body": "\nThis past week, my in-laws have been visiting, something I had been nervous about.  At Christmas time, I was still the only one who thought the twins were autistic, so there were a lot of \"oh, they're fine, don't worry\" comments flying around.  But I have to say, this week has been wonderful.  My mother-in-law cuts out articles and gives them to me, but I don't feel pressured.  In fact, it's a pleasure to watch both of my in-laws enjoy all three boys just as they are.   J. made sure to explain every minute detail of our lives to them, while B. and G. have pretty much ignored them.  G. did repeat \"Papa\" several times and clap, which was a great moment.   G. also used a two word phrase! (not repeating it...he came up with it on his own).  When he wants something, he says and signs \"Please\" (\"peajh\"), and then signs \"more\".  This is really, really cute, but still leaves me with no idea of what he wants. Other times he just seems to scroll through every word or sign he can think of.  We are really making progress, but we've got a ways to go before I actually know what he's talking about. At this point, it is so wonderful to hear his voice trying to say words, I'm happy to wait for him to figure it all out. B. had his first meeting with Ms. Marie, his ABA therapist.  He responded very well, and did some things for her that I hadn't seen him do in a long time.  She is a really  warm person, and spent most of her time singing to him and playing in a gentle way.   Another B. milestone:  he took the red chair, dragged it across the room, climbed on it and would probably have reached the forbidden DVD boxes if my MIL hadn't caught him!  This opens up a big child-proofing can of worms.  J. can climb up and get things, but his preferred mode is always to remain at ground level and talk a grown-up into helping him.  G. isn't trying to climb at all yet.  But our days of being able to stick dangerous things up high are coming to a close! (Note: I'm not trying to say that the DVD boxes are dangerous.  If he gets hold of one, however, B. will cease to interact with us for the entire time he has it in his hands) So, we're having some hopeful days around here\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/05/in-law-visit.html", "title": "\nThe In-Law Visit\n"},
{"date": "Sunday, October 28, 2007", "body": "\nI managed to calm down after the doctor's appointment, largely due to a picnic we attended on Saturday.  It was held by our local branch of the ASA, and it was encouraging, relaxing (as much as taking our 3 boys to a big park can be), and just such a relief to be with families who understand. There was a ton of food set up in one pavilion, but not many people sitting down at any given time.  Most of the conversations took place quickly, as we passed each other on the playgrounds or swings, or while juggling plates and children. One thing I noticed was that the parents of teenagers got to sit down and eat a regular meal.  The parents of kids under ten or so were doing lots of running, chasing and generally following kids around.   Once the twins had worn themselves out I had some actual conversations with other parents, and felt validated for sticking with my approach of some ABA and a lot of intensive playing, singing, jumping and so on, in a natural enviromnent.  One mom kept telling me \"Buy them a computer!\" because her son has taught himself to read and do all sorts of other things on the computer.  He was the cutest little five year old, walking around reading every sign he could find.   I finally figured out what G. means when he points to his chin and says, \"Boo\".  He saw a lady with a plastic spoon, and started following her around saying \"Boo!\" and \"Peesh!\" (please), until she went and got him his own spoon. He has a thing he does where he bounces a spoon up and down, and says \"one, two, fwee, foe\".  I'm sure it's from a movie. Now if I could just figure out: \"Fwee, fwee...oooooooooo\" \"Care-a  bear-a\" (it's not care bears, because he doesn't know them) and  about twenty other things that he says all day long, I'd have some peace of mind. I feel as if I live with someone who constantly speaks to me in a foreign language, and I do mean constantly. As usual, we only managed to take pictures after everyone was exhausted. \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/RyVRsXwT3FI/AAAAAAAAAHU/HrIAF9Jp4Pw/s1600-h/DSCN2012.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/RyaibHwT3HI/AAAAAAAAAHg/CfedFR_PU-4/s1600-h/DSCN2011.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/Ryai4nwT3II/AAAAAAAAAHo/D0NGnNlUlT4/s1600-h/DSCN1993.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/10/asa-picnic.html", "title": "\nASA Picnic\n"},
{"date": "Tuesday, May 22, 2007", "body": "\n I finally added a picture to my blog...not where I really wanted it (see below), but I did it! I love DSL! I am a little worried that I may fritter away a lot of time on YouTube.\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/RlNU9TSB6dI/AAAAAAAAAAs/c0AEBE096Hc/s1600-h/DSCN1598.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/RlNUUjSB6cI/AAAAAAAAAAk/Ca3n_A4mYoA/s1600-h/DSCN1698.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/RlNP3DSB6bI/AAAAAAAAAAc/lF4xKOA-JQM/s1600-h/DSCN1565.JPG", "http://1.bp.blogspot.com/_ccuTsPgAAcc/RlNOEjSB6aI/AAAAAAAAAAU/Y9s8DuQQN_Y/s1600-h/DSCN1288.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/05/dsl-i-love-it.html", "title": "\nDSL, I love it!\n"},
{"date": "Friday, July 13, 2007", "body": "\nWe actually had a therapy-free day!  In the morning we went to an indoor playspace, where I stayed longer than usual because all the guys were happy.  I'm getting much less sensitive about what other moms may think of me.  Just getting from the van into the playspace is a workout, and we kind of explode through the doorway, with G. plugging his ears and making sad sounds.  At this point, I think, if someone can't tell that our family is, shall we say, a little special, then they just aren't too observant, and that's their problem.  Most people are incredibly nice, in any case. In the afternoon I took J. to the pool, where he met a five year old girl who proceeded to play with him and boss him around, which is probably a good combination for him.   In the evening I took just B. to the pool, and he was in heaven.  it's a little scary, because he has no sense that he shouldn't walk right off the edge into the water.  I pulled him around the pool, and he splashed and smiled and said \"Zubadee, zubadoo!\" (his happy words).  He also drank a lot of pool water, which is bad but also good, because normally the only liquid which he lets past his lips is milk.  The question is, how do we go from drinking heavily chlorinated water straight out of the pool to drinking regular water out of some kind of cup? I have finally made a friend who likes to drop by with her son (back in the East, I always had friends who would just drop by casually, but I only have a couple like that here, and they don't have little kids).  This little boy speaks no English at all (he's Vietnamese), but he and J. can play for hours at a time.  The twins seem to find him mildly interesting and occasionally amusing. So all is well here, although we are struggling with how to get shirts onto B. without an epic battle.  I actually thought about sneaking in and putting a shirt on him while he sleeps!  We have certain hard-line therapists who would scoff at this, wanting me to face every difficulty head on.  To those therapists (there are only 2 out of 7 who are real tough) I say, take over my job for a week or so, and let me know how it goes!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/07/friday-thirteenth-not-at-all-unlucky.html", "title": "\nFriday the Thirteenth, not at all unlucky\n"},
{"date": "Sunday, May 20, 2007", "body": "\n I've mentioned before that I go to a UU church.  It's becoming a haven for us--one place in this area where I fit right in with my wild hair, minimal make-up and casual clothes. J. has made good friends, and the twins have a lot of people who will look out for them.   Lately at church I seem to meet a parent of a child on the spectrum almost every month.  So far, I count one girl and five boys, in a church of 250 or so members  The mom I met today I had actually met before in a Moms of Multiples Club, which I've since dropped out of. The motto of that club was \"where God chooses the members\".  I never liked that motto, because I felt like where does that leave the moms who have had miscarriages, or moms who have had a child with chromosomal problems?--both clubs I'm also a member of. But, I digress. Out of the ten or so kids in the toddler class, three are on the autism spectrum.  The mom of the other boy and I bonded today by talking about Omega 3 Fatty Acids and Signing Time movies.  Her son is doing really well, and is just now getting diagnosed at the age of three. But why so many of our kids at this one little church? My husband says it's because UU churches, with their open-ness to agnosticism, etc., attract nerdy engineer types, and we do have a lot of those.  Whatever the reason, I feel like I've found an  autism mom support group without even having to look for it.\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/RlNMtDSB6ZI/AAAAAAAAAAM/p69B0I_125k/s1600-h/IMG_3008.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/05/autism-and-unitarianism-is-there-link.html", "title": "\nAutism and Unitarianism--is there a link?\n"},
{"date": "Monday, July 2, 2007", "body": "\n Something has happened to the blogging part of my brain.  If it's like everything else in this house, it will eventually turn up, usually under the couch, or on the floor of the mini-van, or possibly stuck to the side of a chair with an ancient slice of banana. Tomorrow my mom is geting her hip replaced.  My parents are amazingly active, still cross-country skiing, kayaking and climbing mountains, while both in their seventies. I'm hoping this surgery will allow my mom to keep up her outdoor pursuits.  I wish I could be up there in NY when she has the surgery, but both my sisters will be there, so it'll be alright. B. has decided he would prefer to be a nudist, and has taught himself to remove his clothes and diaper.  I think the OT will be happy-- he even removed a shirt with buttons!  So far, he leaves his clothes on most of the time, and just occasionally decides to strip down. The funny thing is that he still likes hats as much as ever. \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/RonQaTqrS5I/AAAAAAAAACU/SpLGOb9lCpI/s1600-h/DSCN1478.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/RonNnDqrS3I/AAAAAAAAACE/a9qBx0ER6t8/s1600-h/3070.jpg", "http://3.bp.blogspot.com/_ccuTsPgAAcc/RonNHDqrS2I/AAAAAAAAAB8/qoIJ86nSbC8/s1600-h/2917.jpg"], "link": "http://hoopdeedoo.blogspot.com/2007/07/not-quite-blog-maybe-blip.html", "title": "\nNot quite a blog, maybe a blip\n"},
{"date": "Thursday, May 31, 2007", "body": "\nB. seems to be doing well with the ABA (it's only three hours a week so far, so it's amazing if it does anything) He is starting to try to put rings on the ring stacker (if you put the ring in his hand, and pretty much give him no choice).  He babbles like crazy at the ABA therapist...I think she gets him excited with all her effusive praise. G. has decided to learn the English language starting with three syllable words. Of the thirty or so words that he can use, a big percentage of them have three syllables. Recently it's \"animal\", \"dinosaur\" and every once in a while he'll bring back \"octopus\".  He also does a version of \"Toot, toot, chugga, chugga, big red car\" that sounds like it's in another language. I'm so fascinated by how he's approaching learning to talk. I think if we could sing everything we said, he might already be talking.  I don't know if I've mentioned it here, but B. has essentially stopped talking completely.  I've shared my fears when G. regressed, and he's always come back within a few weeks.  With B., he said so little to begin with, and the silence has lasted so much longer, I'm not sure what to think.  One thing I've noticed about the ABA therapist: she's very optimistic about B., and I think he senses it.  So I try to keep my hopes and my expectations high.  One thing is for certain, B. is the mellowest and generally happiest member of this family by far.  Lately he tends to look right into my eyes and say \"Woooooo\" very earnestly.  It's very sweet. At bedtime, J. has fallen in love with Where the Wild Things Are, by Maurice Sendak.  I'm enjoying re-discovering it alongside him.  My favorite line is \"The night Max wore his wolf suit, and made mischief of one kind and another...\" Max would feel right at home in our house\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/05/night-max-wore-his-wolf-suit.html", "title": "\nThe Night Max Wore his Wolf Suit...\n"},
{"date": "Friday, July 6, 2007", "body": "\n My mom (that's her with G. in the photo) is doing well with her new hip (or fake hip, as my nephew calls it).  She's already walking down the hallway with a walker.  When I talk to her on the phone, she sounds great.  Today she moved to the rehabilitation hospital, where she stays for a week or so. I think I am coming out of my mini-depression, or whatever I've been in. Setting up all the private therapy has had me wound up, and trying to find some kind of nursery school experience for the twins has added to the strain.   Reasons I feel better: 1. We have a new Early Intervention therapist.  This is the first one for whom it's a physical impossibility that I'm old enough to be her mom, which is refreshing.  Even better, she has experience working with children with autism...hallelujah! 2. B. says the alphabet through \"G\" (every once in a while, when the mood strikes him).   3. The private OT and Speech are all set, and I like the therapists. 4. I've stopped crying every time I see a certain Suburu commercial.  I don't know what that was about, but it was weird! We are still having some serious issues (J. is having real jealousy problems, etc), but we are doing okay.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/Ro8P9TqrS6I/AAAAAAAAACc/3FBNF0qwvNA/s1600-h/IMG_3015.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/07/fake-hip.html", "title": "\nThe Fake Hip\n"},
{"date": "Tuesday, June 5, 2007", "body": "\n I've got to figure out how to get some more ABA hours for B!  It makes him as mad as anything, but after it's over, he'll look right at me and say a word, which he never does anymore.  The ABA therapist we have is great, but she seems to be very in-demand for trainings and such, which interferes with her schedule.  I may try advertising for grad students at the local university, which actually has a degree in ABA.  . I'm trying to think how i can make a routine in which the twins will be more active participants, rather than just having things happen to them.  I'm trying to think of tasks they could help with, or even do themselves.\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/RmXMrlJncmI/AAAAAAAAABM/oeBQ-IJ22-o/s1600-h/DSCN0926.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/06/ive-got-to-figure-out-how-to-get-some.html", "title": ""},
{"date": "Wednesday, July 25, 2007", "body": "\nThe usual quick update: My sister from Boston is visiting again, and getting all kinds of things done!  She is one of those people who likes to organize, so I guess she got the gene which is totally absent from my DNA.  My pantry is organized, my box of kids' socks is organized, and moments ago she disappeared into the garage to take a shot at the floor of the mini-van.   She also made it possible for my husband and I to go out for dinner (Thai food, ahhhhh), which we haven't been doing enough. G. has decided that he likes his new OT and SLP, which is great.  Now he cries as we leave instead of as we get there, which isn't ideal, but it's an improvement.   B. is doing a little bit of imitating, which is a really hopeful development, because it could make it so much easier for him to learn so many things.  He suddenly learned to sign and say \"clothes\", which is funny because he spends a lot of time taking them off. I wasn't making any effort to teach him that word or sign, but he picked it up from a DVD. This weekend is my scrapbooking retreat at a B and B.  I haven't been apart from all three of the boys at once except for one single night.  It'll be good for all of us, but I'm a little nervous!  Not that nervous,, though, mostly excited.  I scheduled a massage, and I plan to spend a big chunk of the weekend either in the shower or lolling around in bed.  And, oh, yeah, some scrapbooking.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/07/busy-days.html", "title": "\nBusy Days\n"},
{"date": "Wednesday, June 6, 2007", "body": "\n G's favorite toys at the moment are small penguins, and a tiny Sir Topham Hat figure.  They have certain similarities, if you think about it. Today, after J. ate two peanut butter and jelly sandwiches in a row, I said to him, \"Peanut butter will make you grow big and strong!\"  Then for some reason, I added, \"I'm not sure what jelly does for you\".  J. answered, \"Jelly will turn me back into a baby\".  It reminded me of what a magical place the world seems to be when you are three.  B. may be deciding to talk again.  Yesterday he said \"car\" and \"cookie\", and (maybe) \"yellow\"!  He has also started to say the names of letters again, every once in a great while.  He has been all smiles today.\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/RmciX1JncnI/AAAAAAAAABU/kBmny2q_VrM/s1600-h/51CMNZDB4HL._AA240_.jpg", "http://1.bp.blogspot.com/_ccuTsPgAAcc/RmciYFJncoI/AAAAAAAAABc/xeW5L05Zb2c/s1600-h/3121D90V0EL._AA280_.jpg"], "link": "http://hoopdeedoo.blogspot.com/2007/06/our-current-obsessions.html", "title": "\nAn obsession with formal wear ?\n"},
{"date": "Friday, October 26, 2007", "body": "\nToday we got the report on G. from the developmental pediatrician.  I'll have perspective in a day or too, but right now I'm hurt and mad. I'm actually pretty much over the hurt, and fully into the mad. What I\"m upset about: After a few minutes of observing him she concludes: G. is on a 16-month level in language (that might be right, but I'm annoyed anyway). He makes little or no eye contact (not true). He can request a cracker with a word and a sign. He has low-set ears. And so on. Then there was a cut-and-paste section of suggestions: - he should sit in the front of the classroom (he's not even three) - parents should try to spend at least 30 minutes interacting with the child per day (I'm a stay-at-home mom!) - use positive reinforecement (she gives examples  such as saying \"Good Job!\" or giving a hug and a kiss)  I know the last section was just there because they must put it in every report, but I think most parents would be offended by the suggestion that they start saying \"Good job\". Yes, that's why we wait months to see a specialist!  I'm supposed to be hugging my child?  Why did no one tell me this before?  No wonder he's autistic  The fact that she wants me to get him 25 hours of ABA, and then reminds me to spend thirty minutes a day with him pretty much sums up the difference in our philosophies.  And I do believe in ABA, for some kids.  And G. is getting some ABA, and probably will get more.   I'd be fine with the ABA recommendation if the rest of the report seemed more personalized, or even as if she had spent more than ten minutes on it. We aren't planning to go back, although my husband doesn't want me to \"burn any bridges\", in case we need the clinic for referrals or letters of medical necessity in the future. I plan to write something up,and then talk to the social worker, who seemed a little more concerned about us as individuals and as a family. I feel like I could go out and run five miles, or fire off a nasty email.  I'll probably take the dog for a walk, then put on my pajamas and read my mystery.  Meanwhile, to counteract all of the above: G. talked my ear off today, to the point where I said to my husband, \"Let's pull B. out of speech therapy.  We need one quiet one in the house!\" (That was a joke, in case the developmental pediatrician ever reads this) B. keeps trying to sing \"Sing, sing a song\" from Sesame St.  He says \"Siiiiiiinnng, dadee sooooooonnnng\". It's very, very cute.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/10/vent-after-reading-dev-peds-report.html", "title": "\nVent after reading dev. ped's report\n"},
{"date": "Sunday, June 10, 2007", "body": "\nOnce again, I took J. and B. to church with me. I alternate-- one week J. and G., the next week, J. and B.  All three are in the same room, and while J. does great in Sunday School, the twins need extra attention, and there aren't enough teachers for both to be there at the same time. Today a teacher came to get me about five minutes into the service with a very distraught B.  I spent the morning with him, going between the playground, the infant room, and finally the toddler room for snack.  The teacher in the toddler room (whom I really respect and like) said, \"I think B. is okay in this class as long as you are here.  G. is just a little farther along\".  So it looks as if I'll have to stay with B. when I take him to church. (Actually, I have ideas for other solutions, but we'll see what I can work out) Now, he is really progressing lately. He'll walk holding my hand when we go to stores (sometimes).  He recognizes some of the PEC symbols in our schedule, and I swear he said \"Sleep\" when I showed him the sleep picture today (!!) He says something like \"teeth\" and \"brush\" when he sees his tooth brush.  This is fantastic for someone who recently took a month or two off from saying anything at all.  But despite all this, he is not fitting into his Sunday school class.  Church has been a haven for me so far, with a group of people who seemed happy to watch out for the twins and their unusual needs.  I hope it will keep being such a place, but I can see that I need to enlist extra help. Maybe pay a teenager to stay in the room with B., and take him out to run when he needs it.  Another thing about B:  a long time ago (maybe a year?), B used to get very excited when his big brother would run around and act silly. He would clap and jump and laugh.  This morning I saw him smiling a little when my husband and J. were running around the house, screaming like banshees.  Even G. joined the chase, so I took B's hand and started running after the others.  He got the biggest grin on his face, and I'm sure I did, too.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2007/06/another-sunday-morning_10.html", "title": "\nAnother Sunday Morning\n"},
{"date": "Sunday, June 17, 2007", "body": "\n Lately I've been wondering about B's words.  They come and go, and often when a word goes, it seems to be for good.  I think he peaked last December, when he had maybe ten words that he would occasionally say.  At that point, he could also fill in words in songs (sometimes), which he does not do at all right now. I don't want to be depressing.  We are getting back to a stage of having a few words.  \"Cookie\" came into favor for a while, and got his ABA therapist very worked up.  It seems to have faded out again, although the ABA therapist says that he can say it, so we should expect him to.  He also said \"brush\" for a few days after getting a new toothbrush which he loves. I remember reading The Siege, by Clara Claiborne Park, long before I had kids, and even before I started teaching kids with autism.  I remember being fascinated by her story. One thing that stuck with me was that her daughter would learn a new word, say it all the time, then move on to a different word.  I can't remember how long that lasted, but she did eventually speak in sentences, and as an adult talks well. She's an artist now. I disagree with our ABA teacher about thinking that B. \"can\" say the words, if he wants to.  I think they are in there, but he can't necessarily retrieve them at will.  But her techniques are so gentle, and rely so much on having fun with him, I'm okay with having some philosophical differences.  One great result of her working with us is finding out that I should ignore tantrums (I should have known that, but I always end up either in conversations with J., or trying to comfort G.)  So the last time J. tantrumed, which as always caused G. to plug his ears and have his own tantrum, I went over and looked at a book with B.  It was great, and the tantrums probably did end quicker than usual. \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/RnYEC1JncqI/AAAAAAAAABs/NAijGQuWzuA/s1600-h/3066.jpg", "http://4.bp.blogspot.com/_ccuTsPgAAcc/RnYDPFJncpI/AAAAAAAAABk/FcPOwZD4POA/s1600-h/3072.jpg"], "link": "http://hoopdeedoo.blogspot.com/2007/06/where-do-words-go.html", "title": "\nWhere Do the Words Go?\n"},
{"date": "Tuesday, September 30, 2008", "body": "\n A friend of J's generously invited all three boys to her party at the Little Gym.  It was so much fun, and completely exhausting.  I brought along our sitter, and I don't think I would have survived it without her. I know the entire box of cupcakes would have hit the floor if she hadn't been there, courtesy of G.  As it was, he only managed to take the birthday girl's cupcake right off her plate!   Each boy tried all the equipment.  The twins actually seemed interested in Duck, Duck, Goose, and really went wild when they brought out the giant parachute.  That was the most physically exhausting part for me, because B. wanted to be on or under the parachute at all the wrong times.  Our sitter is only twenty, and she looked completely wiped out by the end.  She asked me why they didn't provide caffeine for the adults  I had a similar thought, but it was more along the lines of a nice glass of wine.\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/SOLjiodMBDI/AAAAAAAAARQ/gizNY6wXe8k/s1600-h/DSCN3081.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/SOLjKDDfycI/AAAAAAAAARI/lYI7X1I8KVI/s1600-h/DSCN3087.JPG", "http://4.bp.blogspot.com/_ccuTsPgAAcc/SOLi43IQW9I/AAAAAAAAARA/ZIhXa1Bs8Pw/s1600-h/DSCN3102.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/09/friend-of-js-generously-invited-all.html", "title": ""},
{"date": "Wednesday, April 22, 2009", "body": "\nI took B. into the pediatrician today to get a vaccination.  We split them up by a few months this year, not because I think vaccines caused their autism, but just because ??? Who knows?  It just felt like a good thing to do. Our pediatrician is finally back in the original office, after months of repairs from Hurrican Ike.  As far as I can tell, they spent a huge chunk of the insurance money on the mother of all fish tanks.  They've always had a tiny one, and the only interest B. has shown in it was watching the bubbles rise. Well, today he could not stop bouncing around and staring at it.  Then I realized he was saying, \"Goldfish, goldfish, what do you see?\" (from the book  Brown Bear, Brown Bear , by Eric Carle, which G. recites in its entirety frequently throughout the day).  I was so excited, because B. never used to show that he was noticing things in the environment, not to mention knew their names!  I kept smiling proudly, as he jumped around the waiting room.  Other people looked uncomfortable, and didn't meet my eye, and I can see that he was acting weird, in terms of usual waiting room behavior.  But I was so happy! Then, when the nurse was about to give him the shot, she said \"One, two, three...\", and he said in the saddest little voice, \"four, five, six\".  He also slapped her hand when she said \"give me five\", and said \"bye, bye\" when I asked him to. I was walking around with a goofy grin for an hour or so afterward, I'm sure.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2009/04/drs-visit.html", "title": "\nDr's Visit\n"},
{"date": "Tuesday, April 28, 2009", "body": "\nG's latest occupation:  holding a number placemat and singing first \"This Old Man\" (one to ten) and then \"There were ten in the bed and the little one said, Roll over\" (ten back down to one).  He has found the ultimate, never-ending song!  Our college student who comes in the afternoons is out of town, and my sanity is already a fragile thing.  I am plotting to go to every store which has the carts which will hold two or three kids (Target, HEB, Randalls, there must be more).  I've been working hard on getting them to walk with me in public, but I still need a \"strapping in\" option when I've got all three of them. It feels so strange to me that I can't take my kids out by myself.  When they were younger and slower-moving, I could, but these days it's just not safe.  Everyone tells me this will get easier, and I just have to assume they are right!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2009/04/name-that-tune.html", "title": "\nName that Tune\n"},
{"date": "Friday, August 29, 2008", "body": "\nWhat's happening today: - thinking about having a Gustav-inspired evacuation drill to our friends' house in Austin. It doesn't seem to be heading toward us, but we can't forget the 25-hour Rita evacuation nightmare. - today the twins walked into and out of school under their own power (granted I did park in the handicapped spot, but it's still progress!) -the para-professional is my new best buddy--walked us to the car, gave me details about their day, etc.  Talked to the teacher briefly, but not enough.  Must remedy this situation! - J. seems to have a nice bunch of kids in his Pre-K class this year.  Apparently his teacher had a very tough class last year and they are trying to give her a break.  I'm glad that having J. in a class is considered a \"break\".  - most exciting of all: got to talk on the phone with one of my heroes, Susan Senator!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2008/08/whats-happening-today-thinking-about.html", "title": ""},
{"date": "Thursday, July 3, 2008", "body": "\n Overall, we are having a great summer in terms of progress...G. is using phrases, and repeating a lot of what he hears.  B. is using more and more single words to make requests, and singing snatches of songs.  Both of them have been more engaged than they had been six months ago (this always comes and go...the going still has the power to put me in a tailspin!) J. can pedal his bike, has new friends next door and is learning by leaps and bounds. This may go along with the language progress, but we are having more problems with kids \"getting into things\".  It's mostly B., and it's mostly getting into the bathroom, to be specific.  In the last three days I have found him sitting on the edge of the toilet with his feet in the water, another time on the counter with his feet in the sink, and (this is a new one), standing in the bathroom sink, looking in the mirror. Of course, the simple answer is to keep the bathroom closed, but in our house we don't always manage it (think four year old brother, and forty-something scatter-brained mom). He is also very interested in toothpaste, toothbrushes, markers, pens, and crayons, and any container of liquid he can get his hands on. I was chatting with a neighbor the other day, and B. lay down on his tummy to drink out of a puddle. In the blogs I read, I don't notice a lot of descriptions of these kinds of escapades. I'm sure they must be going on in many homes, but maybe those moms have trouble getting to the computer to blog. Most of the time, B. is just so darned cute that these things seem funny (although the germiness factor is troubling).  If any of the three or so people who read this blog have been through this stage and come out the other side, I'd love to hear about it!\n \n ", "outgoing_links": ["http://bp3.blogger.com/_ccuTsPgAAcc/SG2KybCjP-I/AAAAAAAAAPg/TYiwzSkRJCo/s1600-h/DSCN2626.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/07/staying-busy.html", "title": "\nStaying Busy\n"},
{"date": "Wednesday, July 23, 2008", "body": "\nTomorrow we;re doing it again: flying from Texas to New York.  We have a laptop, a portable DVD player and an iPod, so I'm hopeful that the flight will go smoothly.  The hardest time is sitting in our seats, waiting for the plane to get moving.  I bought out the Baby-Einstein themed chew toys at Target for B.  For G., I printed out pictures of the Wiggles, Barney, Pingu, Bob the Builder and a few other characters and covered them with packing-tape (poor man's lamination).  J. should be fine with Spiderman, Batman and a contingent of ocean animals. Judging from last time, my role will be crawling around on the floor of the plane, retrieving things. My father-in-law recently had surgery for intestinal cancer, and is recovering in a nursing home.  We are hoping to cheer him up with our energetic (chaotic) presence. G. is in an interesting period-- he does not want to pee or poop in a diaper, but has zero interest in the potty.  Our carpet is not doing well. My mother-in-law has had four kids and a bunch of grandkids, so she's already seen it all, I'm hoping.  We're going to meet up with my parents at a state park for a picnic one day. I can't wait! Last time I talked to them they had been on a tour of a retirement village, the kind which includes assisted living and a nursing home.  My dad was concerned that there was nowhere to store his canoes and bicycles. Things are always changing, and I am still focusing on appreciating each day and its little miracles. \n \n ", "outgoing_links": ["http://bp1.blogger.com/_ccuTsPgAAcc/SIeettNqrNI/AAAAAAAAAPo/vko_e2NF9Ic/s1600-h/DSCN2578.JPG", "http://bp0.blogger.com/_ccuTsPgAAcc/SIehDnzlIkI/AAAAAAAAAPw/iKXMAdZX1WA/s1600-h/DSCN2624.JPG"], "link": "http://hoopdeedoo.blogspot.com/2008/07/taking-to-air-again.html", "title": "\nTaking to the air again!\n"},
{"date": "Tuesday, July 14, 2009", "body": "\n Back when he was only two, B was fascinated by letters, and would sit with alphabet blocks, quietly naming the letters to himself.  Since then he hasn't shown as much interest, but in the past week he's fallen in love with an alphabet toy we've had for over a year.  Yesterday morning he woke up calling out \"Q!  Q!\", followed by wild laughter.  I'm so happy to see him playing with a toy. \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/Slz48SX0jJI/AAAAAAAAAaM/2V07StBbbYQ/s1600-h/DSCN3862.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/Slz4uhaVPhI/AAAAAAAAAaE/ZoCXqxdp_aI/s1600-h/DSCN3857.JPG"], "link": "http://hoopdeedoo.blogspot.com/2009/07/b-and-his-laptop.html", "title": "\nB. and his Laptop\n"},
{"date": "Monday, April 6, 2009", "body": "\nFirst of all, a picture of J. and his best friend-- also adopted internationally, and every bit as silly as J. My last post summed up how I feel at many times...overwhelmed and hoping for some kind of a break.  Tonight I'm feeling more positive, probably because I've gotten out of the house quite a lot in the last week.  Friday night I played Bunco (or Bonko, as J. refers to it, which I prefer) and this evening I went to hear a speaker on parent advocacy. It was my second time subbing with this Bonko group, and I'm glad I gave it another chance.  Last time I was very, very sleep-deprived, to the point where even the mindless game of Bunko seemed too hard to follow.  This time I was only tired to the point of silly goofiness, so It worked out better.  I did not talk about autism for the entire evening, and I think that was really good for me.   Having my younger sister visit was also a wonderful break.  We took the kids to the Houston Livestock Show and Rodeo (not the rodeo part).  There were all sorts of animals, but the most popular events with the boys were sitting in new Ford pick-ups, and riding the merry-go-round.  Hooray for sisters who visit even when you move all the way across the country!! My other sister is planning a visit in August, so there is another glimmer of hope for  my sanity.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/SdrBGGgdIHI/AAAAAAAAAZk/uVsbOC5rh70/s1600-h/DSCN3656.JPG"], "link": "http://hoopdeedoo.blogspot.com/2009/04/calmer-times.html", "title": "\nCalmer Times\n"},
{"date": "Tuesday, January 12, 2010", "body": "\n I don't know if I've mentioned this, but since Thanksgiving (well, that was the SeaWorld trip, and I haven't posted since then!), B. has been singing up a storm.  At first it was Christmas songs.  Frosty, Rudolph, and according to his therapists, even George Michael's \"Last Christmas, I gave you my heart\". Now it's anyone's guess what he'll be singing.  Yesterday, on a whim I had put a Signing Time CD in the car, and we were on the song I quote in my blog's sidebar, \"Maybe we won't find easy, but baby we found the good\".  That song was such a tear-jerker for me, but I actually have come to dislike it.  It reminds me of the hardest time so far in my life, the year or so after I realized the twins had autism  and was floundering around about how to help. So we had arrived at the clinic where the twins had an appointment, and I turned off the car.  From the back seat I heard B's voice singing \"My hands did so MUCH MORE\" very loudly and clearly.  It still startles me to hear him singing sometimes, and this one really got me.  I never listen to Signing Time music any more, so he was remembering it from back then.  Back when I wondered what he could take in, and what he was getting out of all our attempts to connect.  He can remember the lyrics to a song from when he was two!  To be honest, he's must have heard it a few times since then, but not much.   The twins really boggle my mind... there are so many basic things that are so hard for them, but then they come out with these wonderful surprises.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/S0yz1GoL5HI/AAAAAAAAAaU/LZ-aTxOdQPU/s1600-h/DSCN4043.JPG"], "link": "http://hoopdeedoo.blogspot.com/2010/01/singing.html", "title": "\nSinging\n"},
{"date": "Monday, November 8, 2010", "body": "\n Wonder why parents in Texas don't demand better services? \n \n ", "outgoing_links": ["http://www.myfoxhouston.com/dpp/news/local/101005-school-district-seeks-to-bankrupt-disabled-students-family?obref=obinsite", "http://www.myfoxhouston.com/dpp/news/local/101005-school-district-seeks-to-bankrupt-disabled-students-family?obref=obinsite"], "link": "http://hoopdeedoo.blogspot.com/2010/11/wonder-why-parents-in-texas-dont-demand.html", "title": "\nSchool district sues special needs family\n"},
{"date": "Thursday, March 18, 2010", "body": "\nWe are still here... spending a lot of time doing potty related things.  Also expanding our food repertoire (!)  Grapes, rigatoni, baby spinach.   B. is still singing a lot, and occasionally coming out with a phrase, which is always a shock. We finally got rid of G's orange sippy cup, which is making for a lot of milk puddles, but I think it's worth it. If I could get him to drink out of a straw, we'd really be sitting pretty in the drink department. Ordered a big (twin sized) bed tent... hope it works because they are about to burst out of their cribs. G. knocked over our Imac and made it un-useable.  Hoping we can recover the hard drive with all of our photos! J. is six now and seems like a little grown up to me sometimes.  He does my \"Dancing with the Stars\" Latin Cardio work out with me.  He is also going through an intense Junie B. Jones obsession.  Not your typical kindergarten boy, but always entertaining.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/03/we-are-still-here.html", "title": ""},
{"date": "Tuesday, December 1, 2009", "body": "\nFirst of all, I would like to thank my sister, Riley, for making our Thanksgiving vacation imaginable, and then making it a great success.  It was our first trip that was not a visit to relatives or a hurricane evacuation.  We drove about four hours to San Antonio, stayed in a family-friendly Hilton, and spent a day at SeaWorld. The twins get so loud at night at home that I couldn't imagine staying in a hotel with them.  I figured worse come to worse, I would drive them around in the van if necessary.  But zipping them into individual tents and putting a DVD on \"repeat play\" did the trick.  There was a lot of quiet singing, but nothing that would disturb anyone. The first day was a little tough with B., who was very excited about the Christmas tree in the lobby, and did a total flop on the floor and kept \"combat crawling\" back towards it as I tried to drag him away.  When he did get to it, he was very fast about taking glittery ornaments off and chewing on them. My sister was good at quickly child-proofing the hotel room, which mostly meant putting almost everything on top of the TV cabinet.  I was happy to find that the Hilton securely bolts all of the artwork to the wall.  G. was entertained for a long time by washing his hands in the bathroom sink and even said \"Wash hands\" over and over to himself.   It was only after a while that I realized he was also washing his hands in the toilet bowl.  The big hit, other than Sea World itself, were the outdoor heated pools.  Not many people braved them, but we really got our money's worth. At night the hotel lit a bunch of outdoor fire pits and many kids were out there roasting marshmallows (we didn't include the twins on that one).  SeaWorld was interesting, uncrowded and pretty well-designed for a family with two giant jogging strollers.  They have a huge playground with climbing nets, a pirate ship and big slides.  The boys, Dad and my sister loved it, but I have to admit it gave me vertigo.  I thought I might have to be rescued off of one of the big nets.  Maybe I'll write more about the vacation later, but I've got to go.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2009/12/best-vacation-ever.html", "title": "\nBest Vacation Ever!\n"},
{"date": "Friday, September 3, 2010", "body": "\nAfter a slow start, I've been getting a lot of communication from Greg's new teacher.  Not only can they get him to do work, they don't even have to use re-inforcers.  What??  The main problem seems to be his \"flopping\" as she calls it, so they have him help with lots of errands.  I wish I could be a fly on the wall.  Oh, and the other problem is that he falls asleep in the afternoons.  Maybe all the errands wear him out. Now I'm off to have lunch in the school cafeteria with J (big brother).  It's funny, because he doesn't talk much to me when I'm there, but it makes him SO happy when I show up to eat with him.  Simple pleasures (except for the actual food they serve).\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/09/hooray-for-good-teachers-and-off-for.html", "title": "\nHooray for good teachers and off for a lunch date\n"},
{"date": "Sunday, May 24, 2009", "body": "\n I haven't written a blog post since April?? What's been going on?  I have been lurking a lot, but not even commenting much. One thing has been that B. can now scale anything, and also get himself back down.  Unfortunately his preferred way of descending tends to be head first. Luckily, a slow, controlled headfirst descent.  Our child-proofing has not kept up with his leap in gross motor skills, hence the lack of blogging. Then I went through a very, very anxious stage, which included worse than usual insomnia (and I am a dyed-in-the-wool life=long insomniac).  Not a good combination.  I think it was the end of the school year, combined with early peri-menopause, but I still don't really know what was happening. Things are better now, well, the climbing isn't better, but I'm getting used to it. J. is registered for kindergarten, and is taking swimming lessons--something I've been trying to get to for a long time. G. is his usual self, and seems to be learning to read a lot of sight words.  He's been getting more affectionate lately, in the form of pressing his forehead into mine and touching my face.  Sometimes he smells me, too, which I like to think of as an expression of affection.  It feels like it to me. So if I can keep the anxiety at bay, things are going fairly well. \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/Shn1N1xE_xI/AAAAAAAAAZ8/ZOGKBIKhVEc/s1600-h/DSCN3713.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/Shn0xyOrj0I/AAAAAAAAAZ0/g_aFPtrRy9k/s1600-h/DSCN3748.JPG", "http://2.bp.blogspot.com/_ccuTsPgAAcc/Shn0We6xvnI/AAAAAAAAAZs/H00JreSDt9I/s1600-h/DSCN3792.JPG"], "link": "http://hoopdeedoo.blogspot.com/2009/05/update.html", "title": "\nUpdate\n"},
{"date": "Monday, September 13, 2010", "body": "\nThings continue to go well at school, and they've even added an aide without my requesting one (!)  We ran into her in the public library this weekend, and she seems very nice.   The only remarkable thing about today was an unfortunate poop-ocalypse, as my husband would call it.  It started out so sweet, with B. coming all the way downstairs to hand me a little CD player, with the nicest smile. He has been getting more assertive about requesting things, so I was tickled.  Then I thought to myself, what is that on the tip of his nose?, and it was downhill from there.  I felt bad that he looked so crestfallen as I cleaned him and many other things up.  That is one pair of Transformers underwear which he will never wear again! This is too much information, but my husband is out of town, and I am tired and the boys keep waking up at 4 AM.  On the other hand, it was his first accident of the day, and what's a little--okay, a whole lot-- of poop when other things are going well?\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/09/things-continue-to-go-well-at-school.html", "title": ""},
{"date": "Tuesday, November 3, 2009", "body": "\nI have not intentionally given up blogging.  We are simply at a point where living our lives is taking up all of our energy.  There is progress going on, and there is also a lot of poop, peanut butter, toothpaste, urine and other stuff to clean up.  We are having lots of fun in general, but it's a very energetic type of fun!  Lots of chasing boys across soccer fields, through Target, and so forth. I always wondered what would happen when they got too big for strollers and shopping carts and now I know.  I like to think my cardio vascular health must be getting great. Hope to return to blogging before too long.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2009/11/to-blog-or-not-to-blog.html", "title": "\nTo blog or not to blog\n"},
{"date": "Sunday, October 24, 2010", "body": "\nI have to get a movie of this following, but taking movies is not my thing.  B. just figured out how to turn on the spray nozzle attachment on the garden hose.  I set it on \"mist\" and he tries to drink it. Today, every once in a while, he would turn it on and say, \"Ah-choo!\"  It was the funniest thing.  I've only heard him say \"ah-choo\" one other time, when he had just sneezed.  When they hardly ever say things spontaneously, it always seems so surreal when they do! The other thing, cute but also downright amazing, was that yesterday I'm almost certain he said, \"Juice box empty\".  An adjective!  An adjective that hasn't been on Signing Time or Baby Einstein or anything!!  Just have to brag, when you get a chance.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/10/file-under-cuteness.html", "title": "\nFile under cuteness\n"},
{"date": "Wednesday, September 15, 2010", "body": "\n Last night was G's Open House at school.  We were the only family who showed up for his special needs class (\"Alternative Academics\"), and I imagine it was enough for the teacher.  B. explored the room thoroughly, pried some circles up which were taped to the floor, sucked red paint off of a paintbrush and generally made himself at home.  He may join this class in January, which I hope, hope, hope and pray will go better than his last try at school (lots of crying and previously un-seen aggression). Also in the picture is our life-saving helper who has been with us since the twins were six months old.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_ccuTsPgAAcc/TJDnNhjNIkI/AAAAAAAAAbE/0AuiI6wzy-U/s1600/school+Sept+2010+023.jpg"], "link": "http://hoopdeedoo.blogspot.com/2010/09/open-house.html", "title": "\nOpen House\n"},
{"date": "Wednesday, August 18, 2010", "body": "\nB, the much more silent one of the twins, has surprised us a couple of times this summer by saying \"Bless you!\" when someone sneezes. One time he even said it to me after I handed him a cup of milk. Of course, this leads to everyone fake sneezing in hopes of him saying it again. As convincing as we think we are, we have not fooled him once.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/08/gesundheit.html", "title": "\nGesundheit\n"},
{"date": "Friday, October 22, 2010", "body": "\n First the good:  J. is now riding his bike with no training wheels!  It makes me so sentimental watching him.  His bony legs stick out to the side, and he sits up so tall.  You can just feel the pride coming out of him. He's also enjoying karate-- his teacher is a wonderful, patient man. And for the not-so-good:  Despite the new, oh-so-promising teacher, G. seems completely stressed out by his self-contained kindergarten.  He has started the angry pinching which B. used to do during his brief stint in public school This class, or one just like it, is all our district offers.  I'm thinking maybe the boys can go to school in the morning, and I'll home-school in the afternoon.  G's teacher says he spends a lot of time covering his eyes or his ears, and just recently, pinching the teachers. Maybe he'll adjust? Now, back to the good: B. is still singing up a storm.  Recently it's been a lot of Christmas songs, with a few counting songs mixed in (Five Little Ducks, Five Elephants, etc).  He is so sweet doing it that I can't resist putting on a Christmas CD in the car.  It's been in the upper eighties, but B. and I are driving along singing \"Simply Having a Wonderful Christmas Time\".  Works for us!\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/TMJmG1W_9pI/AAAAAAAAAbY/RM3pEM4LZ_k/s1600/DSCN4401.JPG"], "link": "http://hoopdeedoo.blogspot.com/2010/10/good-bad-etc-etc.html", "title": "\nThe good, the bad, etc., etc.\n"},
{"date": "Monday, August 23, 2010", "body": "\nFor the last two years, I have pleaded for a \"daily note\" from the special ed. teacher, letting me know what and how G. does at school. I did finally get one for about three and a half months, although other kids in the class never did. Well, this year, I get a taste of my own medicine. The special ed teacher this year is very organized.  Every morning I have to fill out a form stating how many hours G slept, what and how much he had for breakfast, and choose from a checklist of about ten moods to describe his early morning behavior.  There is an \"other\" category, so I'm entertaining myself thinking up more moods I could fill in.  \"disaffected\", \"optimistic, but  with a twinge of foreboding\", etc. But, seriously, I am in awe of this woman and can't believe she works for the same district as G's previous teacher. Although, for her comment yesterday, she just wrote, \"G. is adjusting to kindergarten\", which is kind of mysterious.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/08/tables-are-turned.html", "title": "\nThe tables are turned!\n"},
{"date": "Monday, August 16, 2010", "body": "\nGreg will be heading off to Kindergarten (\"Alternative Academics\"--self-contained) next week. So far, the teacher is the polar opposite of the woman he has had for the last two years.  This wonderful teacher emailed and then snail-mailed a social story with photographs of the new school and his classmates.  She sent home two long forms for me to fill out about how he learns, what he likes, etc.  I actually feel teary thinking about this.  I've sat in so many meetings trying to explain how he learns and what motivates him, and finally the teacher is actually interested, and even asking me for more detail.   We visited the school last week, and he skipped around taking in all the bulletin boards, alphabet displays,  and so on.  I almost had to physically drag him out of the library. When we got to the door of his room I told him, \"This will be your classroom this year\" and he quietly said, \"Bye-bye\".  I think he was telling me I could go, but it might have been that he was ready for us both to leave.  In any case, he was very interested in seeing the whole school and especially his room.  Mrs. K., the new teacher, asked me all kinds of questions about him, and seemed entertained by him in the way that a proud, nervous mom wants a teacher to be. So I'm cautiously optimistic... I'm sure the year will hold its challenges.  But It's so good to be feeling a little hum of hope about school this time around.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/08/new-teacher-and-some-exciting-signs-of.html", "title": "\nA new teacher and some exciting signs of hope\n"},
{"date": "Sunday, July 25, 2010", "body": "\nI had written a longer version of this post, but managed to destroy it somehow. The upshot is, yesterday I think i heard G. say an original sentence-type of thing.  He can memorize sections of Bob the Builder episodes and reel them off with impressive feeling, but otherwise he is very stubborn about sticking to the shortest phrase possible. After a trip to the pool, when he thought I was trying to sneak back out the door (I was actually trying to gather the pile of swim noodles and inflatable pool things we'd dropped in the driveway), G grabbed my arm and said, \"Come together...(long pause)...IN!\" So, unless he's been listening to the Beatles, he made a sentence!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/07/did-he-just-say-that.html", "title": "\nDid he just say that?\n"},
{"date": "Sunday, July 25, 2010", "body": "\nI just read the news story about the Irving, TX woman who took the lives of her two autistic children.  It's so sad... i assume she had underlying psychiatric problems already, but I can't help wonder how much sleep she was getting, how much she could get out of the house and how isolated she was.  I don't mean to make excuses for her-- it's a terrible tragedy and I wish it could have somehow been prevented. Meanwhile I feel so thankful for the support we get from so many wonderful people.  First and foremost, our extended family, and also all sorts of friends, therapists and even casual acquaintances.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/07/sad-news-from-irving-tx.html", "title": "\nSad news from Irving, TX\n"},
{"date": "Friday, November 19, 2010", "body": "\nWe have a new IPad and we are loving it!  Both twins can use it, although it's a little easier for G. than B., as far as I can tell. Met with the school psychologist today, and she is going to look into a grant that might give them some IPad funds. I enjoy watching the kids use the IPad, but so far the only app I've used much is an Air Hockey game.  I play it on the kiddie level, when I try to move up to the \"Easy\" level, I lose very, very fast.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/11/ipad.html", "title": "\nIPad!\n"},
{"date": "Tuesday, August 24, 2010", "body": "\nToday's comment from the possibly-very-good teacher was, \"Today Greg did not want to come into the classroom.  He got off the bus, but sat down in the hall outside the room.  He stayed with the group more today\".  I'm staying positive, I'm staying positive, I'm staying positive.  It's not that I mind that he sat down in the hall, it's just that I'd think maybe something good and worth mentioning happened.  Something a little more inspiring than staying with the group more. I didn't know what to think of this, so emailed the teacher to ask for more details.  Haven't heard back, but at about 5:00 I realized G. had a fever of 101 degrees!  I have to admit, I selfishly thought \"Ooh, I get to have him home tomorrow\" Meanwhile, B. had ABA in the morning, and then we mall-walked to escape the heat.  As usual, we made many side trips into stores selling sparkly or metallic things.  We had a fun, psychedelic time in Spencer Gifts looking at all the colored lights.\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/08/day-two.html", "title": "\nDay Two\n"},
{"date": "Monday, July 12, 2010", "body": "\nFor the first time this year, G. is going to ESY for six weeks.  His goals are things like taking off his shoes, walking from one activity to another, looking up from an activity when someone calls his name. Meanwhile at home he is reading sight words, memorizing Dr. Suess books and trying to order us around all day long. I've made some progress in recent IEP meetings, but I'm starting to think up a combination of public school and homeschooling that I believe could work.  This fall he will be in a self-contained class with kids with all sorts of disabilities (in this district, anyone who can't be mainstreamed is stuck into the same class together, no matter the disability) I like the teacher, but I still think the focus will be on functional skills, which G. is pretty bad at. They seem to get so stuck on things like taking off your shoes that they don't have time for reading, computer skills, etc. Meanwhile, B. is singing all day long, and actually talking a little less.  I think it'll sort itself out with time. At ABA he's working on letters and numbers and many other challenging things.  He's not going to public school until I get really organized and recruit a really good advocate! And J. is as social as ever.  I feel like his personal assistant, setting up playdates and pool get-togethers every day!\n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/07/brainstorming-school-ideas.html", "title": "\nBrainstorming school ideas\n"},
{"date": "Sunday, November 7, 2010", "body": "\n \n \n ", "outgoing_links": [], "link": "http://hoopdeedoo.blogspot.com/2010/11/blog-post.html", "title": ""},
{"date": "Tuesday, November 9, 2010", "body": "\n Things are going better at school.  I don't know why, but he's not screaming, not scratching, and back to his smiling self. Phew. Also, he counted to 25 on an abacus yesterday.  That's the kind of note a mom wants to get from school!\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/_ccuTsPgAAcc/TNlviUaDnNI/AAAAAAAAAbg/o9xFmLi5Fqw/s1600/DSCN4413.JPG"], "link": "http://hoopdeedoo.blogspot.com/2010/11/things-are-going-better-at-school.html", "title": "\nTime to relax\n"},
{"date": "Wednesday, July 21, 2010", "body": "\nHere's one of my first attempts: \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/TEcYEg8pd9I/AAAAAAAAAas/lKzEWLSMdG4/s1600/DSCN4285.JPG"], "link": "http://hoopdeedoo.blogspot.com/2010/07/resolving-to-take-more-pictures.html", "title": "\nResolving to take more pictures\n"},
{"date": "Friday, May 7, 2010", "body": "\n J. is wrapping up his kindergarten year.  It's hard for me to imagine I'll be the mom of a first-grader and two kindergarteners next year.  That is, if we put B. back in public school.  I have a good feeling about the self-contained class' teacher, so it just may happen. One thing that is keeping me (close-to) sane this spring has been gardening.  My focus is on non-toxic plants, due to our Pica issues.  G. in particular sees the backyard as a grazing ground.  I've planted beans, sweet peppers, lettuce, thyme, basil, mint and a jalapeno pepper plant  (if anyone reading this knows that one of these plants is actually toxic, let me know!).  The first day that my relatively huge basil plant was in the ground, every single leaf disappeared, and G. had unusually pungeant breath.  The plant survived and is putting out some new little leaves.  Maybe a wise metaphor is in there somewhere, but I'm too sleepy to try to nail it down. We are trying to go down to Galveston this weekend for some ocean swimming.  The boys are like little seals in the waves.  This time I'll bring life jackets for the twins, so we can relax a little more.  Last time I wouldn't let them get deeper than six inches or so.  So sad about the oil spill.  I hope that the attempt to cap the well works.\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_ccuTsPgAAcc/S-Tfi8xZrMI/AAAAAAAAAak/p8A5W06R948/s1600/DSCN4192.JPG", "http://3.bp.blogspot.com/_ccuTsPgAAcc/S-TfTOP8HYI/AAAAAAAAAac/dGW1ioxsNFU/s1600/DSCN4235.JPG"], "link": "http://hoopdeedoo.blogspot.com/2010/05/spring.html", "title": "\nSpring\n"},
{"date": "Wednesday, July 18, 2007", "body": "\nEight random things...how hard could it be?  But this meme is giving me writer's block. I was tagged by Niksmom of Maternal Instincts...Flying by the Seat of my Pants http://maternal-instincts.blogspot.com/  1. I had given up on having biological kids when I had the unbelievable good fortune of becoming pregnant with the twins.  We were in the midst of adopting J., and I was thrilled to death about getting his referral.  Getting pregnant was not the plan, and threw me into turmoil (and that was before I knew it was two!!) It has all turned out wonderfully, if totally nuts.   2. I started college as a German Literature major (!?), graduated as an English major, but have spent my whole career teaching young children.  I finished my masters in Special Ed. five years before I had kids. 3. For the last week, I think a third of my caloric intake has been Golden Oreos.  I keep buying them because they are a great reinforcer for ABA (or so I say) 4. My favorite place in the world is anywhere on the New England coastline.   5. During the evacuation for Hurricane Rita, we spent 25 hours in the van, with three boys under two and a dog, driving to Austin, which is usually under four hours.  In Austin, we stayed with a fantastic family who were great with the boys, and who have a huge collection of Brio trains.   6. If I could start a business, I'd have a coffehouse/bookstore, with readings or live music in the evenings. 7. I love to watch travel shows, but I'm not crazy about traveling.  Going to Nova Scotia, which I love,  is a big deal for me. 8. My husband and I lived in the same city for years, and went to some of the same watering holes, but were introduced by a friend when I lived in Massachusetts and he lived in Maryland. We had a long-distance romance, and bonded by discussing the first season of Survivor by phone. I have to find eight bloggers who haven't already done this meme, and then I'll do the tagging part!\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_ccuTsPgAAcc/Rp6C92B9OUI/AAAAAAAAACk/ZBkLaD9c93M/s1600-h/DSCN1006.JPG"], "link": "http://hoopdeedoo.blogspot.com/2007/07/random-things-meme.html", "title": "\nRandom Things Meme\n"}
]