[
{"date": "December 12, 2011", "body": "This is a post of short, housekeeping things that are not enough for posts in and of themselves but together form one thing. It is not an essay.So!I haven’t really written anything since October. This is because I am Autistic, and I am inconsistent and cannot communicate on anyone else’s schedule–or even one of my own. I do have some essays planned to finish and go up soon. I actually have dozens of drafts on my computer, ranging from the rest of Metaphors Are Important to whole new series and a bunch of other things. But they aren’t ready yet, and that’s okay.I say “that’s okay,” mostly to remind myself. I have a lot of anxiety surrounding my writing, and in particular this site.Which brings me to my next item of business…I cannot usually answer comments. It’s in part an access issue, as well as a matter of anxiety, discipline, and time, and it’s also a protective mechanism–my language isn’t the best for brief comments, and I have no desire to start a comment war. It’s my general internet policy, which I try to follow with varying degrees of success. I have similar issues answering emails. I wasn’t going to ever explicitly state this, but it turns out that just because I’m not writing doesn’t mean people aren’t reading, and since Quiet Hands (and more recently, Obsessive Joy) exploded, I’ve gotten more comments than I ever thought this blog would see.A lot of those comments have made me cry, as much as the attention has made me want to run away. I am planning on posting a more specific response tomorrow, but for now I just want to say thank you. Thank you. Thank you for reading, thank you for listening, thank you for taking action, and thank you for letting me know that all three of those happened. I cherish your comments.In the interest of directing you to something similar to read, an idea that needs to go viral, I’d like to link you to The Unbroken Spectrum: Stockholm Syndrome, over at Shift Journal. I did not write it. It’s important.I’ve been working on several projects since October, all related in odd ways, which you can expect to hear more about soon.I also participated in ASAN’s ELSI  symposium at Harvard Law this weekend, which was fantastic. I don’t have words for this experience, and I don’t know that I ever will, beyond too much excitement and optimism to be contained.  I’ll link to the youtubes when they are available. I spoke briefly about the gap between theory/law and what actually happens to autistic people. I actually spoke much more briefly than I would have liked, since my vision cut out about halfway through my response and I could no longer read what I’d scripted out. Perils of being a self-advocate.And that’s what you’ve missed since October! Hopefully things will be back to normal here tomorrow. Thanks for bearing with me.", "outgoing_links": ["http://www.shiftjournal.com/2010/06/25/the-unbroken-spectrum-stockholm-syndrome/"], "link": "https://juststimming.wordpress.com/2011/12/12/stuff-and-also-things/", "title": "Stuff And Also Things"},
{"date": "December 26, 2011", "body": "\n\nSo I’ve been busy.\nINTRODUCING: The Loud Hands Project.\nOur Story:\nThe Loud Hands Project is a publishing effort by the Autistic Self Advocacy Network. Currently, we are raising money towards the creation of our first and foundational anthology (Loud Hands: Autistic People, Speaking) and accompanying website.\nLoud Hands: Autistic People, Speaking features essays, long and short, by Autistic authors writing on autism acceptance, neurodiversity, Autistic pride and culture, disability rights and resistance, and resilience (known collectively by the community as having loud hands). Questions posed to the contributors might include what does autism mean to you; why does Autistic culture matter; what do you wish you had known growing up Autistic; how can the Autistic community cultivate resilience; what does “loud hands” mean to you; and how do you have loud hands? The anthology is the first of a projected series featuring contributions from Autistic writers stressing the preservation and celebration of Autistic culture and resilience. The website will host shorter and multi-media submissions along the same lines, along with additional materials and videos, and serve as a focal point for the project and community.\nOur Impact:\nThe Loud Hands Project is about survival, resilience, and pride. The Loud Hands Project is necessary because autistic youth face systematic oppression, abuse, and bullying every day. It does not “get better” for us—typically, upon graduation, it actually gets worse. This must change.\nThe Loud Hands Project is a structured, multi-facetted response by the Autistic community to the systematic disenfranchisement, bullying, and abuse experienced by autistic youth, young adults, and self advocates. Taking the form of a publishing effort by the Autistic Self Advocacy Network and spearheaded by Julia Bascom, The Loud Hands Project consists of multiple prongs organized around the theme of what the Autistic community refers to as “having loud hands”—autism acceptance, neurodiversity, Autistic pride, community, and culture, disability rights and resistance, and resilience.  We focus on cultivating resilience among autistic young people and empowering us in building communities and cultures of ability, resistance, and worth. To quote Laura Hershey: “you weren’t the one who made you ashamed, but you are the one who can make you proud.”\nHow You Can Help:\nWe need to raise ten thousand dollars ($10,000) to help cover the initial costs of putting together and distributing our first anthology and launching our website. Please consider making a donation here—every little bit helps!\nSpread the word! Check out the share tools on our page, and please use them! You can visit our Facebook page, tumblr, and twitter too, and tweet about the project using the hashtag #loudhandsproject.\n\n", "outgoing_links": ["http://www.indiegogo.com/The-Loud-Hands-Project?a=351448", "http://www.autisticadvocacy.org/", "http://www.indiegogo.com/The-Loud-Hands-Project?a=351448", "http://www.facebook.com/pages/The-Loud-Hands-Project/111548155631555", "http://theloudhandsproject.tumblr.com/", "http://twitter.com/#!/loud_hands"], "link": "https://juststimming.wordpress.com/2011/12/26/the-loud-hands-project/", "title": "The Loud Hands Project"},
{"date": "March 4, 2012", "body": "The thing about not-being-a-person is:They will say those people and the price of being a person is to nod and agree that yes, those people aren’t people at all.They will have no idea who they are talking to.You yourself will start to forget, too.They will say a million small things that sow the seeds for violence done against you, and you will smile and let them.You will do math, constantly. How much do I want to be a person today? How much do I want this project to succeed? How much honesty can I afford? How much dishonesty will kill me? What is the cost of coming out? Is there a way to delay, soften, transmute? How long can I survive as half a person? Your dreams will be reduced down to breathing.And you will be grateful.And no one else will know. And so it won’t be real.You will become an expert at folding away pieces of yourself, quietly and automatically and with perfect obedience. And you will forget that, forget all of it, forget yourself, and then come back to yourself violently as someone smiles and talks, academically or hatefully and there’s no deciding which is worse, about those people.And you will remember that you are not a person. And you will have to decide, all over again, how much longer you can take that.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2012/03/04/your-dreams-will-be-reduced-down-to-breathing-and-you-will-be-grateful/", "title": "your dreams will be reduced down to breathing, and you will be grateful"},
{"date": "February 16, 2012", "body": "First, a story. (A little Christmas story. I call it: the story of Schmuel. Tailor of Klimovitch.)*****\n(The best part of the story is what I leave out.)\n*****\nI met a mini!Kurt the other day. He was very blonde, with intense brown eyes, but he was very particular about his hat, and his dad was Burt Hummel in all the ways that counted. I’d guess he was about four–his voice was still all exclamation points.“I’M MATT!” he said, hiding his face from me, and then trying to run out of the waiting room. It was cool though–I don’t know if I even managed ahi.He was at the stage where he was still mainly echolalic, but he was learning how to store and recombine and modify phrases to work for him. I was excited for him, and almost proud, because he’d mastered two essential skills for that–swapping pronouns, and prompting other people to remember their lines. His dad, trying to bundle him into his coat, was not playing along at first.“I’M SO CUTE!” mini!Kurt reminded him, trying to make his arms go into the right sleeves. “I’M SO CUTE!? I’M SO CUTE?”“Yeah,” Dad sighed, wrestling with the zipper. “You’re cute.”“SO CUTE?”“So cute, that’s right.”Mini!Kurt, satisfied that everything was going according to plan, was ready to leave. “BYE!” he called, waving his hand backwards at me, a perfect mirror image.I waved. Had my mind been more together, I would have flapped.\n*****\nEcholalia is metalanguage.*****\nEcholalia is an unexpected treasure hunt. You can be watching a bootleg musical you never thought would be any good, but turns out to be beautiful, and suddenly they’re going up the scale singing hot hot hot hot, and you’re back with Kimba, and he’s saying hot hot hot hot–only he’s got this elaborate metaphor about fire and anger going on right now, and here it means I think you’re mad at me, so I’m mad at you, don’t touch me. \nAnd then you’re back at your laptop, wondering when he started watching musicals and rethinking half the things you thought you knew.*****\nEcholalia is what you use when language is too much. It’s just also what you use when it’s not enough.\nThese things are not opposites.\n*****\nWalt knows my name, but he’d rather call me Mulan. We’re on the swings, trading movie titles.“101 Dalmations?” I offer.“Mulan no thank you!” He chides. Considers. “Rio, with Jesse Eisenberg?”I grin. I’d only said that once, but he’d picked up on my crush, and he offers it back to me when I am having a hard time with the conversation. I try to remember his favorite, as a peace offering. “Kung Fu Panda II, in theaters now?”I get it right.Months later, it will still be the best conversation of my life.*****\nEcholalia, from Echo, of Greek mythos, cursed to speak only through the words of others.\nWe make it work though.About the cursed: opinions aren’t the same as facts, and no one ever asked Echo.\nTo be fair, no one would have listened, either.\n*****\nAs much as I can hate words, I delight in them, too. When I’m echoing, referencing, scripting, riffing and rifting, storing and combing and recombining, patterning, quoting, punning, swinging from hyperlexic memory to synesthetic connection, words are my tangible playground.Make me talk like you, and you’ll get a bunch of syntactically sophisticated nonsense. Let me keep my memories and connections, my resonations and associations and word-pictures, and if you slow down enough, you might hear something ringing true.These are the words I’m using right now. It’s okay if you can’t see the picture yet; I can’t either. It’s coming together though, the more I practice them.Ethnography of robotics.Neuropoetics.Girls like you always get to see Ireland.Send my love to the leprechauns.Please don’t special-episode me.Why don’t you trust me? Because, honey, you keep setting things on fire.The first rule of tautology club is the first rule of tautology club.I think they might be four separate pieces. The joy is how they come together.The bestworst part is no one ever knowing.\n*****\n(The best part of the story is what I leave out.)\n*****\nI don’t trust my words on my own.\nThat’s not why I echo though.\nI know it’s tempting, but, listen.\n*****\n\nOr maybe I’m lying, because I’m not brave enough to explain.\nDon’t worry though. I know that Kimba loves musicals now, and Walt named me after a warrior.\nWe’ll get there.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2012/02/16/an-ethnography-of-robotics/", "title": "Metaphors Are Important: An Ethnography Of Robotics"},
{"date": "December 13, 2011", "body": "When I was a little girl, I was scared.That sentence has taken two months to write.When I was a little girl, I was scared.When I was a little girl, I was a lot of things. I was functionally blind, and other kids teased me about my huge, staring eyes. When I was a little girl, I was somber. When I was a little girl, I was remote. When I was a little girl, I was devout.When I was a little girl, I was scared, and I was alone.*****I don’t know how to tell you about growing up scared and alone, except that I don’t want to, and maybe that says enough. I can tell you, though, what changed. What changed is that I was fifteen, and I found this.I was fifteen, and I spent months circling Amanda Baggs’ site, skimming the front page (the background and url were different then,) afraid to click on any of the posts, testing and tasting the words autism and autistic and okay over and over in my mouth. I had found someone like me. I had found someone like me, and they were fine.It was months before I could look at this straight on, accept it, and click a post to read. Eventually I was brave.When I was fifteen, I stopped being alone.When I was fifteen, I stopped being alone, and that meant I could stop being scared.*****A little more than a month after I wrote Quiet Hands, I woke up and found that the number of hits on this site had erupted. Quiet Hands had gone viral, and there were a dozen comments waiting in moderation, links all over facebook, emails. I was bewildered–it was a stupid, personal post I’d written in the middle of the night to process a flashback a terrible character on a wonderful show had triggered–and overwhelmed by the attention. My friends can attest to my state that week–head-banging, bewildered William Schuester did something good by accident, obsessively relaying the ever-increasing hit-count as my words died out. I told one of them:\nThe irony in writing about what I write about is that you write about not-existing, and then you very suddenly exist.\nI’m not so good at handling that.\nBut as I adjusted, as I pieced together the history of what happened and approved comments and somehow, strangely, kept existing, I started being able to read what people were saying. I started getting emails from parents who wanted me to know that they’d brought the piece into IEP meetings and had it written into the IEP that their child would be allowed to stim and move, from parents who’d talked to their child and asked if this had happened to them, told them to come and tell if it ever did, from teachers who’d thrown away their Quiet Hands posters.I get a couple of these a week, now, and I’ve never been able to respond because I cry every time I read them.*****When I was a little girl, I wanted more than anything for someone to tell the loud, looming people to stop.*****(No one ever did.)*****There’s another class of responses I’ve gotten. Autistic people, writing in. Sometimes only a word, a word scraped out and bled through with meaning I understand and never will be able not to.Yes.*****Thank you. In my school, it was “sit on your hands.”You remind me I’m a person.I feel a little less alone.******I see another little girl, flapping in the pharmacy.Raising my arms comes a little easier, every time.\n\t\t", "outgoing_links": ["http://ballastexistenz.wordpress.com/"], "link": "https://juststimming.wordpress.com/2011/12/13/response/", "title": "Response"},
{"date": "October 14, 2011", "body": "\n“I’m in a wheelchair, but I’m still a guy.”First, an awkwardly personal moment.Several months ago, I was outed by another teacher to several speech pathologists at work. One of the women was completing her practicum, and her supervisor and instructor were observing her session with our pupil. I was there to keep him calm, as being watched by five or six teachers as you complete a speech exercise when you are working through selective mutism can be rather stressful. I wasn’t doing anything to draw attention to myself, just sitting nearby and redirecting or reassuring him when he needed it. I was dressed appropriately; I made sure to sit just like the women around me; I kept out of their conversation but smiled and nodded and was polite and quiet. I’m not sure exactly when it was that I made my fatal mistake. I kept my hands in my lap, but it might have been when I answered a question about his AAC device a little too knowledgeably or with a little too much enthusiasm. Perhaps it was when I noticed the tightening of his movements and suggested he have a quick break. Either way, eventually one of the women wanted to know what my job was, exactly. “Oh, she’s our intern,” the teacher said, and I smiled and nodded and then she kept talking. “She’s like our translator for half these kids. She has a really unique understanding–she’s also autistic, like them.”And I was out.It’s not the kind of outing you were expecting, was it?Would you believe me that it was more terrifying, more humiliating, with worse consequences than when I was outed as a lesbian in that room earlier that year?That’s one anecdote. Here’s another.As a simultaneously queer and developmentally disabled fan, one of my great struggles last season was watching the ship wars between Brittana and Bartie fans. There weren’t a whole lot of Bartie fans in the first place, and I quickly figured out that, as a lesbian, I was supposed to ship Brittana. It was practically compulsory. Their relationship was groundbreaking and I was supposed to be excited and moved and relate to it and no, no one wanted to hear my thoughts or see my excitement on seeing a couple with disabilities navigating high school together. Who cared?I wanted to know why only one story, one half of myself, counted. No one could explain.A third story, and then to the point. Perhaps you can see it already.I went to a college, for a while, infamous for its lesbians. I’m sure there’s a more decorous way to put it; I never cared to learn. It was a completely and utterly different world from the one I grew up in, and I loved every last queer second of it. Finally, being a lesbian wasn’t an issue!Having disabilities still was.I mean, how was anyone supposed to navigate a relationship with someone who didn’t like to talk, who sometimes couldn’t, who wore massive noise-blocking headphones at dinner and who couldn’t manage parties or groups of people or sometimes even just one person? What were the rules for that? Did that even happen? How do you flirt with someone who won’t make eye contact?It’s important that I am very clear here. It’s not that my classmates were horrible people. It’s not that at all. With few exceptions they were nothing but kind–and that’s a loaded phrase, but there’s not time for it here–and universally they did know how to relate to someone who could geek out about the neuroscience (and cognitive science, and philosophy) of vision, who could help with their linguistics homework or sing along to Last Friday Night or mix screwdrivers with alchemical precision. They just didn’t know what to do when that person wore glasses because she’d damaged her eyes banging her head repeatedly against walls, or who sometimes needed to pause in the middle of a conversation and diagram a sentence so she could understand it, or who learned music so quickly with the same ears that also made her scream when she wasn’t warned for a fire drill. There weren’t any stories about girls who went to college already well-verses in mixing drinks because they’d gotten so good at mixing 125 mls of Zoloft into eight ounces of pineapple-orange juice every morning.There weren’t any stories about people like me. I was not something to be conceived of, I was not expected. There were no scripts. I didn’t exist.(So I didn’t count.)Now, to the point.I am a lesbian with disabilities. I am an autistic lesbian; I am a lesbian with bad brains.Glee fandom has taught me that exactly half of this identity is acceptable.I am sure I should be grateful for this. It is an improvement, after all–outside my bedroom door, I’m not allowed any of it. Being a lesbian is a good way to get myself raped or killed in my, in this, town. I know this. So I apologize for my ungratefulness, for my stubborn, bratty selfishness, when I point out……being half a person means that I’m still not actually a person at all.Here’s the thing. I can’t actually turn my disability off. I can pass as less disabled, sure–not as non disabled, but less, of course, in some circumstances, if I’m prepped enough. Hey, did you catch that? I can pass. Passing is a concept that applies to ability too, not just sexuality or race? Did you know that?Probably not, actually.The Glee fandom, at least the parts I’m in where I encounter this problem, seems fairly knowledgeable and progressive and all those other nice, soothing words about a lot of things. People generally know what I mean if I say Kurt can’t pass or Blaine passes as white. It’s not perfect, of course, but I’m far more likely to be understood than if I say Artie can normalize himself or Brittany has become increasingly unable to pass.Pass as what? She’s bi, everyone knows that, what else could she possibly be passing for?(Well, actually, she’s written and played as disabled, the actress has said so.)No she’s not. You’re giving the authors way too much credit. That must have been an accident. Sloppy characterization, bad writing, lol Glee…no. They wouldn’t write that. She’s not.(And then this is where I finally, finally, get nasty.)Am I an accident?Am I sloppy?Am I not supposed to exist?Is my story worth telling?It’s not supposed to be personal, except for all of the years I’ve known the answers to those questions. Yes, yes, no, no.I think the casual impersonality of it is what makes me feel unsafe, actually. It rests on the assumption that people like that aren’t reading or participating in these discussions (how could they, they’re retarded) and that our stories don’t even exist to be told. I mean, do disabled people even have sex drives?And yes, to be clear, I absolutely do mean it when I say I feel unsafe. I’m not sure how else I’m supposed to feel when I realize that I do not exist to large swaths of people.A great deal of the time, passing means passing as nothing at all. I don’t exist. And you know, still, I automatically typed and that’s fine, that’s whatever after that last sentence, because you’re not supposed to make an issue of it. Not supposed to draw attention. I don’t exist.I’m not in your stories. When I see myself, I’m wrong. I’m bad writing. I’m not in your stories, and I don’t get any stories of my own. I don’t exist to the greater world, and ultimately I’m not allowed to exist to myself.But that’s fine, that’s whatever.There’s a violence in invisibility, you know.There are little speech patterns that creep in when we talk about Brittany, sometimes. About who deserves her, as if she has no agency, as if she can’t know her own mind.(Do I? Do I get agency? Or do I just need to be grateful for whatever affection and attention I do get? Should I find the boys from ninth grade again and apologize to my abusers for kneeing one of them in the balls? Should I have known it wouldn’t get better?)There’s a violence I still can’t talk about, in the end.Let me take the focus off me. I’ve been debating whether or not to leave that sentence in. Let me take the focus off me, because this is not how you stay invisible. But…but keep the focus on me, because isn’t that the point? Isn’t that what this show, or at least this essay, is about? Keep the focus on me, because there are so many different ways to be invisible.Quinn. Quinn and her slow, silent breakdown all last season. Quinn and Lucy. Blaine. Blaine and looking back and realizing that some needy, broken sophomore was trying to mentor an older, stronger kid, because he can be however you want him to be. Mercedes, swallowing a crush she knows goes beyond all reason, but reason never had much to do with it. Mercedes, good old reliable Mercedes, realizing that the moment she’s not so reliable, the moment she wants more, the moment she’s visible, is the moment she’s no longer wanted.I’ve been all of those kids. I’ve lived all of those stories. So, so many of us had.And when we hear that these stories don’t exist? That they’re just bad writing? Just lazy plotting, poorly executed versions of better, real, worthy stories? That they’re not worth telling on their own merits, that no one wants to see that?We don’t argue, usually. How are you supposed to argue when apparently a story you’ve lived is just some hackneyed, inferior attempt at something worth attention?We don’t argue, because our stories are judged unacceptable and by extension so are we, and that’s a conversation we don’t actually need to have again. Glee tells a lot of stories, and they aren’t usually the ones the real people want, and of course, we already established this, we aren’t allowed our own stories. No, of course not, and should they somehow be written and acted and shot anyways, they can still be grabbed and labeled as something different entirely, graded against an entirely different narrative, and thus still easily found wanting, derided, and thrown out.And that’s fine, that’s whatever. That’s how it works. I just want to know……why.I just want to know…who decides whose stories get told?Who decides which are worth telling?And why aren’t mine on that list?", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/10/14/whose-stories-get-told-regarding-feeling-unsafe-in-the-glee-fandom/", "title": "Whose Stories Get Told: Regarding Feeling Unsafe In The Glee Fandom"},
{"date": "November 1, 2011", "body": "Today is Autistics Speaking Day. It’s an annual holiday of the Autistic community that started last year in response to some ill-advised advocacy attempts, and I hope it continues until someday every day is Autistics speaking day. It’s one day of the year where social media and the blogosphere are reserved for the Autistic community to speak out in a concentrated effort.Today is Autistics Speaking Day.Today I am silent.Part of being autistic is that things do not always go according to plan. Part of being autistic is that I can’t always synch up with everyone else. Part of being autistic is that I can’t, in fact, deliver meaningful content and communication whenever I’d like–or, really, whenever other people want me to. Part of being autistic is that I can go months without anything much to say at all, really.Part of being Autistic is knowing that that’s okay.Most of my writing and thinking this past month has centered on the things I’m interested in–Glee, Phineas and Ferb, Community. Mostly Glee. I’ve been doing other stuff, sure, but much of the thinking is still pre-verbal. I have thoughts I can feel stitching themselves together and lining up about college and developmental disabilities, about quite hands, about the power and terror of words like “stop” and “I need help” and “no,” about abuse, about when autistic people are listened to, and about autistic vs Autistic….but they aren’t ready yet. They aren’t even words. Most of my posts here have taken months of patience, of silence, of frustration and catharsis and self-injury and all kinds of “behaviors” and meltdowns and unpleasantness, before I could sit down and everything came together. I’m in that transitional period again now, and it’s quite uncomfortable much of the time.I’ll wait. I’ll be silent. I’m Autistic–I’m allowed.Today is Autistics Speaking Day. Some of us can’t speak today.I hope you’ll still listen, when we can.", "outgoing_links": ["http://autisticsspeakingday.blogspot.com/"], "link": "https://juststimming.wordpress.com/2011/11/01/autistics-speaking-day-2011/", "title": "Autistics Speaking Day, 2011"},
{"date": "May 1, 2012", "body": "Author’s note: Yesterday in the blogosphere there was an Autism Positivity Day Flash Blog, sparked by one author noticing that someone had found their blog by searching “I wish I didn’t have Asperger’s.” Due to my own situation, I couldn’t participate, but today is Blogging Against Disablism Day, and I still have something to say.Sometimes in the morning I am petrified and can’t move\nAwake but cannot open my eyes\nAnd the weight is crushing down on my lungs\nI know I can’t breathe\nAnd hope someone will save me this time xDear “I wish I didn’t have Asperger’s,”I want you to know that I understand.That’s the first thing. This isn’t going to work if we aren’t honest with each other, so, let me be honest. I’ve thought a lot about that mythical cure, and there have been days, many days, when I didn’t have to think at all–when I knew that, if I had a chance, I’d take a cure in a heartbeat.I need you to know that I understand.I do. I do. I want the things a cure could give me.  I want to have the leading role in my own story, and parts in others’. I want to be able to do the same things everyone else can do in the same way without any extra effort. I want to not feel like a freak. I want to feel safe. I want to be someone my parents can love. I want to know I have a future, and I want to not have to blaze that trail by myself. I want to have worth. I want other people to not think they have a right to me and my space, or else I want it to stop bothering me. I want my words and experiences to make sense to other people, and I want their words and experiences to make sense to me. I want to have to work just a little less hard. I want to have a college degree, a job, and a house of my own, and I want to be able to live wherever I want. I want to be able to assume I’m a person. I want to not have a month out of the year dedicated to my brokenness. I want to be able to assume that it’s not me, it’s them. I want to wake up and not be terrified or already tired.I want a lot of things.It’s not a bad thing, to want things.Check in: can you see, now, that I really do understand? I hope you can. I get a couple of visits from you, or someone with the same keyword search, every week, and I want you to know that you aren’t alone, and you aren’t wrong.Okay. I’ve been honest with you. Now I want you to be honest with me. Can you look at the list of things I want, and tell me if you see a pattern?I’ll wait.While I wait, I figure, I might as well tell you some other things I’d like to stop being. In addition to no longer being autistic, I’d also like to be cured of-being a lesbian\n-being female\n-being so obscenely tallReally. I’d like to get be able to get married to someone I love in every state. I’d like to be able to walk down a dark street without fearing for my safety. I’d like to be able to sit in a chair designed for someone of my height. And none of those things are happening right now, so I guess I can either fight for them to change, or try to change myself.Okay. Did you find the pattern? It’s okay if you didn’t. It took me awhile to understand it. It’s subtle. Every single one of those things I want?Have nothing to do with being autistic.Really. Not a single, solitary one.I should have a leading role in my own story. When I don’t, it’s because other people aren’t treating me like a person. That is not my fault. Pretty sure the one in the wrong there is the one who thinks that a disability means you aren’t a person.Why do I want to be able to do the same things as everyone else? Why is that important to me? If I lived in a world where it was recognized that there are multiple ways to do something and that this is okay and the things I do and the ways I do them are valid and important, would I care? Would I even realize this was something to care about at all?I would know that I have a future, and that it’s a bright and near and real one, if I knew growing up that autistic adults existed. Guess what–they do, they have for thousands of years, and on the whole, they’re doing just as well as anyone else.I want to have worth–okay. See, if I had a friend who felt worthless, I’m pretty sure I wouldn’t tell that friend “you’re right, you’re pathetic. Please change everything about yourself.” I’m pretty sure I would tell that friend that the people making her feel worthless were abusive assholes, that she was good at plenty of things, that she was a fantastic person I was lucky to know, and that human worth isn’t some tangible thing we can gain or lose. And if I can say all of that to a friend, and mean it…why can’t I say it to myself? I’m not special. I work by the same rules as everyone else. And that means I am worth something, whether I believe it or not.I can keep going through these. I do make sense to a few people, who take the time to listen to me the way I need to be heard, and they make sense to me. That is how relationships work, and there are lots of different ways to communicate. I can have a job, a living situation I am in charge of, and all the education I want, with the correct supports, just like everyone else. It is not my fault that the supports I need differ from the majority, and that is not an excuse or invitation to mistreat or discriminate against me. Etc etc etc.In the end, there are really two things I want when I say I wish I wasn’t autistic or I want a cure. I want to not feel like a freak, and I want to feel safe. Those are hard, scary things to feel and to admit. And, because I’m being honest, I have to ask something even scarier.What if being cured didn’t fix those things?Because ultimately, if I took a cure, I’d be surrendering. Instead of fighting for my right to be treated and valued as a human being regardless of disability, I’d be letting go, giving in, and letting myself be changed into someone easier, someone acceptable, someone convenient. And I want to be clear–there is nothing wrong with wanting things to be easier or wanting to feel safe or accepted or just being done fighting. That just means that you’ve been asked to be much, much stronger than everyone else for much, much too long.But if, in order to be safe I have to stop being me?Then I’m really not safe at all.As long as being disabled means being unsafe, then no one is safe. Not really. Disability is a natural part of the human experience according to the ADA. Most people will experience some form of disability, for some period of time, at some point in their lives. So long as we as a society keep permitting exceptions to rules like everyone is a person and treat people like people, none of us are safe. Safety earned by staying within acceptable margins isn’t safety at all.I promised to be honest. Part of being honest is looking at what my words actually mean, what lies beneath them, what ideas are controling what I say. And underneath every I wish I wasn’t autistic is a I wish people would stop hurting me or a I wish the world had room for me or a if I blame myself, I can feel like I’m in control.And it’s okay that I feel this way. Well, it’s not okay that anyone ever has to feel this way, but I’m not bad or wrong for feeling it. Neither are you. But feelings aren’t the same as reality, and in the end, if we weren’t autistic anymore, there would still be people hurting others just because they can and just because no one ever told them to stop, and we’d still know that it takes only the slightest deviation before we’re vulnerable again. A cure won’t ever be able to change that.What will change that is something a lot harder than a magic pill. What will change that is enough people saying enough is enough and doing the hard work of making our world one where everyone is welcome, all communication is honored, and everyone is safe and valued. And that is going to take time, and there are going to be days, still, as we work to make that happen, where you, where I, will wish we weren’t autistic, because sometimes it just hurts.But it will change. It’s changing now. And you shouldn’t, and don’t, have to. You are amazing and sufficient and lovable just the way you are, and I really, really hope you’ll stick around so that one day the rest of the world can know it, too.", "outgoing_links": ["http://autismpositivity.wordpress.com/", "http://blobolobolob.blogspot.com/2012/05/blogging-against-disablism-day-2012.html", "http://www.youtube.com/watch?v=o7N-0I8Y1rk"], "link": "https://juststimming.wordpress.com/2012/05/01/truth-is/", "title": "Truth Is"},
{"date": "January 17, 2015", "body": "There’s a new person in my life, so we’re having the how-my-body-works talk.It’s a conversation I don’t think nondisabled people have. It goes like this: this is my body. This is how it works. It moves this way. These parts of can feel, and these can’t. This will hurt me, and this won’t. I want you to know these things. This is my body, and this is me.“We should have the conversation about physical contact, but I don’t know how it goes,” she said.“Well, fortunately, I’m really good at this conversation,” I said. “I have it all the time.”I’ve been thinking a lot about the kinds of intimacy my disability forces me into. Most people don’t have to brief half the people they meet on what they can and can’t see. But the truth is that my body works like yours right up until it doesn’t, and if you aren’t ready for that, you could get hurt–or I could. So I have this conversation with dates, new doctors, friends, coworkers who are filling in and giving support. I have had this conversation on the grass, in bed, in exam rooms, on kitchen chairs. It goes like this: I have autism. That means my brain and my body have a hard time talking to each other.Sometimes I give examples: I move funny, and I can’t always control it, and maybe most importantly, I can’t always start moving when I want to. Sometimes my skin can feel things; sometimes it can’t. Usually it comes and goes in patches. A lot of the time, I can’t figure out how to move. Sometimes I notice pain, and sometimes I don’t. Sometimes my body tries to pull itself apart. Sometimes I know in advance when I’m going to have a bad body day, but usually I don’t until I’ve dropped something all over the floor.Some of the conversation is important: I feel pain differently, but I do feel pain. I can’t feel my body and use words at the same time. Being around other people is physically painful, always, every time, but sometimes it’s worth it. I don’t always realize I’m hurt or sick, but every time a doctor has found a part of my body shredded to bloody pieces by my own fingertips, it’s meant that there was something seriously wrong happening underneath–my hands knew before my brain did. Before I can stand up, I have to find my legs, but sometimes I get stuck. Here is how to prompt me. Here is what kind of power having those passcodes means.Some of the conversation is weird: my body language doesn’t work like yours because I may or may not be able to move those muscles at any time–so I need you to look at me and make different assumptions. I move typically, until one minute you look at me and you see the way my hands hold a cup like a toddler, until my body twists and jerks back in joy, until I don’t move at all. I was born functionally blind, and then I gained a lot of vision, and then I lost some of it again, and now there are a lot of things I can’t see, for two different reasons. If we go into a new room, I will need you to tell me where to sit. I will ask to borrow your eyes, your hands, your brain.It’s not a big deal, I say, and I need it to not be a big deal to you.These are conversations I am good, or at the very least practiced, at having, but they still make me want to crawl out of my skin. Insisting on having these conversations, instead of pretending my body works in all the standard ways, means taking up space and focusing attention on myself as a disabled person. We aren’t supposed to do that. And because my disabilities aren’t necessarily visible, are easy to miss or to misinterpret at first as something else, my conversation partner might not understand why I want to have this conversation in the first place. It can be awkward and fraught–please understand this thing about me, please understand me–and there’s not much precedent. There isn’t a standard social script for this. There’s a temptation to just learn to avoid the need for the conversation entirely–just blend, just let yourself get hurt, just avoid other people entirely, rather than subjecting them to a litany of all the things that make your body different.I still feel that way, sometimes, and sometimes I think I can get away with not having the conversation. And I can, right up until someone reaches out to me, and in the time it takes my brain to process what’s happening, decide to reciprocate, and send the necessary signals down and out to my body to start moving, the other person has paused, seen my lack of movement, and withdrawn, shuttering.“Here is the thing about me and hugs!” I write, later. Here is the thing about me and touch. Here is the thing about me and my skin. Here is the thing about me and my eyes, me and my hands, me and my disability, me and my body. Here is the thing about me.It’s a weird conversation. But I wouldn’t trade it for the years when I didn’t know how to have it. There were whole years when doctors and parents knew that I couldn’t see, that my leg muscles were knotted and my torso was floppy and my body didn’t listen to my brain, but no one told me, and so I thought I was bad.  My body didn’t work, I thought. I didn’t work. But that wasn’t true–it’s just that no one had taught me how my body worked, let alone how to talk about it. You shouldn’t have to be a stranger from your body. And I’m not, anymore, and I don’t want you to be, either.This is my body, I say. Look what I found out. Look what I know now.I want to share this with you.  ", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2015/01/17/the-talk/", "title": "The Talk"},
{"date": "December 21, 2014", "body": "There is this thing that happens sometimes.Parent has an autistic child. Autistic child doesn’t speak, or their speech isn’t an accurate window into what they are thinking. Autistic child is presumed to be very significantly intellectually disabled.Years later, a method of communication is found that works for the child, and it turns out that they are in fact very smart. Very smart! The parents are overjoyed. They begin talking about presuming competence, the least dangerous assumption, that not being able to speak is not the same as not having anything to say.They are so, so excited.And they start talking about all the incorrect assumptions they had. If we’d known, they say, we wouldn’t have done X. If we had known they could read, think, hear us.And it’s a big problem, because the way they talk…..they think the problem was that they treated their child like they were intellectually disabled, and they weren’t. But that’s not the problem. The problem is that they thought their child was intellectually disabled, and so they didn’t treat them like a person.These revelations, about presuming competence, human dignity, and the least dangerous assumption—they don’t apply only to kids who are secret geniuses. They apply to everyone. They are the most important for the kids who really do have intellectual disabilities, who really can’t read or use full sentences and who really do need extensive support. The people who came up with these terms came up with them for a population where there is very little doubt that significant disability is a factor. These terms don’t mean assume they aren’t actually disabled. These terms mean assume they are a person, and remember what you don’t know.When the neurodiversity movement first got its legs, oh so many years ago, we got a LOT of pushback from people who thought we were denying disability. And we had to be clear that we meant everyone. And I worry, more and more, that certain very academic circles have left that behind, in practice as much as in theory. It makes liars out of the rest of us, and it makes a lot of work very, very difficult.If I told the parents in question that I am thinking about this, they wouldn’t understand. They’re not saying intellectual disability doesn’t exist, they would say. But the truth is, they’re either saying that, or they’re saying thank god, it wasn’t my kid.And it’s a slap in the face, every time.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2014/12/21/dangerous-assumptions/", "title": "Dangerous Assumptions"},
{"date": "January 24, 2013", "body": "\n\nlol conflating disability and DEATH so casually that nobody but disabled ppl notices.\n\nSo the thing is, most of this belongs at the bioethics conference, but, but, jesus.I remember being in high school and not being sure why, exactly, college had to be a thing, because I was going to be dead by the time I was thirty.(Two-thirds of the way there and I still can’t see more than ten years down the line and maybe, maybe a small part of what I’m doing is motivated by now or never, I’ll do this right.)Why would I be dead by the time I was thirty? Well, every other girl like me never seemed to make it to womanhood, it only stood to reason.At some point, and I’ve told this story so many times and it never stops making me want to cry, I started hearing about other disabled people. People who were older than me, people who weren’t about this thing is going to kill me one of these days, people who weren’t about living with, living with, living with, not dying from disease, people who were disabled and alive and not sick, not dying, but raising hell and building lives and screaming, screaming, screaming when we were being killed. People who used words like we.I thought, we, yes. We. Okay. We can make this work.\n\nlol conflating disability and DEATH so casually that nobody but disabled ppl notices.\n\nWhen you are disabled, when you are traumatized and vision-impaired and autistic, even and maybe especially when you haven’t been given those access codes yet, you learn to see yourself as the walking dead. You are vast swathes of nonexistence, cut off and left for dead at every missed milestone and swapped pronoun and bruised shin and scar on your face. There are Other People, Normal People, People, and then there is you,  and you are defined by the parts of yourself that match to everyone around you, and then the vast swathes of nothing. Disability is absence, disability is inability, disability is death, and you are a woman in a refrigerator. It takes you a while to learn that you aren’t the one who put you in the refrigerator. It takes longer to learn that it wasn’t your body, either.A lot of us never get to the point where we can say it was you, you tried to kill me, you made me think I was dead, you screamed about the injustice of putting me in a refrigerator while you, you were the one killing me.\n\nlol conflating disability and DEATH so casually that nobody but disabled ppl notices.\n\nAnd you made me think it was my fault.One day, I will write a speech that isn’t this one, this choked and untitled remixed stew of you tried to kill me, and you made me think it was my fault, and now you will listen.When you’re disabled, you see death everywhere, and it isn’t because your body stands out or doesn’t stand at all, it’s because everyone talks about you like you’re in a refrigerator, like you’re not real, like you’re dead.And it kills you.They kill you.\n\nlol conflating disability and DEATH so casually that nobody but disabled ppl notices.\n\nWhat I am trying to say is that of course, of COURSE, of fucking course we notice, because we can’t not, because the bioethics conference has one day for beginning-of-life issues, where they try to cut us out, and then a day for end-of-life, for those of us who slipped by, because last week twins in Belgium asked the state to kill them because no one ever told them that they didn’t have to go into the refrigerator. What I am trying to say is, my friend has a friend who uses a wheelchair and didn’t get screened for breast cancer because she’s already dead, right? And you, you, every single one of you who said we are helping, we are saving you, something cruel and unjust has been done, and then you made disability mean death and shoved us into the fucking refrigerator. You killed us.I didn’t know how to die until you taught me.\n\nlol conflating disability and DEATH so casually that nobody but disabled ppl notices.\n\nQuestion: if nobody but disabled people know that disability and death are distinct and not overlapping concepts, does anyone really know? Or are we just trees in the forest, falling (well, growing, would be the point,) with no one to hear?What I am trying to say is, I am now Someone Who People Meet, and I know that there is a vast we out there, and I know that I am living and a woman and disabled and that none of these contradict, and I dragged myself out of the refrigerator by the skin of my teeth and said you will listen to me now, and this evening I felt sick when some friends offered to transcribe something for me, and I still can’t see myself making thirty.And what I am saying is, this thing is going to kill me one of these days, and what is going to kill me isn’t going to be my back screaming at me or my eyes turning off or my head going through a wall, it’s going to be everyone who says we’re just trying to get you out of your refrigerator. I pulled myself out of the refrigerator you put me into the day you started grading people into people and cripples. I pulled myself out the day another woman in another refrigerator told me, like passing on a secret, we aren’t dead yet. Someone let me out of your refrigerator, and you can never put me back in there again.\n\nlol conflating disability and DEATH so casually that nobody but disabled ppl notices.\n\nI’m disabled. I’m not dead. I’m not in a fucking refrigerator. I am living, living, living, and I am screaming, screaming, screaming. And, just in case you should care…Yeah. I noticed.", "outgoing_links": ["http://daxsymbiont.tumblr.com/post/41151446118/vega-ofthe-lyre-women-in-refrigerators-by", "http://daxsymbiont.tumblr.com/post/41151885606/lol-gail-simone-lol-conflating-disability-and"], "link": "https://juststimming.wordpress.com/2013/01/24/confession-of-a-woman-in-a-refrigerator/", "title": "Confession Of A Woman In A Refrigerator (Speech Without A Title 2.0)"},
{"date": "June 4, 2012", "body": "Buckle up kids, because this gets long and personal.So, a long time (~7 months) ago, in a galaxy far, far away (rural New Hampshire,) there lived a sad little girl (or KICKASS ADULT,) named Julia who just so happened to have a friend named C. C and Julia had spent the past several months talking too much altogether about Glee, and C had begun to push for Julia to add a second show to her plate. Some brightly-colored sitcom about derelicts going to a community college.And Julia was skeptical, but C was persistent, for she knew that if Julia liked the first two minutes, Julia would have a new favorite show. See, C knew something that Julia did not.C knew that Abed Nadir existed.Now, there are a couple of things you, gentle reader, must know about Julia in order to appreciate what happens next. First, you must understand that, ever since she had been born and maybe even before, Julia had been autistic. And second, you must understand that, because of this, Julia had spent her whole life watching and learning stories where she had no part, no point of entry, and no value. Julia was trained to imagine herself in stories as someone she was not and could never be, and to define the story of her own life in terms of how it failed to be reflected back to her. And sometimes, most of the times, Julia forgot that she was a person. Stories are important, and she didn’t have one. You are a mistake isn’t a story. It’s barely even a sentence. I must warn you now that this is not a story of how C or Dan Harmon or Abed Nadir or even Julia herself saved or healed Julia. It’s in the script, but Julia wouldn’t have a voice in any of those stories, either. No, gentle readers and vicious tumblr-ers, this is a story of what it means to start a new story and see on your screen, for the first time, someone who moves like you.Do you understand what that means?It’s probably not something you’ve ever really had to think about. But how someone moves is the first thing telling you whether or not they might be able to be you, and you them. And for the first time in Julia’s life, she looked at a character on television and saw a yes.Abed Nadir walked onto Julia’s laptop screen, and nothing and everything changed.For the next seventh months, there was a lot of CAPSLOCKING IN GOOGLE CHAT at C about Community and Abed Nadir, but very few words elsewhere. Which was odd, because when Julia liked things, she tended to talk about them too much. This was one of many things she and Abed had in common.Except, here’s the funny thing. Abed said “I just like liking things,” and it wasn’t just not-punished, it wasn’t just okay—either of which would have been remarkable and unbelievable—no. It was good.And Julia, who had endless words for a great many small and unimportant things, couldn’t say anything more about Abed beyond he moves like me.Abed Nadir, you see, is an autistic character.There’s a difference between TV Autistics and autistic characters on television. TV Autistics—Bones, House, Sheldon, Sherlock—are caricatures, and, not coincidentally, all fan-diagnosed. They are socially awkward/anti-social/socially maladapted, eccentric geniuses free of any serious adaptive functioning limitations, motor issues, sensory sensitivities, or language differences, able to manage independently in all major areas of daily living, with a bonus side of savant skills and the empathic range of a rock. They’re awesome, but they’re a stock character, and they manage to simultaneously hint at the autistic experience without actually meaning it. It’s like that poster about gay subtext in popular that was going around a while ago the irony being, of course, that for a show that is “so gay,” it’s actually not gay at all. The people in charge have found the perfect ratio of homoerotic subtext (all of it) to actual gay characters (none of them) to keep the fangirls creaming their pants and the money rolling in. No one involved has any intention of meaningful inclusion or exploration. You avoid any potentially unpleasant consequences, because the choice to have a gay character was never actually made.It should be noted that autism isn’t the only reason Julia grew up without People Like Her on television, and it’s not even close to the only reason she has a Thing about stories. And that’s the curious thing about these TV Autistics—someone who’s watched one of them in action is much more predisposed to assume that since Julia is autistic, and since she’s got this extended metaphor (bonus points if you say perseveration) about stories going on, stories must be her Special Interest, the framework through which she filters the world, the poor half-human thing.And they are, but that’s because Julia is, shockingly, a person at her core. And people need stories.Which brings us back to Abed.It’s entirely possible Julia over-identified with Abed, just a tad. Which struck her as first a bit odd—they’re nothing alike, Abed thinks The Breakfast Club had a plot and likes falafel and his mom had the decency to leave— and then as more than a bit precarious. This wasn’t supposed to happen.(Somewhere, fiddling with her contacts, C arched an eyebrow and said “it wasn’t?” and Julia cyber-kicked her.)Abed Nadir walked around like a bird or a giraffe, and he couldn’t do thumbs-up and he talked too fast and knew too many things and he was sharp and suspicious and easy and trusting. He did things that were simultaneously uncanny/creepy and sweet/thoughtful, and he couldn’t do bills or read clocks but he could tell psychiatrists to fuck off and he could fight with his best friend when his best friend tried to take charge, and he was jealous and sharp with his crushes. He had friends and private worlds, and all the scars that come from growing up a mistake, and things were imperfect and messy and painful and visceral but he always emerged okay.Abed Nadir said “please don’t do a special episode about me” and Jeff Winger promised he “wouldn’t dream of it.”And then he told Abed to pick one reference, and Abed picked 16 Candles, so they sat on the counter and ate chicken.(And Abed didn’t mind who he was kissing so long as he got to be Han Solo, and also he delivered several babies and got to be the good cop and the bad cop and used his diagnosis to get rid of an unfortunate lab partner and took advantage of a stranger in a bar’s patience so he could talk about Farscape.)And stories are a scary and messy business, full of magic and demons, taunting possibilities and rules-that-aren’t, things we can’t have and altogether far too many opportunities for a sad little girl’s heart to be ripped out of her chest, and Julia kept watching, every week. And you must understand that asking Julia to pick one Abed moment is liking asking Abed to pick one reference.You must understand that one story is infinitely bigger than zero, and it may still be very small and nowhere near enough, but it’s something.And yes, her heart was eventually forcibly extracted when Dan Harmon broke his promise and Virtual Systems Analysis was the dreaded Special Episode. And Julia remembered how to breathe, and stitched herself back up, because she hadn’t really needed that heart, anyway. And when it turned out that someone else would be in charge of Abed next year, she remembered what she had always known to be true about happy endings and said goodbye, mourned more than she had for any corporeal person (which was still not very much,) and folded away that part of herself and went back to not existing.But for seven months.For seven months, she had.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2012/06/04/someone-who-moves-like-you/", "title": "Someone who moves like you"},
{"date": "October 31, 2012", "body": "(This post could be seen as a self-narrating zoo-exhibit with bonus spot-the-theory-of-mind. I hope you’ll take it as a follow-up to The Obsessive Joy Of Autism, as equally about the experiences of visual processing impairments and synesthesia as about ~autism, and as a case study in the inadequacy of traditional verbal language. If I’d been taught earlier that experiences which exist independent of words are still meaningful and sufficient, I never would have had to write this.)(This whole essay represents a dozen years of heartache, a fractured self-image knit back together, and the entire reason why I will never, ever talk about the instinctive simplicity of video editing.)(Note: as is typical of my writings, pieces are rarely finished in the same day they are started. The voice lesson I refer to as “today” is in reality long past; in fact, due to circumstances regrettably beyond my control, it turned out to be my last. I have been unable to further explore the discovery my voice teacher and I made, and it aches.)(This entire piece is written in a voice I don’t very much care for. My apologies.)(I can either keep apologizing in parentheses for a lifetime, or just tell it to you.)A fifth is two sine curves, and this is the most beautiful thing.I’ve had a dozen years of classical musical training, and I’ve been playing with calculus for about the same amount of time. I don’t talk about either of these things with much frequency. I don’t like to sing in front of people, and I have a passionate love affair with math but hated and barely passed my classes in high school. I drink up geometry videos on youtube, and once a week I go to my voice teacher’s house and sing for the best hour of the week, and these things are secrets. Very few people know how important music and math are to me, and that’s been a deliberate choice on my part.I don’t talk about the most sacred things, because it’s the fastest way to destroy them.I have an intense and embodied relationship with music. Music is a lot like people, and songs are linguistic and therefore social exercises. Music teases and tells and remembers and reflects and transforms and encodes and transmits. I experience music kinesthetically, emotionally, and intimately. It is shattering.I know a lot about music. I hate talking about it, because the things I know aren’t the same as the things you know.My left hand doesn’t have enough coordination to permit me to play any instruments. I can, and do, sing, and I’ve spent 12 years learning to do so with surgical precision. I can’t sight-sing–I can peel apart the layers of a piece for theory, no problem, but identifying pitch and tempo and dynamic and a note’s place in the overall piece, and integrating those elements, factoring in timbre and placement, and singing them, in realtime, is simply not possible with my visual processing impairments. I rely on an ear I’ve spent years training–if there’s one other singer, or a pianist accompanying, I can do a passable imitation of first-time sight-singing even pieces I’ve never heard before. Ever since I first joined an (auditioned, highly-selective, then-prestigious) youth choir at age eight, I’ve known that I do music wrong. At first, that took the form of being shamed for moving when I sang–music shouldn’t be a physical, embodied, tactile experience. In later years, my inability to process visually rapidly enough to sight-sing, and my difficulty holding a harmony, made rehearsal a living hell. Yet I was never kicked out, because I could still sing circles around 2/3 of the other singers, and it wasn’t that I couldn’t harmonize, just that I might sing any one of a range of acceptable harmonies and not necessarily the one I was arbitrarily assigned (or the one the composer had written,) and as long as I didn’t talk about it, no one knew I couldn’t sight-sing. (I did, of course, talk about it; lying didn’t occur to me until later years.) I trained my ear, led the 1st sopranos because the melodic options are necessarily restricted and usually sensical, kept my joy at things I had the wrong words for to myself, and kept singing.(My life goes on\nin endless song\nhow can I keep from singing?)It destroyed me. I loved this, I was so good at it, it felt good and right and perfect, and yet any attempts to communicate about this were miserable failures. Singing is the only time I ever feel at home in my body, and yet I felt like a fraud; sure I could learn a new song faster than anyone using only my ear, but I couldn’t sight-sing. Clearly this was some elaborate hoax I’d engineered, clearly I didn’t have any real aptitude, and clearly, my decision not to pursue college or career in music or performance was the only ethical option.Despite this, despite the guilt and shame and confusion, I’ve kept going to weekly lessons. It’s an hour, just me and my teacher and a piano, and as we pull songs apart and test what my throat can do, the songs resonate between my ribs. It is, essentially, an hour of breathing exercises,  so it’s the most effective therapy I’ve ever had. And I’ve kept going, and today, finally, after 12 years, we figured it out.There were signs. The music teacher at my high school had almost worked it out; he’d play two notes, and I’d hear a third, and not every student could. He talked about harmonics and melodic structure; I listened, and adored him, but had trouble talking to him. With my voice teacher, I complained that the standard system of music notation was nonsensical, bearing no correspondence to the way music actually worked, and relied on a flagrant disregard for basic arithmetic. I struggled with the idea that a fourth is supposed to sound “smaller” than a fifth, and though I could sing any note back perfectly, I couldn’t tell you which notes were higher or lower. None of the language used to communicate about music made any kind of sense to me. The spatial metaphors simply would not map. I had my own rich, dynamic, embodied and  visiospatial experience of music, I could feel and see the music move, and sheet music couldn’t come close.I’ll tell you what my teacher and I learned today, but first I need to give away my other secret: math.My history with mathematics is, if possible, even more tortured and rapturous and bewildering than my relationship with music. As a small child, I was in love with arithmetic; my mental calculation abilities are noted on my earliest evaluations (and dismissed, of course, as splinter skills.) One of my earliest memories is of not being able to explain to a concerned teacher why 2+3=5. “Because it is,” I said. “And it’s beautiful. It just fits.” Manipulatives were meaningless for me–my eyes couldn’t process them easily, and they didn’t bear any relation to the ladders and scales of numbers in my head. I simply had to close my eyes, and think of an equation, and I would feel myself swing from number to number, landing effortlessly and securely on the answer. Easier than walking.(There’s a hint to the eventual reveal, there.)While I had some small troubles learning the language for arithmetic (especially for fractions, which are fun and clever enough as pointless rituals but beautiful when you realize that they actually signify multiplication and division, that you are performing meta math,) mathematics was an easy joy. Note, please, that I am talking about the art of mathematics, not the drivel and formulas we’re drilled on in school. Mathematics really is an art, and it’s inherently playful. It’s a game of “what if” and “how can I.” And when I was eight years old (and still now,) what I wanted most to figure out was how I could model, and therefore predict, events in the world around me. In particular, I was fascinated by the rate at which raindrops crossed and accumulated on my car window as my mom drove me to therapy.So I invented the fundamental theorem of calculus. I didn’t know I was doing this at the time, of course. I didn’t know what algebra was yet; if I’d heard of calculus, I thought it was about calculators, which I found woefully inefficient. I’d never heard of Liebnitz, and Newton had only been hit on the head by a terrifying apple, as far as I knew. I didn’t use the greek alphabet or sigma notation; I didn’t use any notation at all. I just ran some dimensional transformations in my head, checked my model for accuracy, and had a nice visual to keep myself comforted when my hands needed to be still.Eight years later, my AP Calculus/Physics class was asked to prove the relationship between derivatives and integrals, and I got up and drew the model, and not a single one of my classmates understood. After a moment of studying what I did, Mr. Morris said, “spoiler alert, Julia just skipped to the end of the lesson and proved the fundamental theorem of calculus.”I can’t draw it for you now; I lost the image, along with some of my more unusual human-calculator prowess, when my psychiatrist put me on the anti-psych medication regimen that ended in me dropping out of college. But I could then, and before that day, I hadn’t realized that my classmates couldn’t see that basic, innate relationship, the reason why calculus is beautiful enough to ache. I didn’t have the language for it, had never even heard of the fundamental theorem until my teacher told me that was what I’d done. I’d just been amusing myself with models and transformations, when I should have been paying attention in class.See, that’s the thing. I struggled in math class from Algebra 1 on. I never actually took the AP calculus exam–Mr. Morris thought I’d do fine, but since I was technically auditing his class, I didn’t want to try and sit for it. And this is where the agony comes in.Much like music, the way I experience and represent mathematics cognitively is fundamentally different from the conventional language we are taught for it. With arithmetic, this difference only really caused difficulty when new terms were being introduced. But 2+3 is always 5, and I had enough innate understanding and motivation to preserver through even the most ridiculous name choices. This all fell apart when I got to algebra. It’s not that I lacked understanding–I’d been solving for the missing number since I was nine, and the only hardship I’d had there was, again, in comprehending the linguistic absurdity of mixing letters and numbers and shifting the missing piece to the left side of the equation. As soon as I got over that, I immediately started attempting to teach the game to anyone around me, including my four-year-old sister. Algebra wasn’t the issue. The way we represented it, modeled it, and talked about it? That was a nightmare.Graphs on a cartesian plane have a lot of meaning for me–for another purpose (clue.) They also bear absolutely no relation to the kinesthetic and visual models I see when I craft algebraic equations. Zero. None. And I couldn’t articulate this in high school, anymore than I could make myself care about pitch or slope whether the equation came in point-slope or some other form. I didn’t understand why we were talking about graphs at all. It wasn’t until algebra 2 that someone explained to me that all of our equations were supposed to be models for those lines.I was enraged.I still am, thinking about it. What a stupid waste of my time. Who the fuck cared about lines? I wanted to know how to model the age distribution of my peers around me and how it shifted in relation to me as we moved through the grades, how to fit equilateral triangles with a side length of 2in inside a hexagon with 6in sides as efficiently as possible, how to predict prime numbers. Why on earth would I make an equation for a line I couldn’t even make my hands draw reliably half the time?I wouldn’t! This possibility had never occurred to me! I had better things to do!So I didn’t care about graphs. Later, in college, my math major friend would teach me the theory behind linear algebra in half an hour, and I would concede that graphs were pretty fucking intense, but in high school, all I knew was that I was being asked to humor, to indulge teachers who were never sure if I was a genius or in the wrong class in their fetish with graphs that my eyes, more often than not, couldn’t even process as a whole.It did not go well.There were parts of algebra, of course, that I loved. I enjoyed modeling numeric patterns (“series,” I was told, and “summations,” I just called it numbers) like 2n + 7, and there were moments when the graphs for these, or for my favorite exponents, lined up with the stacks of numbers I saw in my head, and the graph became, fleetingly, meaningful. (It was argued that graphs themselves were by definition simply visual models of numeric patterns, and therefore should have been my favorite thing. I defy anyone to look at something like THISand honestly tell me that they instinctively see either 2n + 7 or 9, 11, 13, 15, etc. in that.) Systems of equations were a game that made me laugh and resembled the way I’d play with numbers in my notebook margins when we were supposed to be caring about matrices. Matrices were for our calculators; I was a human calculator, insulted by their existence. My first three algebra teachers understood none of this. I did well in algebra one, as long as I wasn’t asked to graph anything; as far as I was concerned, I was doing slightly fancier arithmetic and then humoring Mr. Morris by labeling things as he wished. Algebra 2 was all about graphing though, and it made me want to die–and now, in an exciting plot twist, the equations had gotten long enough, and the graphs complex enough, that my visual process started undermining me, scrambling letters and transposing numbers and fragmenting graphs, and with it, my grade. But I passed, by the skin of my teeth, and had a brief reprieve in geometry, and then got a better teacher for precalculus who, in the last two weeks of class, realized I had a language processing problem. We stayed after school one day and hacked enough accommodations that I could FINALLY start to use the conventional vocabulary and start training my eyes to read equations like stories again, the way 2+3=5 is, and then graph the story out accordingly. Just in time for the bonus unit on calculus.I looked at a derivative for the first time, and my models and raindrops and joy came rushing back, and I was in heaven.Derivatives and integrals made sense because the transformations they undergo are multi-dimensional, just as the ones I assign my models are. But I didn’t ace calculus. I took an introductory course at Stanford the summer before my senior year of high school and passed on sheer intuition despite missing 1/3 of the classes, but the first few tests I took in my AP class came back with failing grades.My teacher and I worked it out. It was, as always, a visual processing issue: permitted to solve an equation on a white board, standing up, with more space than I could possibly use, colored markers, writing as large as I needed, and only one problem presented at a time, I could earn 100%. Give me the same test, after I’d already taken it on the whiteboard, but this time package it as a two-page test on an 8×11 inches sheet of paper, and I’d get a 40%. It seemed easy enough to accommodate: let me take my tests on a whiteboard, with my teacher dictating each problem to me one at a time, and I could be the best in the class. The beauty of reasonable accommodation! But it wasn’t that easy; the teachers were working to contract in protest of their current salary, so my teacher couldn’t stay after school or come in early to test me. If I’d had an IEP I would have been protected, but my parents were told that students with IEPs weren’t permitted to take AP classes. The solution, the administration declared, was that I would audit the class. I could sit in on every class, do every lab and homework, receive no credit, have my motivation and self-esteem destroyed by a year of failing every test but doing any in-class problem on the board perfectly, teach my class the fundamental theorem of calculus but be humiliated every day by my inability to correctly read and copy equations off a sheet of paper, and everybody won.I don’t remember much of the class. I was an anxious, humiliated, depressive mess, unable to concentrate, still haunted by graphs. It was a combined calculus/physics class: I loved the modeling, but my language processing made the word problems we were given for physics exhausting. There are bright memories, of course–drawing out the fundamental theorem, hacking labs, solving problems at the board, practicing integrals with Tommy for fun, tutoring a classmate over Facebook chat for a test that I failed with a record- breaking amount of transcription errors but she got an A+ on. But I hesitate to call myself mathematically inclined now, and that needlessly hellish year is why.Math and music are some of the most sacred and meaningful things in the world to me. I don’t talk about them, because that requires a 12-year trauma history and interfacing with a language that treats these two things exactly opposite of how the should be.(Do you know the secret, yet?)This is what I learned, at the last music lesson I ever took: I see musical compositions as the graphs I spent years being tortured with perversions of, and I move through numbers like a song.The spatial metaphors we traditionally use for music (notes are higher or lower; a second is a whole step, a third is two whole steps, etc.) fall apart for me not only because of their flagrant disregard for basic mathematics, but also because my primary concept of music lies in harmonics: in the spaces between tonic and supertonic, in the beats of the frequency of a given pitch, and all the different ways we can stretch and collapse and layer and color them. This is what I see, this is what I hear (and the two are, in this instance, the same,) every time music plays. Sheet music is as pale an imitation of this as a graph of y=3x is of the multiplication table. And yet, the transformations I drag my models through, the process of solving an equation (and I’ve never been much of one for solving, really; just give me a model and I’m happy, and maybe that was the problem with algebra all along,) is actually perfectly encapsulated by the language and metaphors musicians use to interpret sheet music.And I just wish that once, at some point, just once during those long twelve years, someone said to me “this language isn’t working for you. Let’s find a new one.” Because then I could have told you, at eight years old, before I could even conjugate reliably or deviate from my scripts, that:this is what C sounds like:this is what G sounds like:this is what a fifth sounds like:and this, Mrs. Lowenthall,  is why 2+3=5:", "outgoing_links": ["http://io9.com/5947852/this-is-a-hexaflexagon-its-about-to-blow-your-mind?fb_action_ids=4695156737637%2C10151465733434097&fb_action_types=og.likes&fb_source=other_multiline&action_object_map=%7B%224695156737637%22%3A114534322033392%2C%2210151465733434097%22%3A114534322033392%7D&action_type_map=%7B%224695156737637%22%3A%22og.likes%22%2C%2210151465733434097%22%3A%22og.likes%22%7D&action_ref_map", "http://www.maa.org/devlin/LockhartsLament.pdf"], "link": "https://juststimming.wordpress.com/2012/10/31/a-fifth-is-two-sine-curves/", "title": "A Fifth Is Two Sine Curves"},
{"date": "August 31, 2011", "body": "They say I’m articulate.(I think about all the words that stay locked in my throat, and I give a small and terrified smile and look over their shoulder and into nothing at all.)I’m really quite lucky I have such a command of language.(There are maybe five people in the whole wide world I can talk to face-to-face without wanting to die, without having a panic attack, without needing to hurt myself or sleep for hours afterward. Two of them receive speech therapy. None of them obey the usual laws of dialogue. I know that, really, I’m lucky to have anyone at all.)My verbal agility is a sign of something, they’re sure.(When I’m trapped into a conversation in the kitchen of someone else’s home, I stare at the table and see nothing at all, and my throat closes and my ears ring and the world is small and distant and hot and I am agile because adrenaline alters our capabilities.)I’m really quite social.(If I am asked how are you I will always say fine. If you ask me anything at all I will throw as many words as I can in your general direction. I can have quiet hands but the loudest mouth, I’m very advanced, and for my next trick I’ll even ask what’s up with you.)I can answer every question you might ever have.(Except for what do you need or how do you feel or do you want anything or is this okay.)I can request independently and answer yes-no questions reliably.(I can request independently because I never make requests, which means independence, which means I must not have to but I could if I did, right? But if you ask me if I need help I will say no, and if you ask, as my hands fly around my ears and my shoulders go tight and small, if I’m okay, I will say yes because I can’t say no and if I could it would mean more talking and less space and I will say anything at all to get you to go away until my brain is my own again.)I am verbose and prosaic in my speech.(I am as helpless to stay silent when you speak to me as I am to move when I need to do laundry. I freeze, staring at my dirty clothes, and every cognitive break I own clamps down because I can’t, because there are too many steps, because this has been the Summer Of Laundry Wars and I have lost. But there are no steps at all in unhinging my jaw and going somewhere very far away and echoing, echoing, reciting and remixing scripts about Why I’m Not In School and What I Did This Summer and Why We Deserve Human Rights until the tape runs out.)I have such a good grip on the English language.(And such a poor grip on reality, going somewhere still and quiet and out of my head while my mouth turns tricks for you.)I’m never told I’m impolite or out of place or off script.(Bad, too serious, perseverative, disconnected, hateful, boring, too enthusiastic, dogmatic, of course. All of those. And that’s just for talking about a show I like, without even stepping on anyone’s toes. For being happy, for getting excited about something, for trying to share. For saying something that wasn’t an answer to a question. But everything’s fine, and I’m very polite, I’m very well trained.)I can say whatever you ask of me.(I’m very obedient.)I’m an Acceptable Autistic.(I never disagree with you to your face, and you’ll probably never hear about it because the gore in my stomach when you tell me I must be very high-functioning gets pulled down by the fear of quiet hands and you must not understand and I know putting yourself in other people’s shoes is hard for you.)I’m a Forgettable Autistic.(As a child, I didn’t cry when I broke my wrist, which meant I didn’t feel pain. I read about social skills when I was bullied, so I wasn’t mistreated. I didn’t cry when I was abused, so it wasn’t abuse. Now, I tell you it’s fine and I walk away, and maybe I sat in a hallway for two hours the other week, unable to remember how to stand, but I can tell you I’m fine so I must be.)I’m articulate.(So you don’t have to listen.)", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/08/31/on-being-articulate/", "title": "On Being Articulate"},
{"date": "April 22, 2011", "body": "I take too long in the shower, I guess, and I think my grandmother thinks it’s because I’m getting off. Actually it’s not fun at all, getting lost in the overstimulation of water and steam, forgetting where I’ve put the soap or what I was just washing, fingers aching because they don’t know how much pressure to use when shampoo-ing, slicing my thumb open when I try to hurry up because I’m being scolded through the door. It doesn’t matter; she wants to teach me a lesson about wasting water.Teach me a lesson.I’ve heard that before.It’s my brother, snarling “she has to learn” while I’m crying on the floor.It’s my dad, in the car, (in the backseat) over the phone, at the bank, whatever it takes, consistency.It’s my sister, grabbing my signing hands to hold them still, “stop when I tell you to stop, it’s common courtesy.” (Though, of course, should I tell her to stop touching me, give me space, stop making fun of me, stop saying that, she is under no obligation.) “I want to hear your words. No. Not those words.”Teach me a lesson.It wasn’t said out loud, but I heard it every day from the kids in my AP classes, eyes sliding over and past me. “What’s the retard doing here?” The face the teacher makes is apologetic. It’s not for me.Teach me a lesson. My friends never hung out with me outside the concrete walls of our school, but they did like making me practice the things I was worst at. Look me in the eyes, hold still, let me hug you. Keep that up and I’ll poke you. It’s your reaction, Julia, that’s why we do it, Don’t talk about that. The hell is wrong with you. Just be a person. Don’t think, just be natural, be yourself. Yeah, you’ll want to lie about that. There are no rules. We’re trying to help. You’re doing it wrong.Teach me a lesson.I want to teach you a lesson.I want to teach you about the boys in Honors English and the smug pride they took in calling me retarded because “hey, it means slow. You are slow. It’s true. You can’t get mad at us for telling the truth.” I want to teach you about being harassed by airport security because I crawl through the checkpoints, my hands shaking and my mind spinning, concentrating on one step at a time. I want to be there when I snap “Sorry, I can’t go any faster, I’m retarded,” and I want you to be my heart when it stops beating.I want to teach you a lesson about never wanting to sleep with someone because they’ll see the drool on your pillow—and everyone drools, true, but everyone has a horror of drool because that’s what the retards do, and most people don’t have to worry about being mistaken for a waste of space whereas I wait patiently for the inevitable moment when my lover, my one safe person, someone I tricked into wanting to be with me, sees me for what I am.Should it be a lesson on dying? Lying on your bead, body tingling and mind dissociating, crying because this is it, you finally get to die, as your heart finally, fucking finally matches the rest of you and just, at last, I knew it had to happen, slows down. Breathes are slower and shallower and you can’t believe it—you always knew that this couldn’t be real, that someone as awful as you couldn’t actually go on existing, and you’d always wondered if and when the moment would come when your body would finally get what the rest of the world knew. You slow, you slow, this is horrible and fantastic and so wanted, so needed, finally—and then your lungs seize up and drag in breath after breath because no. You can’t even have this.Teach me a lesson.I have so much to teach you.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/04/22/teach-me-a-lesson/", "title": "Teach Me A Lesson"},
{"date": "April 24, 2011", "body": "\nFor a very long time I used to think I was different.\nI wasn’t disabled. God, no, I was super good at math and hey, I read the unabridged version of Les Miserables when I was 12! I skipped eighth grade! I would be perfectly fine if people would stop just poking me all the time.\nI was just different, they said, and they said it was cool and maybe a little edgy and it made me special and it meant that I was just as good as everyone else. I was different, see, that’s why I didn’t think that I had toes if I couldn’t see them, that’s why I spent the whole hour-and-a-half of geometry seeing how high I could count by 15’s, that’s why I knew when everyone’s birthday was.\nNo big deal.\nI was just different, see, and so I felt things differently from my peers, and different things happened to me, and things had different meanings. I was different, and my world was different. That was okay.\nExcept for the part where it wasn’t at all.\nSee, here’s the thing. There is an acceptable margin of difference allowed a person, and an acceptable range of ways to be different within that margin, and anyone who pushes beyond that gets pushed into the Uncanny Valley. People in the Uncanny Valley are neither wholly human nor entirely nonhuman, which means we get the human treatment sometimes, and other times we get beat up until the uncanny parts of us are sufficiently chipped off.\nAs an Uncanny Valley girl, I can trick people sometimes—kind of a lot, sometimes. So people got really, really mad when they went to sit next to me and I punched them for being too close, because what the hell, that is not what a human does. I was a bad person, tricking them like that.\nSo I got punished.\nWhen the beating was over, when they let go of my wrist or told me I could maybe come to the next party, I was always, always offered an out. There is a list, somewhere, of the acceptable ways to be different, and they would suggest that maybe I could fit myself safely into one of those boxes, chip off the bad edges off myself on my own, and be a proper human. Give them a break, you know. Help myself out.\nI would like the record to show that I tried.\nI could be gifted, right? I took graduate courses in psychology at Stanford during my sixteenth summer, that should seal the deal—but none of the other students had their A’s dropped to B’s solely because they hid under their bed, wracked with panic attacks, instead of going to class.\nI could be a theater nerd, surely. I loved to mimic people, I loved plays and theaters, I could sing, I stage-managed like no one else—but you had to know how to control your body on stage, and maybe more importantly, you had to participate in the massage trains in the green room, so being in theater was immediately out of the question for me.\nI could be a manic-pixie-dream-girl, right? That was like the epitome of different, and I was so very, very different. I only wore skirts, and I said strange things and repeated things over and over and scratched patterns out on my skin. Surely I just needed love, friendship, someone to save me who also needed me to save them.\nI discovered, though, that manic-pixie-dream-girls don’t bang their heads, and when someone touches them they know how to let themselves be touched. They see the world differently, but it’s an endearing and quirky and acceptable and unremittingly real view, not one that is confused and forgetful and blurred and above all fleeting. They use words differently, but they use the same words as everyone else and they seem to mean the same things.\nPeople like manic-pixie-dream-girls. Some people even like nerds, and gifted students, and kids who spend their Saturdays painting sets.\nPeople didn’t like me.\nThey were so nice to me, carefully working at smoothing out my edges until I fit into one or another of the acceptable differences they offered me, and I was so ungrateful and selfish and obsessive, not cooperating with any of it. Where did I get off, saying I wanted to kill myself, failing tests, waving my arms around, saying things that just no one says, looking over their shoulders instead of into their eyes? Fine. If I didn’t want their help, I wouldn’t get it. See how I liked it then.\nSee, sometimes being different isn’t the best thing about you. Sometimes it isn’t allowed. Sometimes, if you grab onto that label too much, it gets ripped away from you. Sometimes, if you say you are different too often, you get to hear, over and over and over and over again, how everyone is exactly like you.\nSo you get mad, and you take them at their word, and you start asking awkward questions. Were they nicknamed Droolia? Did they get sexually abused when they wiped the drool away on their collar one too many times? Did they get denied medical treatment for their broken wrist because they didn’t cry enough to be in real pain? Can they look at a person’s entire face at once and see it all? Do they come home from school and lie under a blanket for two hours until their head stops echoing from the hallways? Do they know how to mix 50 mg of liquid Zoloft into 8 oz of orange-pineapple juice so the taste is perfectly hidden? How many friends do they have, and do they see any of them outside of Honors English? Can they scream, or do their vocal cords paralyze at the first flash of any significant emotion? Have they ever completed an entire test in physics perfectly, except for the part where every number—every single one—written down on their work papers was different from those given on the exam?\nOh. It turns out that was just me.\nI guess I really am different, then.\nNo shit. Get out of here. \nThe moment when the Uncanny Valley mask slips and people realize you really are just hideously outside the acceptable range of different is not a fun one. It stays very Not Fun. It extends past a moment and into a lifetime. The question is asked: if you’re not even allowed to fake being an acceptable human, what are you?\nYou’re disabled.\nI’m disabled. I’m not different at all, really, I’m much, much more like you than anything else—but that’s not seen, that’s not allowed, and so I am disabled. My Autism is not a cute, acceptable, or advantageous difference. It’s a disability. I was not born configured for this world, and it fell to me to make up that difference, and there were so many places where I could not close the gap.\nI am disabled, and I will never, never be content to call myself “different” again. When you are different it’s okay for you to not quite meet up with the rest of the world here and there, because most of the time, when it matters, everything syncs up. When you are disabled you don’t have that luxury. When you are disabled you have to prove, over and over again, that you are a real person—and then someone forgets, or you meet someone new, and you have to start again.\nThat’s not a difference. That’s a disability.\nMy name is Julia and I’m Autistic. I’m not different; I’m disabled. I can say it now.\nBut then, I didn’t have much of a choice.\n", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/04/24/disabled-not-different/", "title": "Disabled, Not Different"},
{"date": "January 31, 2015", "body": "\nThere are two stories I could tell you.One: I’m clinging to my roommate’s arm, trying to (re)learn how to walk in heels.Two: a friend sent me a pair of shoes.*****One: I wore heels, once. I was in a choir, a choir that was a Really Big Deal, and the high school girls had to wear character shoes. I got the lowest possible heel, and I was okay, mostly.I liked how they sounded on the floor, so sometimes I wore them in college, or to DD council meetings, or when I went to Washington. I think they had maybe a half-inch heel.I lost my character shoes in the move. Two years went by. I tore all the muscles in my left ankle, every last one, and I couldn’t go to physical therapy.I put on a new pair of heels, and I knew, instantly that I didn’t remember how to do this.*****Two: my life looks very different from high school. I am connected now, in some pretty formal ways, to hundreds of disabled people all across the world. A couple of weeks ago, one of those people, a Facebook friend who has done a lot to show me what living with pride and joy in a disabled body looks like, posted that she had somehow wound up with a pair of mary janes that were far too big for her. Did any crip femmes she knew want them?They were a size 11. I usually only have 1 pair of shoes at a time, and let me tell you, finding cute shoes in your size when you are over six feet tall is not easy. I said so. She sent me a picture, I noted they had heels, we worked out the logistics.A few days ago, they arrived. I was having a bad hands day, so my roommate helped me open the box.I did remember how to put them on by myself.*****I am autistic. Just like the screenings warn, I walked on my toes when I was little, and until I hurt my ankle this summer, I still did. I can dance, kind of, not really. In my own way. I have a lot of trouble with conventional femininity: I wear long skirts and long hair after a religious upbringing, but I don’t have the motor skills or the patience or the social-cognitive something for most of the work required to do femme traditionally. I can’t put on my own makeup or paint my nails; I can’t fasten any clothes that a typical six year-old can’t. I used to be able to pin up my braids, but I lost that skill sometime last year after going too long without OT. The day you see me with my hair perfectly coiffed and my eyes carefully made up, in a coat that buttons and boots with no zippers, is the day you know I’ve either been married or placed on a Medicaid waiver.Like a lot of disabled women hoping no one notices we’ve snuck into the professional world, I cling to the few scraps of traditional femininity I can hold on to with my teeth. My friend, another autistic woman in the workplace, calls it “femme-NOS.”Being able to wear heels again would be a big deal.*****“We’re gonna walk around the room,” my roommate says, and I nod and hang on for dear life.“Why did you want these?” he asks.“The gala,” I say, grimly. One of these days I am going to be dressed to kill.“Okay,” he says. At the last gala, he helped ferry me from guest to guest, guiding me through the crowd and staving off meltdowns and making the loudest night of the year mildly enjoyable.“We’ll have to practice a lot.”*****One of my other friends runs a blog called CP Shoes, about disability and shoes and some other things. I know as soon as I volunteer to take the shoes that I am going to want to write a thing for her. I’m writing, again, because some things worked out and I have a little more energy, a tiny bit of space for words left in my brain on the weekends.Some of my friends and I are starting to talk, in various places and various ways, about #DressingWhileDisabled. There are a lot of stories about disability out there, and not a lot of them look like our lives. We have to tell them ourselves. We have to tell them together.I sit down, and there are two stories I can write.One: I’m autistic, and there are things I have to learn and struggle with and overcome, like wearing heels.Two: a friend sent me a pair of shoes, and on a night dedicated to celebrating disability and community and the way my brain and my body glitch at each other, I’m going to wear them.I want to write a story about shoes and disability, about the connections disability community makes between people who are very short and people who are awkward crashing giants, about the ways my life has gotten so much bigger, about objects and ideas that get passed from person to person, about the ways that disabled women or crip femmes or we take care of each other when no one else will.We’re taking it one step, one story, at a time. And these are the stories I want to see.", "outgoing_links": ["https://juststimming.files.wordpress.com/2015/01/img_0436.jpg", "https://juststimming.files.wordpress.com/2015/01/img_0435.jpg", "https://juststimming.files.wordpress.com/2015/01/img_0443.jpg", "http://cpshoes.tumblr.com/", "https://juststimming.files.wordpress.com/2015/01/img_0445.jpg"], "link": "https://juststimming.wordpress.com/2015/01/31/dressingwhiledisabled/", "title": "#DressingWhileDisabled"},
{"date": "April 29, 2011", "body": "So you need to know about Kimba.I met Kimba three years ago. I walked into the lifeskills classroom at the middle school, and he was moaning and flapping in the corner. I kind of wanted to do the same thing but I didn’t, which meant that the teachers mistook me for a neurotypical like them, which meant that the first thing I got to learn about Kimba was that “he just tried to throw a chair at me.”I learned a lot of other things about Kimba in the next few days. I couldn’t sit within four feet of him, because he would attack me—he didn’t like anyone except his aide, and he went after her pretty regularly too. He had successfully convinced the teachers for an entire semester that he couldn’t read at all, only to be foiled when they gave him a puzzle of animal names and he completed it perfectly. The only words he said were “NO!”, “BUH-BYE!”, and “ONE-TWO-THREE-FOUR-FIVE!”, screamed like something was breaking. About a month after I first met him, I learned two more things: he was a foster child, and the previous night he had attempted to beat his foster mother to death and had almost succeeded.Here’s what I learned about Kimba over the next three years: he is incredibly intellectually gifted. He taught himself to read. He has a system in which he classifies every person he encounters as a different animal based on personality, appearance, relationship and attitude towards him, and the pleasantness of their encounter. He may be autistic, he may have various brain injuries, he might be selectively mute, he definitely had lead poisoning. He uses language obliquely, employing rich and innovative metaphors. He analyzes the symbolism in Disney movies, but his favorite television series is Kimba The White Lion. He taught himself how to use Google. He speed-reads. He spent the first nine years of his life in one of the most horrifically abusive environments my state has on record.Kimba and I, now, spend most of our time in lifeskills together. We are virtually inseparable. I was the one who proved that he could read far above the level he was assigned. I am the only person he willingly lets touch his speech-generating device when he’s having trouble finding the words. He’s held my hand when I randomly dissociated, and he’s grabbed my phone and texted KIMBA when he thought I was spending too long talking to the White House. When he wants to bang his head, now, he grabs my hands and I squeeze at his ears until he can breathe again. He puts his hands on my head and does the same for me.For three years, Kimba and I have stood (often literally) hand-in-hand, united, in our very different pain and very different ways, against a world designed to shut us out. I curled around him when he was having flashbacks and he copied my bitch-face and employed it against incompetent substitutes. I foiled his plans and told his general-ed teachers that he could, in fact, read very well, and he tried to teach me how to wink. When I left lifeskills for a while to attempt college I said good-bye and he held on and wouldn’t let go. I came back, defeated. We saw each other again and smiled with mouths that had forgotten how.I wonder if he got so mad at me for going to Washington because he had overheard what was going to happen next.While I was sitting in a humid room and watching as people stared at me and explained that the world would be better for everyone if we inconvenient autistics just didn’t exist, plans were being made to put Kimba away. While I was getting job offers for my distilled fury and ability to wax eloquent about how my life sucks, it was being decided that the considerable, unbelievable, overwhelming progress Kimba has made in every respect over the last three years isn’t good enough. While I was staring in disbelief as Geraldine Dawson pontificated about the suffering of “autism families”, people were sitting at tables, sipping stale coffees, and deciding that, since Kimba hasn’t recovered quickly enough from his trauma, he needs to be institutionalized.It was announced today, and finances should be finalized by next week. On Wednesday, June 22nd, Kimba will complete the seventh grade at the middle school. He will eat an end-of-the-year cupcake that we will make, as he will not be invited to participate with his general-ed class. We will carefully gather up the last of his projects and load them into the same battered backpack he’s had for three years, a backpack that will be thrown away with his projects that night because he won’t need it—any of it—any more. We will pack up his device, the notes we’ll have scribbled to his new staff saying he can read very well, actually, and here is a Kimba-to-English dictionary, you’ll need it if he ever decides to talk to you and the notes we’ll have labored over for him: love you, miss you, you’ve grown up so much, it’s going to be okay. We’ll smile, we’ll lie, we’ll tell him that he will love his new school and that we’ll be allowed to visit.On Wednesday, June 22nd, we’ll say good-bye and try to memorize what his smile looked like. On Thursday, June 23rd, he’ll disappear into a residential program.They said they know he loves animals. He can work on their farm.I now count three kids I know and have worked with who, since December, have been institutionalized. This is three out of ten. Five out of fifteen, if I push the timeline back a year. We incarcerate people because they kill other people, because they rape or because they steal or because they make our world unsafe—and now, apparently, because they are just a little too inconvenient. Funny. You don’t even get a trial when your crime is drooling or not talking, when your sin is PTSD or autism, when the thing you did wrong was being born and then not quite meeting expectations.You just get put away.I wanted to tell you about Kimba. I wanted to ask you what I am supposed to do tomorrow morning. I wanted to say that it doesn’t matter that things this wrong aren’t ever supposed to actually happen; they do anyways. I wanted to see if maybe, now, you understood—I don’t write to touch, to inspire, to move people, I write because this happens every day, I write because how are we supposed to keep on, I write because a thirteen year old boy is being taken away.I wanted to tell you about Kimba, because you have to understand that he underlines everything I say and write. I wanted you to meet him before he’s thrown away like human garbage. I wanted someone to give a damn. I wanted to tell you about Kimba because, because, because…….because I can’t save this one, because I can’t save him, because we have sixty-two days, because oh god, oh god, I can’t save this one, because I forgot that even this tiny little somewhere-only-we-know only exists because nowhere is safe and nothing is allowed us, because oh, oh, oh. Because they are taking Kimba away.Because thirteen is too young to die.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/04/29/this-is-why/", "title": "This Is Why"},
{"date": "August 3, 2011", "body": "My attempt to start a letter-writing campaign on behalf of this teenage boy abused for being autistic appears to have failed, so I am trying a different tack. Below you will find the text of the letter I wrote for him. If you can, please help me disseminate this far and wide in the hopes that it will reach him, and anyone else in a similar position. Add your own kind words, experiences, and links to or quotes from disability pride resources. If this picks up enough steam, I would like to start a blog exclusively for this project.Some resources to start:You Get Proud by Practicing by Laura HersheyDisability Shame Speaks by Laura Minges (make sure to follow the “next part!” links at the bottom: it’s a total of four pages and very, very good.)Speech (without a title) by…meThe Letter:Hi.\nMy name is Julia Bascom. You don’t know me, and I don’t know your name. I read an article about an assault you endured at your school though, and I want you to know that you are not alone.\nI’m Autistic too. There are millions of us just like you who have been bullied and abused too. It’s wrong, it’s horrible, it’s unfair and unacceptable and none of us, especially you, deserved it. And you are not alone.\nI was sexually abused by my classmates every day in Earth Science in ninth grade while my teacher stood two feet away. No one believed me. No one stopped it. Everyone laughed. But here’s what some very wise people said to me, later: just because no one believes you doesn’t mean it didn’t happen. Just because they laughed doesn’t mean it was funny. Just because they said you deserved it doesn’t mean you did.\nPlease, please believe me.\nI’m sure you’ve been told it wasn’t a big deal. It was. It’s a huge deal. Don’t doubt that for a second. It was wrong. They are in the wrong. None of this, absolutely none of this, is your fault. They are the ones who need to work on their social skills. They are the ones who lack some basic empathy.\nI can’t fix what happened to you, or to me, or to any of the people I know. It’s painful and humiliating and makes a person feel wrong and bad and powerless. Please trust me when I say that you are none of those things. You are not bad or broken. You are autistic, and you are also fine.\nYou deserve to be treated like a human being. You deserve kindness and respect and dignity. Someday, you will have those things.\nI am fighting for that. My friends at the Autistic Self Advocacy Network (http://www.autisticadvocacy.org/) are fighting for that. Even the President is on our side—he made a speech in March for a conference I attended that stressed that bullying and abuse are civil rights violations. We’re gonna win this. But right now, you just need to remember that you are fine. There is nothing wrong with you. All the bullies and abusers in the world can’t change that.\nYou can write back to me if you want to, or email me at juststimming@gmail.com. You absolutely don’t have to. But there is a whole community of us out there who want to help, and who are sickened and outraged every time this happens, and who will always support you and have your back.\nYou are not alone.", "outgoing_links": ["http://thautcast.com/drupal5/content/teen-aspergers-roped-and-beaten-school-student-teacher-erases-recording", "http://www.thenthdegree.com/proudpoem.asp", "http://www.raggededgemagazine.com/life/shamespeaks1.html", "../2011/04/05/speech-without-a-title/", "blank", "http://www.autisticadvocacy.org/"], "link": "https://juststimming.wordpress.com/2011/08/03/please-please-believe-me/", "title": "Please, Please Believe Me"},
{"date": "July 14, 2011", "body": "As Kimba starts talking and typing more, and as I start to develop working relationships with other students, a lot of my assignments in lifeskills have become centered around writing. Writing, being a writer (and versus being a speaker), and teaching (is this possible?) writing have thus featured heavily in my thoughts lately.Most of my concern lies with regard to voice.I am a writing snob: not because I am the most eloquent, grammatically-adept, perfectly spelled starving artist to ever grace the world with her words (ask me about my journeys with commas sometime, or my passionate love affair with fragments and run-ons), but because I am a writer. I am not someone who writes; I am someone for whom there is no other option. This is the difference between “I am someone who (hatefully, regretfully, anxiously) talks” and “I am a writer.” My writing, a complete opposite to my speaking, is joy and confession and a need for both of these things, and I hope this is transparent.I have talents that I’m not supposed to have: I can tell who crushes on who by how they stand, I can read strides, I can hear the tonal differences between an alto and a soprano singing the same line so clearly that to me they sing entirely different notes, and I can read through the lines and tell when a person doesn’t need to be writing at all. That, that is what makes me a snob, because I cannot abide a person putting pen to paper or fingers on keys when they don’t need to, when word choice is not as relevant and demanding and essential to them as breathing and syntax is about being correct and not about being evocative.I am a writing snob, and some of the kids in lifeskills are my very favorite writers.I could write pages of context about the impact of Kimba’s sparse, elegant, punch-to-the-gut syntax when he told me about being made to eat out of the trash, about spaghetti…no. Cheeseburger…no. Dogfood yes. Bad boy. Go outside. Stay in the yard.(Because bad boys don’t get to eat food, but they do get to eat garbage, or wood covered in old lead paint, and they get put and kept outside, and this was the first time he ever sat me down and tried to tell me something, and he can use much more verbose syntactic structures but he was more concerned with making damn sure I understood exactly what had been done to him.)I want Tanya to make a book from the story of her life she carefully encoded in her response to a picture I showed her of a balloon alone in the sky:The boy bought a balloon, and it was red. He was walking and holding his balloon, and then he let go because he was stretching up to the sky, and the balloon flew away. And he wanted that balloon, but it flew away and it stayed in the sky for a month and then it got struck by lightening and exploded. Kapow! Pieces of it everywhere. The boy bought another balloon, and he lost that one, too.(And the most important part of the story, she said, is that it is funny. It makes people laugh (because he loses one balloon, and then another). Not the boy though.What about the balloons? I asked.Probably not the balloons either, she confided.)I imagine handing these manuscripts off to a crotchety old Honors English teacher I had, who writes a biweekly column in our local paper that makes me want to throw rotten eggs because he doesn’t need or even really want to write, it drips through his every sentence, he just wants to stand on a box and pontificate and evaluate, though never himself. I imagine handing him these snapshots of my students’ souls and watching his red pens slash through them. The honesty, the effect, the things they say outright as well as in silence (he had what he wanted, it disappeared, he got a replacement, that disappeared too, it’s a funny story except for how it’s not at all), the things these intellectually disabled children can do without even trying that he simply cannot…they wouldn’t matter at all.He would be threatened by their voice.These students have voice. Interestingly, one is a selective mute and another rarely speaks above a whisper, but when they have a story, when they need to make you understand, they have more of a voice than almost any other writer I’ve read. I’ll take Tanya’s understated she taught me how to play UNO as a reason for letting her bully pretend to be her friend over the cheerful notices the teachers and secretaries send out about field-trips and costume fees or the “Rural New Hampshire And The Single Girl” column in the paper. Tanya is honest. Tanya isn’t afraid to mean it.A voice is something honest, a certain unique blend of said-and-unsaid, a particular flavor of syntax and vocabulary and control that stays with you long after you’ve put down the book and think you’ve understood everything you just read. It’s arresting and affecting, and my students have it in spades. I would submit that they’re really never had a choice in the matter and, given that few of them have had any practice in writing before this past month, they haven’t yet had a chance for it to be beaten out of them.(There is one student. Her mother refuses to believe she is intellectually disabled, or treat her medical problems, and insists that she must do the physically impossible and pass as normal. She is allowed to attend Special Olympics events, which her mother coaches for, as an assistant—she signs the other kids in and out and keeps track of scores, but she isn’t allowed to compete, or smile. She writes like a caricature, like a frightened and desperate mimicry of what she is told she’s supposed to sound like. She’s not allowed a voice. She can’t mean anything, and behind every sentence is a nervous laugh or a hiccuped sob.)These students aren’t writing novels, and they don’t let their voices out outside of specific circumstances: quiet, time with their thoughts, accessible method of expression, a clear question, and so on—the sort of things every writer needs. But because they are intellectually and/or developmentally disabled, because they need help spelling or scrawling, because their syntax is alternately sparse and cluttered, because they aren’t even really supposed to have thoughts let alone voice, because different means harder means defective means not worth it…because of all of that, it doesn’t matter what they write or how well they write it.(I find most publications too poorly written to bother with. I have a nightly debate concerning whether or not I should just erase everything I’ve written ever because it is so shitty. I want to emphasize, again, just how elitist I am about writing, how much of a snob I am, how low my expectations were when I sat down to write with them, and how much crow I’ve eaten this month.)These kids are writers, and it doesn’t matter because it’s not allowed, because their writing samples will be collected and graded and judged more harshly, against higher standards, than any of my essays in AP English ever were (go ahead, read the NH Alt. Assessment Standards and see for yourself. Come into our room and watch how these kids have to prove that they’re sentient on an hourly basis, and then please tell me why I still feel surprised when I see their essays thrown in the trash). People with no voice of their own and no belief that a lifeskills kid could ever have anything to say are the gatekeepers of who gets listened to, who gets read, and they superimpose zombie faces and stutters over Tanya’s stories and say we really need to focus on her handwriting.So you see, I’m supposed to teach writing, which is less a matter of direct instruction about commas and more a matter of facilitating practice in having a voice. Drawing is just looking, and singing is just hearing, and writing is just listening to your own voice. These kids need to be told, explicitly, repeatedly, by at least one fucking person, that they have voices, and they are valuable voices, and they deserve to be heard, and the first person they should want to listen to them is themselves.It takes practice.What I want to know is: how am I supposed to do this, and how can I justify doing this at all, when, as Kimba will be only too happy to remind you, the ones with voices just get their tongues cut out?", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/07/14/metaphors-are-important-14/", "title": "Metaphors Are Important: 1/4"},
{"date": "July 22, 2011", "body": "I think the first thing I need to say is sorry. You, you with the prettiest eyelashes in the world and bright liquid eyes that made me forget to breath when I forced a glimpse at your profile for politeness’s sake—you have done nothing wrong. Your only crime was being assigned a girl with an inexplicably broken computer who could break you simply by averting her gaze.I know I hurt you without even meaning to because you are kind and beautiful with a smile in your voice and you kept trying to catch my eye and coax a connection out. You never grabbed my face, you never ordered me to look at you, you never forced me to drown in your eyes, you just kept smiling and coaxing and worrying until you were a confused an rejected puppy. You never made that my fault, either: you wracked and searched yourself for what you were doing wrong, for how you were hurting me.I wanted to come back to the Apple Store afterwards, clutching the warm cookies I had purchased myself as part of the intricate bargain I’d worked out to permit myself to brave the mall alone. I wanted to come back, and smuggle you a cookie, careful of crumbs and keyboards, and explain.Beautiful boy, 12 people pressed into a 12’ x 12’ space hurts me. The lights and movement in the mall hurt me, the perfume and music pouring from Hollister hurt me, the building renovations and constantly shifting stores hurt me. I came to you reeling and battered and you, kind, beautiful boy, had me leaving the store with poetry in my head.(I wondered, kind and calm and perfect boy, if maybe you have an autistic sister or girlfriend like me, because I’ve never had such perfect, easy, accessible service.)You seem like the sort of boy who might understand, in your fingertips and the neglected spaces behind your ears, what I mean when I whisper about disability as violence. You might understand embodying a brain and a way of speaking and moving and an existence of violence and victimization and forced memory and reminding others. You might understand shattering between bones of steal and searching for glue. You might understand as being seen as fundamentally violent yourself.You might understand this, I think, because the compulsion to break and undo and ruin exquisite things runs as deeps in humans as our need to protect and hoard them, and I suspect the second leads to the first. This is cruelly and hideously unfair to everyone, but I suspect it is worst for the beautiful, breakable boys like you.I wish you well. I write to you because I can hardly write this to Kody or the others, and of course I’ll never send this to you. I guard my own violent and violated beauty too closely.I think my computer might behave now. Thank you. When I left I almost reached out and touched your arm. I almost tangled our scraped nerves together. I almost said “you have beautiful, beautiful eyes, and I do too, look.” I swallowed it down with a dozen quiet, desperate disclosures of I’m autistic instead and promised myself I’d write.The new OS installed beautifully.Thank you.~Julia", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/07/22/to-the-beautiful-boy-working-the-genius-bar-at-the-apple-store/", "title": "To The Beautiful Boy Working The Genius Bar At The Apple Store-"},
{"date": "August 23, 2011", "body": "I want to clear a couple of things up.1.I don’t have autism. I am autistic. This is important to me. It also doesn’t mean that I “see myself as a disability first and a person second,” whatever that is supposed to mean. In my eyes, I’m Julia. Just Julia. I cannot separate out which parts of me brain are wired because baby I was born this way and which parts of my brain should be marked off as AUTISM. Nor do I particularly care, to be honest. I am Julia, and a significant fraction of Julia is autism (and thus, via the transitive property, I am autism but that’s not the point). Am I a writer because I’m Julia, or because I’m autistic? My writing is good in its own right, I am told, and it’s also fundamentally shaped by my neurology–just like yours. I like Glee and Phineas and Ferb and also Sudoku. Am I allowed to have a personality and preferences, or just perseverations? Is my deeply and inconveniently round-about, pedantic, literal, and analytic way of thinking and using language a sign of a what a profoundly gifted child you were, Julia (and you know, no one ever tells the kids in the gifted programs that they see themselves as gifted first and human second, or that they should call themselves “persons who experience a label of giftedness”) or is it a symptom of some monster hiding in my neurons?I would argue that it’s both, and that it doesn’t matter. Being autistic fundamentally shapes how I perceive and interact with the world, with a million cascading and subtle consequences. I would not be the same Julia I am now without whatever parts of my brain can be marked as AUTISTIC (and that’s bad science in the first place, the brain is a whole lot more complicated and subtle than that, we know that there isn’t one gene or one wiring variation that leads to autism). I also wouldn’t be the same Julia I am now if I hadn’t skipped eighth grade, or hadn’t spent a summer at Stanford, or hadn’t been in choir ororor…I’m Julia, and I’m autistic, and I will apologize for, justify, qualify, neither.2.The dichotomy between being a person and having a disability is a false, and useless, one. It’s based in the notion that people with disabilities they can’t hide or that we can’t pretend to ignore aren’t people. In a certain, socio-linguistic, sense, that’s true. Disability is used to mean something inherently bad and wrong and scary and consuming and destructive and sick, and why would you ever want to include that in any way in your identity or personhood? I myself have said that in a perfect world, there would be no such thing as disability. But please, pay attention: it’s very, very important to look at how the same word can be used a few different ways here. In the above scenarios, where disability means bad, I’m quite literally talking about what disability means, what the word is used to signify, what attributes are assigned it, how our current modern Western society places it in context and value. But that’s not what disability inherently, objectively, physically and literally is. When a car is disabled, it doesn’t work the way it was designed to work anymore. Human beings, though not designed and constructed in factories like cars, are similar. There is a certain range of activities and capabilities to which most of us are accustomed. When someone isn’t able to match up, they too become disabled. Difficulty walking, talking, hearing, seeing, eating? Disability. This is what disability is.Notice, though, that when a car stops being drivable it doesn’t also stop being a car. Similarly, a human who can’t do some expected human things doesn’t stop being a human. In some contexts, a car that can’t drive is a bad car, worthless, lesser, low- or non-functioning. In others, though–art, architecture, scrap metal (remember, humans aren’t cars and these examples don’t have direct equivalents for us, please don’t try and find the scrap-metal humans), a car with an exploded wheel is valued positively. Similarly, in a world without stairs, using a wheelchair can be an advantage. In a world where everyone uses sign language, only speaking with your mouth is a disadvantage. Meaning and value and worth get assigned to people based on how useful their range of capabilities and potentials are for various activities. A person who can’t participate in the activity they are expected to is disabled. This is what disability means.A disability is a stigmatized difference, one we haven’t found a slot for yet. I would love for that stigma, that disabling context, to go away. The raw physical difference itself though? It’s a part of me, and I’m not going to hide it, ignore it, or lie about it.3.Quite frankly, it doesn’t matter whether or not I see myself “as a person first, and a disability second.” It’s not going to keep me safe. I know exactly what the other people in the store think when they see me rock, flap, cover my ears. On the internet, maybe, I have the luxury of expounding on the finer points of person-first versus identity-first language. In real life, in a world where our parents kill us, our classmates abuse us, and our employers are virtually non-existent? I really don’t have that luxury.4.As long as there are people demanding that I call myself a person with autism, as though I am just cohabiting with two different brains, one of which I should really want to discard at the soonest possible opportunity, I will call myself autistic out of sheer defiance. The autistic parts of myself are always what are going to be punished and cut away at, they are what are going to get me hurt and killed, and I will put them in the front where everyone else already sees them and fly them as a goddamn flag.5. I am not flattered when you say that I don’t really see you as autistic or it’s just a label. Because what you mean is that “I don’t really see you as Bad right now,” and while I am incredibly grateful for that safety, I am also furious that autistic means Bad at all in the first place and that I feel I have anything to be grateful for in that entire situation.It is, indeed, just a label. One without nearly the neutrality of, say, Campbell’s Chicken Soup. All your wishing in the world won’t change that, and taking away the words I have for my experience just hurts me so you can feel a little more enlightened.For the record, I don’t really see you as much of an asshole, usually.6.“But my child!” you say. “My child can’t feed themselves! My child needs diapers! My child cannot be left unsupervised! My child is medically affected!”Well, yes. Your child is disabled. So am I. I thought we were past that?(Is Stephen Hawking low-functioning?My child is no Stephen Hawking. Indeed. Neither am I. No offense, but neither are you.)So often the dividing line between really disabled (my child) and high-functioningaka not really disabled(you, a self-advocate disagreeing with me) is writing a blog post or making change for a purchase or reading. I remember being told that if someone can add and read, they can live independently. Well I hate to break it to you, but I am very good at both of those things and I can’t live independently, not even close. I just don’t think that this inability makes me worth less or nothing.I’m not disparaging the reality of complex developmental and physical disabilities. My own world must function in a parallel and yet fundamentally different and separate realm from even that of my typically developing sister. I have enough imagination, enough personal experience with my own disability, enough time spent living and working with other disabled people, and enough of an ability to hear what people who live with complex developmental and physical disabilities have to say, to know that in some sense it’s a question of scale and that the experience can be dehumanizing for everyone involved. I’ll spare you the gory details of my life, in part because they are private and in part because I refuse to be a self-narrating zoo exhibit. Been there, done that, Temple Grandin and Donna Williams are better at it. I’ll just say this: it never ceases to amaze me how an entry posted every two or three weeks in the ether about deserving human rights somehow reveals–or, rather, erases–the every intricacy and ramification of a person’s disability in their life. 7.If my child could write a blog post like this, I would consider him cured. Fascinating. Have you taught him how? Have you given him the time, tools, technology, and accommodations he would need to do so? Have you exposed him to the ideas this blog post runs on, or has he been sheltered and infantilized? Has he been given an accessible, for him as well as his audience, means of communication? Remember, behavior is communication, that’s Best Practice. Have multiple literacies been facilitated? Remember, everyone reads, everyone writes, everyone has something to say is the current forward-thinking in special education, especially for children with complex access needs. But you’re an advocate for your child, of course you must know that. Silly me, I apologize.Have his attempts at self-determination and self-advocacy be respected and responded to, regardless of form, or has he been taught that passivity is better?If he were to want to blog about his favorite cartoon, would that be okay? Or does it need to be serious, age-appropriate, legitimate-in-your-eyes business, every time, all the time–because there are no frivolous blogs anywhere on the internet, are there.If he were to want to document and share his thoughts via, say, music or a painting or an arrangement of objects, would that be okay? Or must it be words?Are there limits on chances for this? Is any human being ever stagnant?Oh, and by the way, your child is still a child, right? How many children blog, do you know?Sorry, I thought this was worth taking seriously.8.I am not going to make nice. It’s a common directive. We all want the same things. How can we ever expect anyone to listen to us when we can’t disagree respectfully amongst ourselves?I am not going to pretend that a power imbalance doesn’t exist. I am not going to pretend that when non-disabled people attempt to end a discussion with self-advocates they did not enjoy, it is with chastisements and pleas to just get along which hit about a million times harder when aimed at someone who’s been taught to have quiet hands and who’s first sentence was Iwantball PLEASE and who, when they were bullied, was sent to social skills training while their abusers were left roaming in powerful packs of friends.(In no other minority community is this level of power-play tolerated. You are not our voices, we are not the same, we do not want the same things, and if you aren’t disabled? Then by definition you are not a member of the disability community.)You have the power. If you do indeed, as you claim, want to be allies, then I suggest you start acting like it.(And, because I must be nice and patient and helpful and I must educate the people telling me to shut up: for god’s sake, if being an ally, let alone a super-special parent ally, is so very hard, check out PFLAG.)9.This is not a “disagreement.” You know what people disagree about? Pizza toppings, ice cream flavors, what Shakespeare meant in the third stanza. Things with small consequences.You know what happens when we “disagree” about disability?People die. People get aborted, people get institutionalized, people get sterilized, drugged, and neglected, people go without necessary support and services, people are dehumanized, people are abused, people are silenced, ignored, and erased, people suffer emotional and mental trauma and distress with life-long consequences.Just as “disability” has become an ugly word for a physical fact, so “disagreement” is being used, here, as a polite word for an ugly thing.I call bullshit.10.I started blogging, years ago, as a therapy tool, as a way to modify journalling so it would be accessible to me. It turned, slowly, oddly, and very autistically, into a method of communication. Now it’s one of the ways I advocate for myself and my people. Mostly I think of it as a survival strategy.On days like today?It’s just a lifeline.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/08/23/dear-autism-parents/", "title": "Dear “Autism Parents”,"},
{"date": "July 7, 2011", "body": "Sometimes I think the greatest crime in television is caring.Giving a damn is already practically illegal anyways, so it makes sense. A lot of the time, in fact, giving a damn is actually more of a punishable offense than anything actually offensive. I get yelled at for organizing books too efficiently, for Chrissakes. It doesn’t even stand imagining, what happens when we say stop it, don’t call them that, you’re talking about another person, do you mean to, do you understand, you can’t do that. When I ask someone to please don’t say “retarded,” it hits me, you’re working in a fucking special ed classroom for crying out loud, your student is three feet away, what are you thinking, it is agreed that the problem is that I can’t take a joke.I cried for ten minutes when they said “the ayes have it” last night and New York got marriage equality, and Dad told me to quiet down, he was trying to sleep. I didn’t know what was worse—not being able to tell anyone about the results, not being able to tell anyone about the newest cut that barely even stings anymore, or being so fucking grateful that at least I wasn’t called dyke, because we know how that one goes.(My brother gave me a sarcastic thumbs-up, and my sister told me that she’d known it would pass, and she’d give the rest of the country ten years. I wanted to congratulate her on being so blithe, I wanted to ask if she knows how long a wait ten years is, I wanted to remind her that at least mom would go to her wedding, I wanted to ask her if she’s ever watched people vote on her right to make a family and if she’s ever seen them vote it down. But that’s not funny or neat or easy and thus allowed, that’s messy and hurt and I would mean it, and so I kept quiet.)I was at the White House conference on bullying in March, which framed violence, in all forms—physical, sexual, emotional, verbal—against students as a civil rights issue. In a group discussion, some immigrant students from the Chicago public school system told us, in excruciating detail, about the physical, racially-based violence they experienced every day. They said that, whenever they tried to report this violence to a teacher or administrator, the same response would come back:“Why are you telling me this? You’re making me upset. You’re hurting my feelings.”(The students are being beaten, are failing classes because of chanted racial slurs whenever they sit down, are afraid to come to school. The teachers feel bad because the students are implying that perhaps, if they are not safe at school, the teachers are not doing their jobs properly. The teachers’ feelings are hurt. So the students, the victims, get punished again.)It’s not a racial thing. It’s not an issue of Teh Gay, or of cripples and madmen and fools. Strip away the aesthetic revulsion, the fear and the ignorance, the complicated socio-economic histories and the familial scars, and people still like to treat other as disposable objects, good for entertainment and not much else. We’re each other’s toys, and if we don’t amuse sufficiently then we probably need to be whacked a few times, the way you hit a CD-player when it skips. Maybe we need new batteries. Probably it’s easier to just throw us away.(Some people say we evolved the way we did because we’re so good at killing, and we certainly killed off our preceding species quickly enough. It’s a quick hop-skip-jump from amusement to mascot to mystery to menace, and broken human playthings seem to implicitly threaten that we’ll steal, or at least break, all the other toys too. Loss and sacrifice and discomfort and fear we might be next can all trigger our kill-switches, apparently.)Perhaps I’ve lived an exceptionally awful life, but I find that hard to believe when I watch flocks of smiling, popular people being silently unhappy together. There are reasons people lie about and keep secret how they feel and what they think, and I’ve seen one too many terrified college girls fighting and drinking and cutting all their hair off and then going to class the next morning with bright, store-bought smiles to believe that it’s just me.True, I get furious, sometimes, when I tell someone about being mistreated because of my autism and they respond with a tale of their own frustration at the hands of some cruel peer or unnecessarily draconian teacher or boss. One of these things is not like the other, and the whole thing never reads as anything other than the familiar “that never happened, that story isn’s allowed, let me show you the script, let me show you the acceptable ways to be and get hurt, too bad they’ll never apply to you.”Sometimes, though, these things are almost exactly the same in all the ways that viscerally matter. I’m abused because I’m a not-person. To hurt someone without using your fists you just make them feel like a not-person, or, at the very least, a not-okay-person, and you can do that to anyone. Everyone suffers because, as humans, we’re just naturally very good at hurting each other.Which is not to say that we aren’t also very good at making each other feel incredible, or at least happy, or even just warm and safe for an hour, and that can be enough. We have families and stories, and these are not only terrifying weapons, but also powerful things that can create a lot of good—and when they don’t, we can make new ones. There’s joy and beauty in the world, and sometimes another human seems to hold it all in the spaces between their joints.Maybe that’s why we hurt each other so very well.It’s all very stark and dramatic, and that’s a useful way to make a point, but life doesn’t come with points. Life comes kind of blurry and murky and bled-together and wonderful, and maybe looking back you can scoop some of it into a coherent narrative, but the words are never quite sufficient. After all, they said I could get married means something bright and happy, but there’s also something angry and resentful and undefined, because they never asked if their marriage offended me. And then we have to think about all the things marriage means and represents, and what it means for the couples who, watching the votes be counted, whisper that they’ll still love each other just as much if it doesn’t pass. Life is just too big for the words we have and the stories we learn, except for when it’s the other way around.Most of us don’t go around slaying dragons and going on quests of many miles. Happily-ever-afters are unsettlingly complicated, and the problem with slaying one Evil Overlord is that another always pops up. Curiously, Evil Overlords like to disguise themselves as people we rely on and must be polite to, and quests of many miles tend to consist of driving oblivious children to and from soccer practice, piano lessons, and gymnastics every day for ten years and never driving over and off the bridge.The mass of men lead lives of quiet desperation is a truism, but no one ever asks why, and if maybe it’s because we think we missed the train to something spectacular years ago and there’s no honor in what we have left, and so we don’t claim the words and stories we were taught to dream as our own. We grow up, and we stop reading children’s literature and picture books, and we’re told that archetypes and mythos are something besides history and biography, and we lose our sense of importance and solidity and any sense of ownership of our own story or right to any words which might mean anything.Stealing a person’s words, their ability to look clearly at something and see it and know that they do, is the smallest and easiest way to kill someone.What I mean is, I say child abuse, and people think of my student, caged and beaten and raped and made to eat out of the garbage for nine years. Well, yes and no—yes, because if anyone deserves those words, it’s him, and no, because things are rarely so harsh and vivid and obvious. There’s a reason children like him are so rare and his situation comes up in textbooks as a Worse Case Scenario, one of the Worst in the History Of Our State. Life is a game of ripples and things adding up and subtle variations.My student will never be the same because he never got to be not-afraid for his first nine years, until eventually he just couldn’t feel fear anymore. I will never be the same because they made me take my clothes off in the car once because I’d drooled all over them, and because I only had to be hit a couple of times before a raised voice was enough to have me looping those experiences and hitting my self, all on my own. His father hit him in places no one could see. I wished someone would just hit me one more time, now that I knew what I could do, so someone might believe me and maybe it would stop. One of those experiences is stark and dramatic and mercifully rare; one is quiet and common and so easy to justify, overlook, pass over. People see my student’s misshapen collarbones and fall silent in horror; no one notices that after a lifetime of being slapped and grabbed for flapping I can’t raise my arms from my side, because the whole point was to make me unnoticeable.Our situations are different, and so it gets decided that one of them doesn’t count. Similarly, people who have never had the horror of growing up in a community where you get taken away if you’re not good enough declare that since my student’s institutionalization was stopped at the eleventh hour, it doesn’t count. (Just like, if you run away fast enough from the homophobes on the street corner, somehow magically nothing could have happened. Just like if you never say no, you must mean yes. Just like, if they don’t put a gag in your mouth or knock you out, you should be able to fight them off.) I’m glad the world is so very tidy and convenient and adjustable that knowing you were supposed to spend the rest of your life somewhere unspeakably horrible because you just aren’t good enough has no effect on a thirteen-year-old boy. I mean, clearly someone needs to tell him this, as he for some reason feels otherwise. Someone should also probably tell his classmates, who now know—and who always knew, but now it’s reconfirmed and a little more fresh in their minds—exactly how unsafe they are.It doesn’t count because he doesn’t (we, they, you, don’t) count.There aren’t any stories about that.I have this niggling suspicion, though, that there are an awful lot of people in the world who have been told that they don’t count, don’t get to be in the stories, things were never quite bad enough, or maybe they were too bad to be real. I have this feeling that there are an awful lot of us, and that if we just stopped keeping ourselves a secret, we might blow that lie out of the water.This is where Glee comes in.Glee tells you, right in the pilot episode, that it’s about not-people discovering that they’re people. Oh sure, there are layers and complications and distractions and other features and a million different ways to say the same thing, but it really does come down to that. It always surprises me, because since when is that a story I see on my TV?We consume media in a context of constant, casual violence against some and dismissal of everyone else. We expect to be entertained in the middle of an environment in which no one, no matter how skinny or blonde or popular or perfect, can expect to be safe and happy for long. If our television program is going to do anything besides lie to us about following our hearts and happy endings, we’d rather it at least didn’t mean it.So Glee gets sneaky about it. They give us Bryan Ryan, a Special Guest Character who gets an entire episode devoted to what it is to be a closeted gay American without every actually showing any icky attraction to men. They delve down into layers of nuance and complicated human relationships and the terrible compromises we make and they talk outright about being closeted and cutting yourself off without ever pulling a visceral homophobic reaction from the audience because Neil Patrick Harris (and can we talk about that casting choice?) kissed a guy.That same episode we have Artie, our wheelchair-using character, learning how to tell people that he doesn’t care about his legs, he doesn’t need to be fixed, he’s got other things he’s worried about. Difference is, he’s not some sort of coded metaphor. You see his chair before you see him. And so all the other characters (and the audience) see is a poor, suffering boy (in a wheelchair, just a cripple bound to his chair) miserable because he can never achieve his dream of being a dancer. Artie spends the entire episode negotiating what all of that means, and how to make himself heard and believed through all the other noise, while, yes, getting a little sad that he can’t just get out of chair and make the entire problem go away. But the episode is called Dream On, and being able to walk doesn’t change the people around you.The point these two intertwined storylines make is that it doesn’t matter how badly you want people to hear your own voice, they much prefer the dream they have of you in their heads. It’s an entire episode, on the heels (and a continuation) of the similarly-themed Laryngitis, devoted to showcasing that on every level, from casting to costumes to musical numbers to the actual lines delivered, Glee plays around with metaphors and story-telling and scale and variations on an idea and performance versus experience to look at how humans negotiate the space around each other.(There’s very little joy in the Glee Club, sometimes, if that gives you an idea of what they mean.)We start out with the writers taking a complicated, unjust experience, stripping away the salient, fundamentally other part of it, and delving waaaaay down into it and all its complexity and nuance. It becomes a story about the fucked-up ways people treat each other, and the fucked-up consequences that has. The audience, to some degree, gets it, and likes it, because it’s not ANGRY, it’s not about TEH GAY, it’s not scary and divisive and other. We don’t have to change the way we treat whole classes of people because of this now, do we?(I think the point being made is that yes, we do, but it’s entertainment so if you don’t want to hear that, you won’t.)Probably the most frustrating part of Glee is that the show focuses on universal problems of human relation, but it’s aired in a world where only a few characters out of the oversized cast are universally regarded as human. The only two characters played and seen straight-away as human, right from the start, are Finn and Will. Besides being straight white middle class males, they have two other very important, tightly-linked things in common:\nThey’re allowed to rage.\nThey don’t hurt people on purpose.\nKurt (gay) snarls in his songs, Quinn (teenage pregnancy) yells that she’s furious, Puck (juvenile delinquent and Lima Loser) explodes and punches people and gets sent to juvvie, and those are all Bad Things. Finn kicks over a chair, Will terrifies his wife, and those things are fine. Those things are natural, healthy, human reactions to the (not-) people around them being awful. Kurt and Quinn and Puck learn to be angry quietly, to smile through their teeth, to take names and social security numbers and sometimes just to wait. Finn and Will are allowed to feel, and show, their hurt.Their rage is safe and predictable and about socially sanctioned things and won’t ever shake anything up. Kurt, Quinn, Puck? They might hurt someone’s feelings.They might make someone uncomfortable.They might ask someone to risk something.Kurt and Quinn and Puck can hurt people just by breathing, just by being there, and it will always, always, be deliberate. Finn and Will only ever hurt people by accident, and that’s the catch. Finn and Will are people. Good people. Good people don’t, can’t hurt anyone, and since Will and Finn are Good, and since they didn’t mean it to hurt, didn’t even know it could, it doesn’t.(They’re not like my student’s father, so obviously intent on destroying people, and so their actions have no consequences. They’re good, and if we feel hurt by them, then that’s our fault, and if we argue, then we’re bad, bad people, trying to sully their goodness. That’s just not who they are.)Isn’t that a cool trick?(That is the real reason my phobia of lifting my arms, and my student’s near-institutionalization, and so many other things, Don’t Count—what was done was never meant to hurt, and the people who did it don’t hurt, that’s just not who they are, the whole thing is really just better off forgotten, it doesn’t ever need to feature, it doesn’t (we don’t) count.)But what Glee does such an uncannily good job at showcasing is just how, exactly, anyone can make anyone else Not Count, and what that does to all involved. Simultaneously, it fleshes out people we see first through Will and Finn’s eyes—because we can’t see not-people through their own eyes—and turns them from cheap and easy stereotypes into painfully real, immediate, people. The process is messy and long—two seasons in and it’s still not quite complete—and it’s complicated by the fact that it happens with an audience going through the same process. People laughed at Bryan Ryan’s quips and cried at Artie’s tears and didn’t quite put the pieces together. The cast donned shirts stamped with their shame and sang about baby I was born to survive, and it wasn’t quite obvious enough to change everything.(It’s entertainment, it’s not supposed to mean anything, and it has to be packaged such that people can ignore the real parts if they don’t want to see them. It’s not allowed to count.)But a few of us get our words and our stories back, and if they were any more obvious about it, it wouldn’t work at all.It’s (we’re) all the same, you see.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/07/07/the-greatest-crime-in-television/", "title": "The Greatest Crime In Television"},
{"date": "April 5, 2011", "body": "This is a story about disability. This is a story about the politics of drool. This is a lot of things, and maybe you should just read it. 1.So I want you to imagine being born a drooler.We’re not talking just the adorable amounts of saliva an infant will naturally produce as their teeth come in. You grow up with that, sure, but then it never goes away. Some quirk of muscular development and oral-motor control leaves you with a constant stain of spittle around your lips and on your chin.You grow up.You have a small toddler friend or two, before anyone knows better. But you grow apart, and then one day in kindergarten you turn away from your playdough to answer someone’s “hello” and a string of drool lands on the tabletop.Your cheerful “hi” is answered with a laugh, a stare, a jabbing, gesturing finger.You remember your mother, always scraping at your chin with washclothes and whispering implored reminders to “swallow” and keep your mouth shut. You realize that no other kindergartener has sleeve cuffs which are crusty from reaching up to wipe their mouths every five minutes. The florescent lights above burn through your back, your playdough feels gritty in your fingers, and you’re sure that you’re about to melt under the table in a puddle of drool because you legs get this horrible shaking feeling as though they’re made of water. It spreads, and it’s like a wind or a shudder goes through your stomach and leaves your head empty and clear.2.You don’t realize it at the time, but you are one of the lucky ones, in a way. You do learn to go through life with your lips clamped shut around each other. You learn to swallow so that your mouth is always perfectly dry. Your fingers constantly flutter to your chin just to make sure. You spend hours each day just concentrating on the muscles of your jaw and mouth, more intimately acquainted with them than any other part of you. In some ways, you stop being conscious of yourself as anything except a mouth. The rest of your body seems far-away and empty, everything caught up in your war against your own saliva.It doesn’t sound it, but you are so incredibly lucky. If you just fake it well enough people don’t think of you as a drooler, just another distant and distracted and distrustful kid. It will be years before you are first called retard, and for a very, very long time you are sure you can get away with it, be just like everyone else with one tiny little secret.You never go to sleepovers or let yourself fall asleep on the bus, because you can’t control it when you sleep and you know that drooling is just a disgusting crime, grosser than eating your boogers and punishable in all sorts of intricately painful ways. But it really does seem as though, so long as you take some reasonable precautions and devote three seconds out of every minute to monitoring your mouth, you’ll be just fine.And then you’re in middle school and everyone is laughing at some joke and it happens again, in a rare moment of laxness, and then everyone is laughing at you or else pretending not to see—and you never thought that could actually be worse, but it is—and you realize that no, fuck it all, you’re never going to get away with or from this.You don’t want to be a drooler. No one wants to, and no one wants them. If there is one thing every middle schooler needs, it is to be wanted, even as just a friend, by someone. To belong, to fit in, to have a place where you are welcome. Droolers get none of that. But you’ll be fine. You’ll just try harder and take what abuse you get (because you deserve it, you can’t even control your own secretions) and everything is going to be fine.3.But your brain starts to shift a little.You hear your voice on a recording for your answering machine for the first time and you spend the next five minutes wondering who punched you in the stomach. That voice. Is it really yours? It doesn’t sound anything at all like the one you hear in your head, and when you ask your mom mutters something about sound waves and bone conduction but all you can hear is that stupid, round, fishy, wet voice that you’ve apparently been using all your life. You had hoped you were a lot of things, fierce and funny and smart and competent and cool, but that, that is the voice of a drooler. People don’t even need to see your baby pictures, they don’t even need to see you compulsively swallowing to the point that your mom takes you to a doctor and asks about tics, because they can tell the instant you start talking.You start to wonder if this is some great cosmic secret that everyone else got to know before you, and the thought makes you feel lost and sick and pathetic and you just know that you’d better be getting comfortable with that feeling because it’s going to get awfully familiar.And you fight, you feel like a baby kitten but even they have claws so you scratch and fight and do everything you can to keep that feeling of utter uselessness from settling permanently in you. You sign up for all honors classes for next year and you try to dress like the most popular girls and you try out for soccer even though you are the best in the whole school at tripping over your own feet and you are so damn happy when Eric asks you to the eight-grade graduation dance that you let him kiss you afterward even though he tastes like pepperoni and smells like too much cologne.And the kiss is horribly wet and sloppy and you are now known as the worst kisser in your whole year and you just want to die.4. High school is unremittingly terrible, even though you aren’t caught drooling once. But you make tiny mistakes in every algebra problem that create bigger mistakes and big, ugly red ‘F’s even though you are good at math and you love it. But your teachers talk so fast and you can never make rhyme or reason of what they say and so you spend your classes wondering how you can be so smart and yet so dumb and if you ever were smart at all and how are you going to past this test, and when that gets boring you draw passive-aggressive comics about your “friends” and their stupid boyfriends eating poisoned chocolates and getting stabbed with lightsabers. Everyone else bitches about long hours spent studying and you wonder if you should tell them that you are up until two every night just staring at your textbooks and worksheets and googling frantically and unable to make sense of any of it, somehow managing to string enough figures and terms together to create a passable bullshitting act that keeps you in the honors track with them. But you don’t tell, of course you don’t, because then people would find out and you can’t be found out again, you’re pretty sure they would kick you out of your classes and being able to scam your way into that elite little group of scholars is the only thing that makes you think that maybe you don’t deserve to die.But one ever tries to kiss you again, or even invites you to a single party for four years, and every time you remember this all you can see in a spot of drool swallowing up the latest 68 handed back to you in geometry.It doesn’t make much sense, but you come to see every little imperfection as a crack breaking across the surface of your act, ripping apart your pretensions of normality, of superiority, and it fills you with hate and fear and makes your nose ache with the smell of rubbing alcohol and your palms punch into your thighs until they bruise.It just steadily keeps on mounting up, and every morning you wake up with a sticky chin and damp pillow and it gets harder and harder to climb out of bed. You know you’re failing on every level, but you’re terrified of what will happen if you stop. So you get up, day after day, and emerge every day from high school battered and empty, and that awful feeling of watery legs and a shivering stomach becomes your default setting.You realize that you’ve never really left kindergarten. 5. The admissions officer asks you, sounding bored, who you are, what makes you tick. And you just sort of stare blankly back, because you’ve been trying not to think about that since you were five and somehow, explaining that you’ve spent your whole life just pretending, and passing, getting by and trying to blend in and not let anyone see how empty you actually are, just filled with drool…that doesn’t seem like the sort of answer expected.You realize that you can’t answer the question, you don’t know how to even begin to think about the answer, because sometimes you are so focused on swallowing and sealing your lips that you forget the rest of your body and just sort of bounce along the lockers as you navigate from class to class. You want to tell them that your earliest memory is of a washcloth against your face, that your first nickname was “Droolia”, and that this one special ed boy absolutely terrifies you because he has to wear a kerchief around his neck to catch his drool and what if someone connects you two? You want to ask if they’ve ever been sitting in English, doodling in the margins of a vocabulary worksheet, and then suddenly felt like they’ve been running for miles, so out of breath with their heart hammering in their heads, legs watery, shivering and shaking. You want to tell them that your least favorite thing to do ever is to go to the dentist, because your mouth is open and you can’t swallow for half an hour. You want to point out that you never smile for the camera, that you actively run away whenever a camera comes out because the area around your mouth is so slack and rubbery and you just cannot control it.You smile and say something about liking to draw comics and observe people for new material.6.You fall asleep on a pile of your comics at RISD, and when you wake up they are wet and sticky and ruined.They’re due tomorrow. Or today, actually, since it’s three in the morning. You can’t ask for an extension—what are you supposed to say, sorry I never learned to control my saliva, can I have an extra day to redraw them because I drooled all over them?You drop out instead.You drop out of everything.7.\nAnd the boy who pointed at you in kindergarten? Eric, who kissed and told? Your friends, who never bothered to ask why you wouldn’t come over to their sleepovers? Everyone who ever let you know, subtly and quietly, that you were fake and damaged and disgusting, who may have only said that out loud once or even never but who always gave you a million little reminders?The ones who broke you apart because a few of your muscles developed a little more slowly?They are just fine. ", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/04/05/diary-of-a-drooler/", "title": "Diary Of A Drooler"},
{"date": "April 5, 2011", "body": "Hi. My name is Julia Bascom and I’ve had it easy.I had it easy. What this means is that in fifth grade I was the smartest kid in the class. I also did a lot of hiding under my desk, and I talked funny and moved stiffly, so the other kids formed a club. It had only one rule, the golden rule: you couldn’t talk to Julia.I changed schools at the end of the year. I kept breathing, but then, I had to: I had it easy.No one beat me up. They didn’t have to—I did a good enough job of that on my own.I have a friend. We’ll call him Martin. Martin is autistic, like I am, although he doesn’t identify that way. In fact, nothing would make him happier than being just like everyone else. See, Martin and I are different. We both know that being different, being autistic, being disabled, is dangerous. We’ve both been bullied. We’ve both had it easy. We’ve both seen what our alternatives are—be just like everyone else, or don’t be anything at all.The difference between Martin and I is that I know without a shadow of a doubt that this is wrong. Martin doesn’t.Martin and I became friends because we were both worried about each other. Martin was worried because apparently no one had ever taught me how to pass for normal. I was worried about Martin and the way he was quietly twisting himself away. I only got more worried when he tried to teach me how to blend in, how to pass, when he yelled at me senior year for looking like that, because don’t you know you’ll get hurt, don’t you know you’ll die, looking like that?I have another friend. We’ll call her Maria. Maria has also had it easy. She’s autistic like me, but she is more visibly disabled than I am. What this means is that when we went to get ice cream two weeks ago no one would sit near us. What this means is that people think that because I help her count out the money to pay for her order I should be ordering for her. What this means is that Maria is not permitted to just neutrally exist in public. Getting ice cream becomes an act of war.I work with middle school students with significant disabilities in a mostly self-contained classroom. Some of them have had it easy—no one will talk to them, the other kids run away when they see us coming, the teachers don’t want them in their classes, but no one gets beat up. Some of them have permanent brain injuries from abuse. Like Charlie. Charlie goes into murderous rages and has almost killed people–he’s the sweetest kid, but someone decided to beat him enough that he doesn’t feel the world is safe for him. He’s right.Kaley hasn’t been to school in two months. The social workers are sent away from the house and the state is content to leave it at that. I don’t even know if she’s still alive, and no one seems interested in finding out. Roger, who can’t feel or control his tongue, was kicked out of his foster home and into an institutional placement three days before Christmas because he eats too messily. His ex-foster mother now visits him regularly and expects him to call her “mom” and say that he loves her.She says she loves him too.The hell of it is, the world agrees with her.Here’s the thing about being disabled: it sucks. It’s horrible in a million different ways, and not a single one of those ways is because I can’t do this or because I have this impairment. That would be too easy. Instead, every single reason translates roughly to because people are awful. Sometimes, for a minute, for a day, for a week, I think I can forget that. I delude myself into thinking that the reason I can buy ice cream without five different hostile stares, can be allowed to work in a school, can be invited to the occasional party, is because people really are okay, and not just because I have learned how to fake being normal, being human well enough to avoid some sort of weird ability-based xenophobia.I’m wrong, of course.I just spent seven hours at a conference about bullying. Here’s the genius behind really good, really effective bullying: it turns the victim into their own worst bully. I told you I never got beat up for being autistic. I want you to take a good look at me. See my glasses? Those are because I damaged my eyes banging my head in tenth grade. See the spots on my arms? Those are from where I tried to gouge out my skin all through high school. See the scars on my face? Those are a little more recent—same idea though: self destruct. There are a million more I can’t show you—even the insides of my cheeks are scarred. I can’t tell you how many pairs of sheets I’ve had to throw away because I woke up covered in blood—I’d tried to pick myself apart while I was sleeping.I didn’t do this because I was depressed, or scared, or because I hated myself. I didn’t want to hurt. But I  knew I had to. When I hurt, I was in my place. And smacking my head against a wall for an hour a day was ultimately less painful than trying to convince myself, let alone everyone else, that I was maybe, possibly, worth something just the way I was.The thing about bullies is that, although they never go away—I went to a different school with different kids after fifth grade, but there were always plenty of bullies to keep me remembering—they cannot be with you every second of every hour of every day. They can do hundreds of subtle and nasty things to you, and they will, but eventually they will need to pee or go home or at least sleep. So what they do is program you so that you can continue to bully yourself in their absence. I still hear the chanted retards in my head whenever I play with a strand of beads. I still believe, in my stomach and pulse, the way you know to run from a lion or don’t jump in the campfire, that I shouldn’t be here.I don’t need someone yelling at me to sit down, shut up, stop flapping—I do these things automatically now. No one needs to tell me that I’m worthless—I get that. Message received, message believed, message drilled into my bones. No one has to threaten and force me into some version of myself that is less visibly disabled, less obviously autistic, less real and I guess less threatening—I’ve carved off all those edges of myself into a smooth facsimile of what I need to be.(That’s the only reason I’ve ever “had it easy”. Because I could do that. Because I have, or had, the rare ability to pull myself apart and twist myself into some new shape when ordered. I’m lucky, in other words, that I don’t have any glue holding me together. Lucky to be broken, because then there is nothing left for someone else to break.)What I’ve just described is “having it easy”, and it’s actually not easy at all. It’s complete and utter psychological and emotional warfare, and there is no winning for us—they, the bullies, set the rules and the terms and they always win. Millions of us live like this every day—we have it easy, we can’t complain, this isn’t something that can be solved with curb cuts or an act of legislation, and so we die the death of a thousand cuts.I told you about Martin, earlier. Martin always beat me on quizzes in class, but there is one thing I know that he doesn’t. I know that this is bullshit.Here’s the secret. There is, in fact, one way to beat the bullies. See, what they want is to work themselves out of a job, to have you doing their dirty work for them. They want you to beat yourself up. So the way you win is by stepping out of the game entirely. The way you win is by knowing, being absolutely and irrevocably and 100% positive, that they are wrong.It’s the tiniest thing.It’s almost impossibly hard. How do you discover the world’s best-kept secret: that despite what you’ve been hearing since you were two and your parents started dragging you to doctor after doctor and the other kids stopped playing with you that you are actually perfectly fine, just fine?When you are disabled, you are sick in every sense of the word. Disgusting, scary, dangerous, broken, wrong. Lesser. I knew this, had it memorized and lived my life accordingly. But one day I met someone else who was sick. “You’re sick!” I protested when they insisted on acting like a human being.“Yeah, I am.” they agreed. “So are you.”And then one morning I woke up. I was still sick. And I was also fine.I was fine.There is no equivalent to a GSA for disabled kids. We have to pass it on like a secret. You’re okay. We’re okay. Everyone else is wrong. We have a right to be here too. We’re not just sick. We’re not in doctors’ offices all the time. We’re okay. We need that support, need some sort of physical community. Passing it on like a rumor isn’t enough. The moment we realize that the hateful people who fill and control our lives are wrong is the moment when everything can finally start to change. That moment shouldn’t even have to happen—it should be something that we just always know.Things won’t get better until then.Good-bye. My name is Julia Bascom, and I am, always have been, and always will be, fine.Thank you.     ", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/04/05/speech-without-a-title/", "title": "Speech (without a title)"},
{"date": "September 4, 2011", "body": "I received the feedback forms from the presentation I gave in August. The responses were uniformly positive—I’m just not sure I can trust them. See, I was described by various respondents as “inspiring,” a “kid,” and “a very good role-model.” (But relatively “empowered” and “self-sufficient,” as opposed, one can assume, to the Real Autistic People.)Can we talk?First of all, let’s get this out of the way: I am not a kid. I am, indeed, rather young, and as embarrassed about that as I am, there is nothing wrong, really, with calling me a kid. I call myself a girl. But calling my co-presenter, who just earned her doctorate, a kid? Makes me suspicious. It makes me remember how in popular conception there are no autistic adults, only children, and the children never grow up (or even reach puberty.) It reminds of how I listened to a man giving a presentation about a “community” he was designing for “children with autism”—except every one of these “children” was over the age of 21. When asked, he explained that “I call them children because they will always be children to me.”And when that is the dominant context for these discussions? Then no. You do not get to call me a kid.Similarly, “inspiring.” I’m amused that the same qualities which make me a failure and a disappointment in one context make me inspiring in another. But it’s not funny at all. I write and present furiously about injustice, about violence, about the things they do to us. No one who actually hears what I say walks out of the room inspired. They walk out furious. This? Is not inspiring. It’s terrifying. I don’t write to move or to touch, I write to survive, and it’s only inspiring if you paint over all the pain fueling it and everything it’s about so that you can enjoy the utterly adorable sight of someone trying to advocate for themselves.(At the conference, Zoe asked DJ how he dealt with hate-speech. He told her to be brave, because that’s all you can do in the moment. A woman sitting next to us was so touched that she teared-up and put a hand over her heart. Not appalled that we live in a world where people argue about whether or not it’s morally justifiable to kill us. No. Inspired by our adorable attempts at bravery.)I’m not performing for you.This is not about your reactions.This is not supposed to be easy.It’s not easy for us at all.I’m not a good role model. I’m far too angry and unpredictable for that, and if I were to mentor anyone the first thing I would tell them would be  “figure out how you want to be.” There’s not a correct way to do this, there’s not one right way to be an adult autistic, there are no acceptable autistics, and it terrifies me and sickens me and makes me worry about what I did wrong to make someone think I could be any of those things.Finally. I am utterly fascinated by the use of the descriptors empowered and self-sufficent. Those are great words, and I plan on adopting them. But saying I am those things, and other autistics aren’t or can’t be, tells me, if I had any doubts still, that you sat down for an hour and fifteen minutes and didn’t hear a word I had to say.", "outgoing_links": ["../2011/04/29/this-is-why/"], "link": "https://juststimming.wordpress.com/2011/09/04/patronization/", "title": "Patronization"},
{"date": "September 22, 2011", "body": "Blogging: not actually an ADL!\nWriting long-form: not actually the same as being able to have a conversation!\nWriting things on your own schedule: not the same as employable!\nVerbrose speech/writing: actually a symptom of ASD!\nAutistic adults: once rumored to have been autistic children!\nThe people you’re undiagnosing: actually have issues with feeding, toileting, sleeping, self-injury, communication, and independent living!\nPrivilege: a word that means something!", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/09/22/memo-re-self-advocate-bloggers/", "title": "memo re: self advocate bloggers"},
{"date": "April 5, 2011", "body": "Writing is a struggle against silence. ~Carlos FuentesPassing as a non-autistic, passing as neurotypical, means that you never get to actually be human. Be a person. You just learn how to get really good at faking it. It’s not good, it’s not healthy, and yet how can you say no to a trick that gets you the human treatment, college, a job, a future, some sham at self-determination?But that’s all it is: a sham.These things have costs and consequences. You can bottle things up for so long; you can pretend to be someone and something you aren’t and never will be; you can do things which are exhausting, even actively harmful in pursuit of “passing”…But in the end you are still an autistic. An autistic who doesn’t know how to be an autistic, much less a person, never mind an autistic person. And that’s an important thing to know how to do.How to be.Who to be.Anatomy Of A MeltdownMy brain likes to alternate between being made of swiss cheese (full of holes to fall in and through and down) and wax (for optimal melting). I have meltdowns a lot, in part because I use the term “melting” very broadly. Meltdowns, moments in which one’s brain melts, are a physical thing, though they look different moment-to-moment and person-to-person. But they all start out the same, with that pressure behind the skull and the feeling of your thoughts evaporating, your language freezing, your body retracting inward. It’s called shutdown, meltdown, violent meltdown, tantrum, outburst, dissociation, a million different things, but they all refer to the moment wherein your body or your brain, independent of your vote, decides that it simply cannot and will not continue to function in this charade that wasn’t really working anyways and…Well.Maybe you don’t bang your head, scream, throw things, leave. Sometimes I don’t. Sometimes I do. Sometimes I incur brain damage. Sometimes I just sit frozen for an hour.Passing tends to come to a halt when this happens.Meltdowns are of course a bit more complicated than all of this. What they are, to me, is a descent. A black hole opens up and draws you in, in, in. It’s empty and silent and ringing with screams and your intestines get itchy and try to crawl up out your throat, or maybe that is just the pressure everywhere building, building until it explodes out or locks you down.The worst part about any of it, for me, is the silence.The complete and utter silence. Silence so deep it fills up your ears. Silence like a scream.And what’s worse is that, when I’m melting, as I enter or exit, I am silent too.It’s why I type so frenetically. Why I get so upset when the words don’t mesh just right, or when they build up and won’t come out. That silence is to be avoided at all costs. When I’m silent, when I have no voice, I might as well not exist. I don’t, really. I’m not properly a person. I must speak, type, make my voice project over their heads and into someone’s ears.Anatomy Of A Passing PersonPassing is….Passing is…Well, passing is difficult, first of all. It’s constant anxiety, calculation, cognition, because remember, those of us who pass are trying to be a person we aren’t, a member of a species that, should it know our true identity, expels us. The trick to passing, to passing well, is to make it look natural.Passing means repressing, memorizing rules, sublimating, jumping through hoops, and turning tricks so we can get the human treatment. It means making it so that when you reveal your diagnosis to someone they “never would have guessed it”.Passing is supposed to be a good thing. It’s convenient for the enabled and beneficial for the passing. The passing gets college, health care, respect, an audience to speak to, friends, work, a house, etc.What I want to know is why do I have to pass in order to implicitly deserve any of these things?What I want to know is since when did being treated like a human being have requirements?When I am actively, deliberately passing as nonautistic, I am supporting power structures I benefit from. I am saying through my actions that it is okay to divide the human race along these lines, to treat people who fall outside of these lines like this, to save all the privilege and benefits and nice things for the safe normal people, etc. And you know, there are a million reasons to deliberately do this, some of them okay and a lot not, but in the end I am still supporting and ironically benefiting from a power structure designed to oppress and disable me.But there is nuance to this. Silence is safety, of course, and being safe is important. And we aren’t all cut out to be radical, kyriarchy-smashing activists.And what of those of us who pass without really trying all that hard?There is a certain amount of ridiculousness to that idea, of course. Of course we have to try hard, speaking (speaking!) and socializing and reacting and parroting like the neurotypicals around us takes effort even (especially?) when we don’t realize it. Being a fake person, a half person, a glass girl or a ghost takes work. We tend to burn out eventually, no matter how brilliant a job of faking it we were doing. Or maybe we develop depression, anxiety, dissociation secondary to our autism as a result of this facade? Perhaps we take an increasingly upped litany of pills to cope. At the very least, we spend so much time learning how to be an acceptable human being that we forget, or never learn, how to be an autistic one.Or to question why the one isn’t the same as the other.Anatomy Of A MonsterAnd what none of us passers want to talk about is what our passing does to those who can’t. Passing is necessitated because without it, we would be stuck being a Scary Disabled Person and everybody knows how well their lives are allowed to go. There is a pervasive, fundamental belief that disabled people are monsters, or else possessed by monsters. That disability is monstrous, and disabled people, by implication are either victims or monsters ourselves. And therefore any and all talk of accessibility, universal design, human rights, equality, self-determination, alternative modes of communication, interdependence, what it means to be human and in a communication, what needs are and what it is to have them, etc etc etc goes out the window. Our bodies and lives and minds can be medicalized and politicized, but our voices are silenced and we get redefined as not quite, or not even close to, human.Maybe it’s that view, of autism as monster and we as victims, which makes people recoil so much from the word, from the idea, from the concept of someone who will need 24/7 assistance and someone who won’t but has the same label. People don’t know how to treat victims, except by recoiling, as if bad luck is catching. People don’t know how to treat disabled people except as someone blend of horrific and pitiful, and by doing so we are dehumanized and re-conceived as something manageable and avoidable and yes, monstrous. Unhuman.To be disabled is to be dehumanized. To pass is to be re-humanized as an acceptable, safe version of yourself that does not actually exist.﻿Well. Hi. My name is Julia, and I am autistic, and I am neither horrific nor pitiable nor monstrous, and if I am so what? And I pass. Mostly. For now.That’s right. There’s a monster in your midst.Anatomy Of An AutisticSo it looks as if I have two options. Pass and learn, perfect, the art of being a person I’m not. Or don’t, and let everyone else define me as some entwined version of monster and victim, pity and revulsion and terror.But there’s actually a third option.I can humanize myself. I can define myself. I can speak for myself, as myself.I can find out who that self is.I can lean what it is to be an autistic adult.To be honest? I don’t have the faintest idea how to do that, and I don’t think you do either. It’s not as simple as flapping in public or typing on my laptop when speech is too much. All I know how to do is pass, and to interrupt that passing with moments of confusion, furious honesty, rawness and vulnerability. The emphasis in education and intervention is to make the child look nonautistic, not to prepare them for a future as an autistic adult. And there a million more posts in here, and I will go back to writing them eventually, but the point is that a whole generation of us have graduated, we can pass now, and we don’t know who we are or what to do.The anatomy of an autistic is a lot of sketched out, smudged charcoal lines and open uncontained spaces. It’s a free space to develop. It’s something that will fill in as disability is humanized, normalized, as autism is accepted, as I am allowed to be who and what I am and to drop the poor facade that got me so far without risking losing it all.The anatomy of an autistic is perhaps a scary thing. So few people have filled it in before, and even those fleshed-out illustrations have been crossed out by the dehumanizing, pitying, horrifying interpretations superimposed by others. But there’s a whole generation of us coming.And I? I at least am going to work it out.Hi, my name is Julia, and I’m autistic. It’s probably the best thing about me. Check your assumptions at the door.We write to fill a silence here. ", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/04/05/anatomy-of-an-autistic/", "title": "Anatomy Of An Autistic"},
{"date": "April 10, 2011", "body": "Last year my parents and I were talking about prenatal testing. It  comes up—I work in a special ed room, I had just learned about the  abortion rates for Down Syndrome, we live on a street with four autistic  kids, and I was discovering the Disability Internet. So I asked if they  would have aborted me had they known how I would turn out.My parents told me last year that, had they known I would have been born autistic, they would have gotten an abortion.My parents would have aborted me.I kind of want to just stop typing there.This is real. It happens. It happens all the time.(I know five other sets of parents with adult autistic children who  have said the same thing. I have yet to find a pair in real life that  wouldn’t. This is real. It happens.)It’s all fun and games when I snark about ableism and eugenics and  people respond with condescension and strawmen and the same  non-arguments I’ve heard hundreds of times before. It wants me want to  write additional fun facts about how the usual silencing tactics in this  conversation are ineffective against me—you can attribute to me things I  never said, but I won’t defend them because I am autistic and your  errors, while interesting, are mostly just amusing and kind of annoying.  I’m used to people not listening. It was the first fact I ever wrote  about.You know what’s not fun and games?My parents would have aborted me.Even knowing me, (then) eighteen years later. They would have aborted me.It’s not that we don’t love you. We just didn’t know if you would have wound up like that kid up the road.I don’t write as some Super Shiny Aspie (TM). I write as someone who spends her days with that kid up the road.  I write as someone who has spent the past year of her life as someone  who was told that her existence is a lamentable mistake caused by a  technological lag. I write as someone who belongs to a group that isn’t good enough to be allowed to exist.I’m not putting this under a cut. I want you to have to scroll  through this. I want to scream about the gaping, oozing wound carried by  every autistic—the you shouldn’t be here written in the margins of our files—and I want someone to listen.The reality of an autistic person is this: your parents didn’t want you. They wanted a child they felt they deserved.  They go to support groups and have a mourning period after a diagnosis  which takes place in a cold white room with whispered voices. They are  probably told to put you in an institution—as you play at their feet—or  else you are subjected to hours of behavioral modification which does nothing for your ability to function as an autistic person and maybe a little  something for your ability to embarrass your parents a little less.People give up on you.You go to school and the other kids call you retard, never  bothering to learn your real name. You don’t sit with anyone at lunch.  You play by yourself and you like that better than the abuse. The point  comes where you realize that you can’t lift your arms anymore. They’ve  been slapped so often for flapping that you have a terror of moving  them.You learn that different means harder means defective means not worth it.Perhaps, like everyone else, you are born knowing that. One day you  realize it’s meant for you. This is probably the same day you receive  some official confirmation that people would really rather you weren’t  there.Everyone is generally very nice about it. What are you supposed to do about the nice people who don’t want you there?You start, maybe, to learn some words to describe what it is to be you. You aren’t sure that they’re entirely the right words—you’re learning them from other autistics, and they get yelled at  a lot of speaking up and trying to help you—and everyone else insists  that they are very much the wrong words. You keep trying, though,  because it’s the first time anyone’s ever let you think that maybe no one is ever good enough to exist and yet we keep on existing, and that means something to you.Eventually you start saying these things on your own. (Maybe. If  you’re lucky. If you’re listened to by anyone, which is a crapshoot  anyways.) After a while you stop being confused by the things people  yell back at you, because you realize they have nothing to do with what  you are saying, and everything to do with you saying something.The reality of an autistic person is this: you shouldn’t exist, and your defiance means you must be punished.So no. I’m not anti-science. I don’t think being disabled is super  fun. I don’t think anyone deserves to suffer, ever. (And, because I  mention abortion, I’m also pro-choice!) I’m mostly someone who is tired  of being run off the rails whenever she suggests that maybe she’s a person, too or that’s not very nice with very rational, condescending platitudes about intent and think of the family members and your life is wrong, that never happened and this must be so difficult for you, let me explain and above all: you’ve got it backwards, the world is actually flat.I am someone who should have been, would have been aborted.I am finally, finally speaking up for myself. You don’t have to  listen. But you don’t get to tell me to shut up because my voice doesn’t  belong. You are certainly allowed to take what I say however you want,  especially as a personal affront directly targeted at you (I once used a  similar configuration of words to something she is snarking about! I am  the only person who has ever said this to her ever. She is attacking me, or at the very least responding directly to my mutterings. This is  probably as close to a conversation as she can manage!) I understand  that it must be very hard for you, hearing all of these inconvenient  people speaking up and speaking out and making you uncomfortable. I will, however, ignore you attempts to make me shut up, stop, go die and speak a little louder instead.I should have been aborted, and that is real, that is common,  and I will share that story over and over again until I (finally) die  because nonautistic people seem to think this conversation reduces down  to something other than please go away you are scary.My reality is that I’m not supposed to exist.But I do.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/04/10/this-is-our-reality/", "title": "This Is Our Reality"},
{"date": "April 5, 2011", "body": "It’s a grabbers vs. flappers warzone.On the one side are the flappers. We wave and twist our hands in front of our faces or slap them against our chests. Our heads punctuate our moods and the music against the wall. Our knees don’t bend as we walk on our toes, our fingers pick at cuticles or scratch patterns against our forearms and cheeks, and we’d rather watch spinning pinwheels than drown in another person’s eyes.(Our joy is own own, and we communicate it differently, perhaps holding privately onto it, or pouring it out into another person. But soon we learn from the grabbers that our joy should be our shame, our movements not our own, and so we withdraw.)What else is there to do when you are surrounded by grabbing hands but shrink in on yourself?The grabbers don’t believe that we can be happy or find meaning unless we are exactly like them—and that’s really the goal, being just like everyone else, and so there is not even a second of hesitation in their eyes when they slap our hands down onto the table with a shriek of “quiet hands”.The hands are everywhere.They’re at our chins. “Look at me,” with a face pressed in so close to yours that you count the pores until they force your gazes to meet. They grab our hands, “don’t do that, people will think you’re retarded.” They smack away picking fingers, because our foreheads must be pristine and easy-to-look-at for them. You turn away, pull away, try to put some distance in so you can breath, and they grab your hands, your hips, your shoulders and twist you back. You bounce your leg—surely you are allowed this?—and they press a hand to your knee, stilling you. Everyone taps their pencil, but when you start their hand closes over yours and won’t let go.“Please let me go!”But protesting just means you need to be grabbed more often, with harder and more insistent hands, until you realize that the way you move is fundamentally wrong, as wrong and deficient and disturbing and dangerous as you are, and if you want to be counted as a “you” at all you must let them grab you until you can stop your self. The most basic human thing is just existing in space, and you quickly realize that you do even this wrong. Is it that you take up too much space, or just that you do it too differently, moving in an entirely alien way and triggering some sort of dormant xenophobia?In the end it just comes down to you are wrong, and for that you must be punished. It simplifies to your body is not your own, but it is mine. And you learn that a relationship, if you can call it that, always has two roles, a flapper and a grabber, and you will always be grabbed, and never be permitted to grab back.", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/04/05/grabbers/", "title": "Grabbers"},
{"date": "September 27, 2011", "body": "I’ve told this story before.I didn’t have any theory of mind until I was 13.5. I have a very poor autobiographical memory, but I remember the acquisition vividly. I was in gym, attempting to serve a volleyball, and I turned to Sarah, monologuing in my head about something (a strategy I had developed last year to help me with thinking) and she was thinking. I had a mental stream of consciousness in my head. So did she. I looked around the gym. So did everyone.I was thinking about them. They could think about me.I would never feel safe again.A lot of things changed with that realization. I’d never gained any information from eye contact, but now it terrified me. I’d been abused by my peers, but now I realized that there was a persistent mental component as well. That they wanted to hurt me. They thought about me being confused and scared, and they liked it. I’d been doing very well without any sort of therapy or medications for almost a year—I was back at the doctor’s within a month, got another new therapist, and soon started medication. My panic attacks began to last upwards of 36 hours. I started banging my head. I damaged my eyes. I started gouging out my skin. I got a staph infection, and I almost died, twice. I am covered in scars and discolorations.I am told that I was not, before this discovery, an anxious child. I generally felt safe.(Inside, if not out.)I owe a lot to my discovery of theory of mind. I just can’t think of one positive.I can’t pass the Sally-Ann tests, even now. The language confuses me. But I do know, now, that other people have minds, and they can think with them. About whatever they want. About me.Which means I will never, ever be safe. I never was.After all, it’s not just that other people have minds. It’s that they can think things I don’t. They can be thinking about me without my knowledge. But it gets worse.They can be wrong.Maybe because I’m autistic, and people think (there we go again, theory of mind) that this means I am a robot. I would love to be a robot, personally. I am always very concerned with accuracy. The thing that upsets me most about “autism science,” isn’t actually the dehumanization and the consequences—it’s the bad science. The most terrifying and distressing thing in the world to me is something being incorrect.Maybe it’s because I’m autistic, and thus a robot. Maybe it’s because I’m autistic, and therefore a simpler, lesser, smaller brain and in desperate need of order. Maybe it’s because I’m autistic, and therefore abused, and I know the consequences of acting on mistaken beliefs about someone, know them in my bones.It’s terrifying.My ability to acknowledge other minds means that I can converse more effectively than I could before. It also means I am never, ever safe. It means that I can see people being wrong, and I can see other people accepting and believing and spreading the misinformation, and I have to keep quiet. But to me, danger and anxiety and this is wrong are all the same.So I am never safe.I have theory of mind, now. I’d like to call it something more accurate.Maybe theory of war.", "outgoing_links": ["http://crackedmirrorinshalott.wordpress.com/2011/08/26/inside-and-outside-safety/"], "link": "https://juststimming.wordpress.com/2011/09/27/theory-of-war/", "title": "Theory Of War"},
{"date": "April 5, 2011", "body": "I am autistic. I can talk; I talked to myself for a long time before I would talk to anyone else. My sensory system is a painful mess, my grasp on language isn’t always the best, and it takes me quite some time to process social situations. I cannot yet live on my own or manage college or relationships successfully. I can explain, bemoan, and wish away a lot of things about me and my autism: my troubles finding the right words to say what I really mean, my social processing lag and limits, my rubbery facial expressions, my anxiety, my sensory system’s dysfunctions, my brain’s tendency to get stuck in physical self-destruct mode and land me in the ER. I can complain about the suckiness of being socialized and educated as an autistic and as an outsider, about lack of supports and understanding and always needing to educate.One of the things about autism is that a lot of things can make you terribly unhappy while barely affecting others. A lot of things are harder.But some things? Some things are so much easier. Sometimes being autistic means that you get to be incredibly happy. And then you get to flap. You get to perseverate. You get to have just about the coolest obsessions. (Mine are: sudoku and Glee. I am not ashamed.)Now, maybe you do not understand. Because “obsession” and even “perseveration” have specific dictionary and colloquial meanings which everyone uses and understands and which do not even come CLOSE to describing my relationship with whatever I’m obsessing on now. It’s not just that I am sitting in my room and my heart is racing and all I can think about is Glee and all I want to do is read about it and talk about it and never go to sleep because that would take time away from this and that has been my life for the past few days. It’s not just that I am doing sudokus in my head or that I find ways to talk about either numbers or Glee in any conversation, including ones about needing to give a student a sensory break so he’ll stop screaming and throwing things.(It’s not just the association and pressure of shame, because when ever an autistic person gets autistically excited about something, there will be people there to shame and bully them, and some of us will internalize that shame and lock away our obsessions and believe the bullies and let them take away this unique, untranslatable joy and turn it into something dirty and battered.)It’s not any of that. Those are all things neurotypicals can understand and process. This goes beyond that. It’s not anything recognized on the continuum of “normal”.It’s that the experience is so rich. It’s textured, vibrant, and layered. It exudes joy. It is a hug machine for my brain. It makes my heart pump faster and my mouth twitch back into a smile every few minutes. I feel like I’m sparkling. Every inch of me is totally engaged in and powered up by the obsession. Things are clear.It is beautiful. It is perfect.I flap a lot when I think about Glee or when I finish a sudoku puzzle. I make funny little sounds. I spin. I rock. I laugh. I am happy. Being autistic, to me, means a lot of different things, but one of the best things is that I can be so happy, so enraptured about things no one else understands and so wrapped up in my own joy that, not only does it not matter that no one else shares it, but it can become contagious.This is the part about autism I can never explain. This is the part I never want to lose. Without this part autism is not worth having.Neurotypical people pity autistics. I pity neurotypicals. I pity anyone who cannot feel the way that flapping your hands just so amplifies everything you feel and thrusts it up into the air. I pity anyone who doesn’t understand how beautiful the multiples of seven are, anyone who doesn’t get chills when a shadow falls just so across a solitaire game spread out on the table. I pity anyone who is so restrained by what is considered acceptable happiness that they will never understand when I say that sometimes being autistic in this world means walking through a crowd of silently miserable people and holding your happiness like a secret or a baby, letting it warm you as your mind runs on the familiar tracks of an obsession and lights your way through the day.It takes a million different forms. A boy pacing by himself, flapping and humming and laughing. An “interest” or obsessions that is “age appropriate”—or maybe one that is not. A shake of the fingers in front of the eyes, a monologue, an echolaliated phrase. All of these things autistic people are supposed to be ashamed of and stop doing? They are how we communicate our joy.If I could change three things about how the world sees autism, they would be these. That the world would see that we feel joy—sometimes a joy so intense and private and all-encompassing that it eclipses anything the world might feel. That the world would stop punishing us for our joy, stop grabbing flapping hands and eliminating interests that are not “age-appropriate”, stop shaming and gas-lighting us into believing that we are never, and can never be, happy. And that our joy would be valued in and of itself, seen as a necessary and beautiful part of our disability, pursued, and shared.This is about the obsessive joy of autism. So I guess, if I’m trying to explain what an obsession (and, by necessity, obsessive joy) means to me as an autistic person, I can bring it back to the tired old image of a little professor cornering an unsuspecting passerby and lecturing them for half an hour. All too often this encounter is viewed through the terrified eyes of the unwillingly captive audience. I’d like to invite you to see through the eyes of the lecturer, who is not so much determined to force their knowledge into you as they are opened to a flood of joy which they cannot contain.And why would you want to contain something like that? ", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/04/05/the-obsessive-joy-of-autism/", "title": "The Obsessive Joy Of Autism"},
{"date": "October 7, 2011", "body": "The correct reaction to hearing about systematic injustices or oppression experienced by an autistic person is not to turn to the autistic person explaining this and exclaim: “but I would never!”\nThat this response is in any way considered a legitimate one will never cease to baffle me.\nI’m thrilled that you aren’t revolted by the idea of an autistic person having sex. I am really, genuinely, honestly excited. You know why?\nBecause you are rare. You’re like a unicorn. If everyone felt like you, my friend would be permitted to be alone in another room with her boyfriend of seven years.\nBut…oh. She’s not.\nShe’s turning twenty one, and she’s never been told what “sex” is.\nShe’s also not an isolated example. She belongs to a specific group of people–autistic, intellectually disabled, in a supervised living situation–who are routinely and almost by default denied agency over her sexuality. Other groups experience the same abuse in different ways.\nYou think that’s wrong? Congratulations. Then I’m probably not writing about you.\nI am honestly overjoyed when a parent or an educator tells me that they don’t practice quiet hands. I am also frustrated past the point of tears, because you are not enough. You are one person refraining from abuse in a culture where these practices are expected. Your actions have an impact, yes–they also do not negate the reality I and the autistic community have grown up in. A spot of light in the darkness is invaluable, but it’s just that–a small spot of light. I’m not writing about the spots–I am writing about the overwhelming, consuming darkness.\nI really don’t understand how we’ve gotten to a point where some sort of acknowledgement is expected for the teachers, professionals, and parents, the service providers and the allies, who manage to show some basic human decency. Such a state of affairs is an insult to everyone involved.\nIf I describe a broader, troubling trend in society that has a profoundly negative impact on me and my community, a reply of “but surely I am not a part of this trend!” is nonsensical. It says absolutely nothing about anything I described. You aren’t a part of the problem? Then what I’ve said doesn’t apply to you. Why are you bringing yourself up? It’s as if you commented that the sky is particularly blue today, and I mentioned that in Australia it’s midnight. They’re both technically true statements, but mine really isn’t conducive to a discussion of the weather here and now.\nIn fact, if I make a habit of such statements, I’ll probably be seen as needing some speech therapy or behavioral intervention.\nYou will probably be seen as a very, very patient ally.\nIt’s an absurd situation. It’s like a straight parent wanting praise for not kicking out their LGBT+ child, a man expecting me to finish an essay about rape with a p.s. most men aren’t rapists, it’s like me as a white person expecting a Japanese friend to finish a recounting of racial violence with a quick oh but I know you’re not like that, Julia.\nGuess what! I don’t get points for meeting the bare minimum requirement of ethical human behavior! No one does! It’s the minimum. It’s what the default is supposed to be. We should be able to take it for granted.\nYet in discussions about ableism and autism, I am repeatedly confronted by this problem. When I refuse to qualify my statements with but of course some parents would never kill their child, or not that life is always perfectly easy for neurotypicals either, I am told I am being too blunt, angry, or antagonistic. Probably, it is theorized, this is because I am autistic. I must have difficulty understanding that my experiences aren’t universal, or that other people have feelings and a right to different opinions.\nNo, actually. Speaking–well, typing–truth plainly and as concisely and directly as I can is not the same as harshness. It probably feels unpleasant when read by a person in a position of immense privilege. I am frankly more concerned with the systematic injustices I see all around me.\nI mention privilege. Privilege is a word that has a lot of meaning. I’ve been told I’m privileged for being able to articulate what has been done to me.\nI really cannot think of anyone luckier.\nPrivilege is actually very different from luck. Privilege is a lot like water, to paraphrase Amanda Baggs. It’s been described as “not having to know” or “being able to forget”–not having to know that nothing will change for you unless they leave a bruise where someone can see, being able to forget that someone was institutionalized. A useful description here, however, is simply “used to taking up space.” People in positions of privilege–and enabled people are by definition in a place of immense privilege over disabled people–are used to taking up a lot of space. This does not mean that they are bad. It does mean, though, that when a minority attempts to claim a little bit of space for themselves, the privileged people will feel attacked. They might feel that the minority is, by trying to exercise their own voices and claim their own space, calling the privileged group intrinsically bad.\nBut here’s the catch–if the minority group devotes their limited attention and energy on reassuring the privileged group and helping them manage and process the transition…then the privileged group is still taking up all of the space!\nThere is not actually a way for the minority group–and to be specific again, I am talking about disabled people, about autistic adults–to win here. Either we let ourselves be co-opted into soothing decent people that they are in fact decent people, or we are a hostile force to be at best ignored and at worst fought. Either way, the privileged group–non-autistic people–is still the center of the conversation and still makes the rules.\nIt is completely unacceptable.\nSo, for future reference? If someone positions themselves as an “ally” and expects some sort of acknowledgement or praise or thanks for it: I disengage. I could not be less interested in having conversations which adhere to this power dynamic. I’m busy: I have a liberation to craft.\nI would love it if you could join me.", "outgoing_links": ["https://ballastexistenz.wordpress.com/2008/10/11/people-can-be-a-bit-like-water/"], "link": "https://juststimming.wordpress.com/2011/10/07/congratulations-on-your-human-decency/", "title": "“Congratulations on your human decency”"},
{"date": "October 5, 2011", "body": "TW: Ableism, abuseExplaining my reaction to this:means I need to explain my history with this:1.When I was a little girl, they held my hands down in tacky glue while I cried.2. I’m a lot bigger than them now. Walking down a hall to a meeting, my hand flies out to feel the texture on the wall as I pass by.“Quiet hands,” I whisper.My hand falls to my side.3. When I was six years old, people who were much bigger than me with loud echoing voices held my hands down in textures that hurt worse than my broken wrist while I cried and begged and pleaded and screamed.4.In a classroom of language-impaired kids, the most common phrase is a metaphor.“Quiet hands!”A student pushes at a piece of paper, flaps their hands, stacks their fingers against their palm, pokes at a pencil, rubs their palms through their hair. It’s silent, until:“Quiet hands!”I’ve yet to meet a student who didn’t instinctively know to pull back and put their hands in their lap at this order. Thanks to applied behavioral analysis, each student learned this phrase in preschool at the latest, hands slapped down and held to a table or at their sides for a count of three until they learned to restrain themselves at the words.The literal meaning of the words is irrelevant when you’re being abused.5.When I was a little girl, I was autistic. And when you’re autistic, it’s not abuse. It’s therapy.6. Hands are by definition quiet, they can’t talk, and neither can half of these students…(Behavior is communication.)(Not being able to talk is not the same as not having anything to say.)Things, slowly, start to make a lot more sense.7. Roger needs a modified chair to help him sit. It came to the classroom fully equipped with straps to tie his hands down.We threw the straps away. His old school district used them.He was seven.8. Terra can read my flapping better than my face. “You’ve got one for everything,” she says, and I wish everyone could look at my hands and see I need you to slow down or this is the best thing ever or can I please touch or I am so hungry I think my brain is trying to eat itself.But if they see my hands, I’m not safe.“They watch your hands,” my sister says, “and you might as well be flipping them off when all you’re saying is this menu feels nice.”9. When we were in high school, my occasional, accidental flap gave my other autistic friend panic attacks.10.I’ve been told I have a manual fixation. My hands are one of the few places on my body that I usually recognize as my own, can feel, and can occasionally control. I am fascinated by them. I could study them for hours. They’re beautiful in a way that makes me understand what beautiful means.My hands know things the rest of me doesn’t. They type words, sentences, stories, worlds that I didn’t know I thought. They remember passwords and sequences I don’t even remember needing. They tell me what I think, what I know, what I remember. They don’t even always need a keyboard for that.My hands are an automatic feedback loop, touching and feeling simultaneously. I think I understand the whole world when I rub my fingertips together.When I’m brought to a new place, my fingers tap out the walls and tables and chairs and counters. They skim over the paper and make me laugh, they press against each other and remind me that I am real, they drum and produce sound to remind me of cause-and-effect. My fingers map out a world and then they make it real.My hands are more me than I am.11.But I’m to have quiet hands.12.I know. I know.Someone who doesn’t talk doesn’t need to be listened to.I know.Behavior isn’t communication. It’s something to be controlled.I know.Flapping your hands doesn’t do anything for you, so it does nothing for me.I know.I can control it.I know.If I could just suppress it, you wouldn’t have to do this.I know.They actually teach, in applied behavioral analysis, in special education teacher training, that the most important, the most basic, the most foundational thing is behavioral control. A kid’s education can’t begin until they’re “table ready.”I know.I need to silence my most reliable way of gathering, processing, and expressing information, I need to put more effort into controlling and deadening and reducing and removing myself second-by-second than you could ever even conceive, I need to have quiet hands, because until I move 97% of the way in your direction you can’t even see that’s there’s a 3% for you to move towards me.I know.I need to have quiet hands.I know. I know.13.There’s a boy in the supermarket, rocking back on his heels and flapping excitedly at a display. His mom hisses “quiet hands!” and looks around, embarrassed.I catch his eye, and I can’t do it for myself, but my hands flutter at my sides when he’s looking.(Flapping is the new terrorist-fist-bump.)14. Let me be extremely fucking clear: if you grab my hands, if you grab the hands of a developmentally disabled person, if you teach quiet hands, if you work on eliminating “autistic symptoms” and “self-stimulatory behaviors,” if you take away our voice, if you…if you…if you…15.Then I…I….", "outgoing_links": [], "link": "https://juststimming.wordpress.com/2011/10/05/quiet-hands/", "title": "Quiet Hands"}
]