[
{"date": "Monday, May 12, 2014", "body": "\nThings are a little better.  Frantic calls to our soon-to-be-gone neuro and taking up with a psychiatrist have yielded a bit of calm.  I am marginally less sick over the approaching summer.  It certainly helps that my girls get along wonderfully (most of the time).  Breathe out. \n\nI have been working for months to get Sam \"in the system\" for disability services.  It has been eye-opening and ridiculous.  I will blog more about it soon. \n\nI hope everyone out there is doing well.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2014/05/a-little-better.html", "title": "\nA Little Better\n"},
{"date": "Wednesday, September 26, 2012", "body": "\nWe started a new supplement today based on this study\nhttp://www.nature.com/news/amino-acid-deficiency-underlies-rare-form-of-autism-1.11375\n\nDo I think Sam has this particular form of the disorder?  No but amino acids are a safe thing to add to his diet so we will give it a go.  \n\nHe also got a med increase today.  Should I have done these things on the same day?  No but is behaviors have us pretty desperate and and the thought of spacing things out makes me ill.  \n\nI have been booted from my own bed - for good it seems.  Or at least until we fix up Sam's room so that there is nothing he can smash - including windows.  I doubt we are going to be there anytime soon.  Until then it isn't safe to \"force\" him to stay in his room. I can't remember if I ever posted about it but he has done some MAJOR damage when made to stay in his room at night in the past.  \n\nAnd for some reason we have another dog. . . \n\n", "outgoing_links": ["http://www.nature.com/news/amino-acid-deficiency-underlies-rare-form-of-autism-1.11375"], "link": "http://spectrumliving.blogspot.com/2012/09/again-and-again.html", "title": "\nAgain and Again\n"},
{"date": "Saturday, April 13, 2013", "body": "\nI have often wondered what autism would do to the length and quality of Sam's life.  He has behaviors that put him at risk for all kinds of dangers.  I never considered I might face a health crisis that could limit my ability to care for him. \n\nA few weeks ago, as I pulled up to a light, my heart started pounding, my face got warm, and I went blind.  I shouted out, \"I can't see\" which took my two girls by surprise,  I knocked my glasses off my face (I am not really sure why) and I tried to remember how many cars were about to come through the light (I was making a left so I knew a had a little time before I had to move).  I fully expected that the next thing to happen would be my passing out or dying.  Luckily, my vision returned 10-15 seconds later.  I dropped the girls off, called out of work and had my husband take me to the emergency room.  All tests were normal and they sent me home.  Two days later I began having waves of faintness and a feeling that my vision might go again.  I went back to the ER.  CT scan was normal. \n\nI saw a neurologist and a cardiologist.  Both agreed it sounds more heart related than anything else.  24 Holter monitor was normal.  Echocardiogram was normal.  Now I am on a 3 week event monitor.  I continue to have palpitations and waves of faintness.  basically I feel like crap. \n\nI am guessing that this is somehow stress or sleep deprivation related but I really don't know.  I, of course, hope it is nothing serious.  But so far it hasn't let up or gone away. \n\nI have thought a lot about what would happen if I weren't here.  I never prepared a plan for Sam's care. I honestly don't know where to start. \n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2013/04/mortality.html", "title": "\nMortality\n"},
{"date": "Monday, January 21, 2013", "body": "\nThis is my most recent post on my other blog www.sanitystitches.blogspot.com .  Since it relates to special needs I decided to re-post over here:\n\n\n\nSewing for Sam is something I have agonized over in previous posts.  First of all, sewing for boys can be more difficult, at least when you are just starting out.  You can't just whip up a simple skirt for your guy to try out your machine (well, of course you CAN, and I certainly wouldn't judge - but Sam isn't interested).  In addition, Sam is PROFOUNDLY autistic.  He is essentially non-verbal, he has major behavior issues, he has severe cognitive impairment (my youngest sailed past him cognitively at about 15 months), and he has sensory issues. The cognitive and sensory issues limit our clothing options. \n\nI really haven't made him anything he will wear until now (I explained the pj fiasco in a previous post).  So when I saw that the 3rd week on Project Run and Play requires making an outfit for a boy, I considered skipping this one.  But then I decided to think hard about what might work and gave it a go.  I am very pleased with the results!!!\n\n\n\n\n\n\n\nFor the pants, I started with the Oliver and S Bedtime Story pajama pants.  The fabric is a dark olive fine-wale cord.  Sam can only wear elastic waist pants because he cannot do buttons, zippers or drawstrings.  I trimmed about 1/2 inch off the top of the pants and then I made the attached waistband wider (I used 2 inch elastic).  I made the waistband out of a lighter olive green quilting cotton which was leftover from the Party Dress Remix I made in week one.  I added a row of stitches around the top of the elastic to prevent the elastic shifting.  I left off the leg bindings in that pattern and just made sure the pants were long enough to hem properly.  I added a cargo pocket on one leg just for the look of it.  Sam doesn't use pockets.\n\n\nSam doesn't like stiff collars and he isn't wild about shirts made with woven fabric so for the top I stared with the Flashback Skinny Tee pattern (designed for stretchy fabric). I sized up so it would be loose enough to wear over a tee or undershirt and I used a shirt he already has to adjust the sleeve length.  I used a light to mid weight fleece.  I wanted to add something interesting to the front.  Sam doesn't have any hobbies for me to pull and image from.  His only \"activity\" is throwing things around the house and jumping up and down and that doesn't really lend itself to a clothing theme!  I decided a simple shape like a star would be a nice touch.  I printed out a star from Microsoft Word and cut out it out of navy blue fabric - the same as what I was using for the cuffs and the neck.  I sewed the star onto the front piece before assembling the shirt.  I made a mock turtle neck for warmth (a full turtleneck would drive him nuts).\n\nThe big test was when Sam had to put everything on.  He can't tolerate being measured so I was using his other clothes to figure out measurements.  My big fears were that he would reject the outfit for some reason or the fit would be off.  But. . . .SUCCESS\n\n\n\n\n\nThen I had to get him to take pictures.  I bribed him with candy (by the way, in the world of Autism, it isn't candy, it is a \"reinforcer\".  That makes it better, right?)  I was able to get a few shots but most were like the one above - hand flapping, jumping up and down, and generally being spastic.\n\n\n\n\n\n\nPoking at the window:\n\n\n\n\n\nI got him to show the waistband:\n\n\n\n\n\n\n\nThen I called it quits and let him run off. \n\n\n\n\n\n\n\n\n\n", "outgoing_links": ["http://www.sanitystitches.blogspot.com/", "http://3.bp.blogspot.com/-8_AceDfv8Aw/UPsI2Xp3Y0I/AAAAAAAAAkk/t7oi8YScnIA/s1600/IMG_0060.JPG", "http://3.bp.blogspot.com/-J1aeWl_7WqA/UPsKDy5_64I/AAAAAAAAAmM/MLT3QW0Pn4s/s1600/IMG_0061.JPG", "http://2.bp.blogspot.com/-sVUru0P4HIs/UPsJXq75YLI/AAAAAAAAAlU/svXEvgm7Rk8/s1600/IMG_0078.JPG", "http://oliverands.com/oliver-and-s-patterns-digital/OLV-OS008BT.html", "http://www.made-by-rae.com/2012/02/flashback-skinny-tee-sewing-pattern-is-here/", "http://4.bp.blogspot.com/-EoDxD__TPE8/UPsJnwlkdnI/AAAAAAAAAls/RlmaTx10n0M/s1600/IMG_0081.JPG", "http://3.bp.blogspot.com/-NwsNvarzwbI/UPsJs0s5atI/AAAAAAAAAl0/I1XtoU_BhJQ/s1600/IMG_0082.JPG", "http://1.bp.blogspot.com/-XiPUSlsRt5s/UPsJ0uph2LI/AAAAAAAAAl8/e6LeCRaKT-s/s1600/IMG_0064.JPG", "http://3.bp.blogspot.com/-uspI40cvGws/UPsPbAujxVI/AAAAAAAAAmw/25Ne3C1QSz0/s1600/IMG_0075.JPG"], "link": "http://spectrumliving.blogspot.com/2013/01/this-is-my-most-recent-post-on-my-other.html", "title": "\nSensory Smart Superstar\n"},
{"date": "Wednesday, August 8, 2012", "body": "\n\n\nSam has developed some aggression recently. Aggression is a word many of us hesitate to use in reference to our children.  Having it recorded as one of your child's \"issues\" can close some doors since not every program is equipped to deal with an aggressive child.  Also, especially with a kid like Sam, \"aggressive\" just doesn't seem to fit what I am trying to say.  To me, aggressive suggests that the person intends to cause hurt or harm to another.  It suggests more awareness than Sam has.  But, for lack of a better way to explain it, Sam has been aggressive.  \n\nHis episodes tend to be either in response to being told \"no\" or part of an OCD fit.  When he is told \"no\" to something he really wants (but just can't have) and he is in one of those moods, he throws thing hard at that ceiling, he hits me with the base of his palm, and he scratches.  If he is on the floor he goes for my legs and rakes his nails down.  If he is standing or on a couch he goes for my arm.  The picture shows the results of one morning tantrum.  The OCD fits are something new - he starts to scream and cry because the curtains are crooked, the pillows aren't right, the shoes are messed up - even if he/we fix what he wants it doesn't matter because he will just fixature on something else.  Sometimes he lashes out in those moments.  I cannot lift him up to his room to separate him from everyone when he gets like this.  I stay near him even though it means getting scratched because he is happy to go for the girls if I am not close enough.  \n\nThese episodes are not a constant thing.  They seem to come in waves and they are worse when he doesn't have school and his day is less \"on the go\".  So we are doing our best to keep him busy.\n\n", "outgoing_links": ["http://2.bp.blogspot.com/-d_9838ihCJk/UCG55EA1evI/AAAAAAAAAdg/SzUvHJsnWE4/s1600/IMG_2015.JPG"], "link": "http://spectrumliving.blogspot.com/2012/08/autisms-dirty-word.html", "title": "\nAutism's Dirty Word\n"},
{"date": "Tuesday, April 30, 2013", "body": "\nThe one thing all three kids can happily do together.  It scares the you-know-what out of me, but they love it.\n\n\n\n\n\n", "outgoing_links": ["http://4.bp.blogspot.com/-CrJW-0Z3mNw/UYBmwquiHNI/AAAAAAAAAv0/nNujEMyyp7k/s1600/IMG_0463.JPG", "http://4.bp.blogspot.com/-zqnJR9CANV4/UYBmjDikeiI/AAAAAAAAAvs/Wu30UALPxCs/s1600/IMG_0466.JPG"], "link": "http://spectrumliving.blogspot.com/2013/04/the-one-thing-all-three-kids-can.html", "title": ""},
{"date": "Sunday, November 3, 2013", "body": "\nI could not think of an appropriate title for this post.  Our situation is turning into exactly what I feared for such a long time.  Sam's behaviors are increasingly dangerous and he has stalled/regressed in pretty much all skills.  In this past week alone Sam\n\n\nSmashed a carton of milk on the floor \n Stayed up most of tuesday night, ended the all nighter by smashing glass all over the dining room resulting my going to work with my hands bandaged up, \nclawed my face up when he was frustrated going to bed wednesday night leaving me with three nice scabs for work the next day\nsmacked me in the head a few times before bed pretty much every night\ndropped a water pitcher on the floor then kicked me in the face as I tried to mop up the water before it spread everywhere\nkicked my husband and me numerous times for fun and in anger\nsoaked the carpets in water he steals from the faucets and throws on the floors\ncovered the floors in food he takes, throws on the floors and them jumps on\nthrew a knife at my foot - luckily it hit me at an angle and I was wearing heavy socks\nhit me with shoes, toys, cups, books, and pretty much anything else he has been able to get his hands on - he aims for my head and my feet\nrisked setting the kitchen on fire by throwing things at the stove when I was cooking\njumped so much he shook tiles off the bathroom wall\n\nMy mother came to visit yesterday and she was very upset at the situtation.  She said she feels we need to look into possible residential placement for him because it is becoming difficult to keep the girls safe.  It is something we have had in the back of our minds for a while now.  We are still hoping we can find a magical behaviorist or a beneficial medication that will allow Sam to stay with us ( I am not to hopeful on the behaviorist front since we have worked with some GREAT ones who haven't been able to help with this at all).  We are not giving up yet but we are getting close.  \n\nIf anyone out there has had success working with a nonverbal, hyperactive, severely behavioral child, please offer up your suggestions!\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2013/11/untitled.html", "title": "\nUntitled\n"},
{"date": "Tuesday, June 26, 2012", "body": "\nSam lost another tooth yesterday.  I only found out becasue I happened to look in his mouth at the right angle.  He had no idea.  Or if he did, held no significance for him.  So far this makes 3 teeth out.  THe first he got a bit upset about, the second he must have swalloed in his sleep and then this one must have come out during the day.  I am sad that this developmental period means nothing to him but I am happy that it is not overly upsetting to him.  I suppose it could be worse. \n\nAfter weekly follow up calls to the meurologist, I finally got a call back about 2 months after I sent the video of Sam foaming at the mouth.  The doctor still hadn't been able to open the video and said we woudl just talk about it at Sam's next appointment - in August.    AUGUST.  So he hasn't seen the video and has no idea if it is something serious and he says don't worry about it we will talk in August.  I would love to find a new neurologist but I really don't think there are any fantastic doctors out there for Autism.  I have list from various school with \"parent recommendations\" but this guy is on one of those lists so I don't know how much help they will be. \n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/06/losing-teeth-and-losing-faith-in.html", "title": "\nLosing teeth and losing faith in doctors\n"},
{"date": "Monday, December 31, 2012", "body": "\nThe year comes to a close today and I can't help but wish I had more to report.  Despite a huge jump in therapy hours and medication changes, we had had very little progress for Sam.  Developmentally, my 21 month old has sailed past him. He has less language than when he was a toddler and he is more destructive and hyper than ever.  The only thing we have defeated is the really dangerous type of tantrum he was having - the kind in which he scratched up my arms or legs, threw things at me and the girls.  He comes close from time to time but he hasn't had a major blow up for a while.  That seems to be the result of meds.  \n\n In terms of other behaviors, nothing helps.  I go to meeting after meeting and plead my case for someone, ANYONE to offer up an innovative and intensive apporach but every so-called behaviorist gives me the same lame suggestions that I have been trying for years.  Have you tried removing the things he throws from the environment?  He throws anything and everything - books, toys, paper, shoes, spices, boxes of pasta, mail, pens, and so on.  Shall I remove everything from the house?  Have you tried aversives?  We tried what the school claimed was a very intensive behavior plan in which Sam received and aversive everytime he threw something (\"non-preferred taste and visual screen were the main ones).  Sam found them aversive but they had no effect on whether he threw again 10 seconds later.  The suggestion now?  Put a lock on his bedroom door and keep him in there whenever a grown up cannot stay within arm's reach - and since I have three children and a husband who works weekends and usually gets home after dinner on weeknights that would be most of the time.  Seriously.  I am sad, angry and frustrated.\n\n I don't know what I expected really. I have read the behaviorism books too and I don't have any brilliant ideas.  We have tried all the usual interventions. Sam just tests the limits of behaviorism ( don't say that to a behaviorist, they don't like ot think they have limits).  The school says everything is fine, they are working on it, but he hasn't reached the point of \"generalization\" yet.  When I inquire further though I find that their idea of his doing \"well\" only exists because they pretty much never let him out of his \"cubby\" (each kid has a little area with two chairs and a table blocked off with bookshelves for ABA trials) and his aide is always within 3 feet of him.  That is worse than when he was  3 and 4.  \n\nI am sad for Maya who aches to go on more playdates and daytrips like other kids her age but since most parents aren't doing \"drop-offs\" with 4 year olds these days I can't do it because I can't bring Sam.  I can't invite her friends here because Sam WILL throw things at them (with absolute certainty).  We try to maximize the time we have when he is out of the house but those hours are limited.  \n\nMy husband and I are tired- tired of holding on to hope that the next thing might improve quality of life over here just a little only to have it be as useless as everything else we have tried, tired of being hit with things, tired of seeing the girls get hit with things, tired of knowing we can't sit and eat a proper dinner together as a family, tired of knowing that tomorrow is going to be just as frustrating as today.  \n\nContrary to what the pity party above might suggest, the year wasn't all bad.  I was lucky enough to find a small UCC church nearby that has been wonderful for the girls.  Maya loves the music teacher and she got to be in her first Christmas pageant a couple of weeks ago.  I am hoping full time school next year will be great for her.  Hannah is a sweet and loving toddler who is talking up a storm (although her sleep habits need some serious help) Work is fine.  We have made some headway with some financial stuff.  I started another blog and I have been learning a lot abotu sewing and knitting from other bloggers (check it out over at www.sanitystitches.blogspot.com) \n\nI am hoping as we head into 2013 that it will be different somehow.  I hope to meet innovative therapists and to find out about breakthroughs in medications.  Unlikely, I know, but you are supposed to be hopeful at the start of a new year, right?  It is as good a reason as any.  \n\n\n", "outgoing_links": ["http://www.sanitystitches.blogspot.com/"], "link": "http://spectrumliving.blogspot.com/2012/12/the-year-comes-to-close-today-and-i.html", "title": "\nEnd of the Year\n"},
{"date": "Monday, July 30, 2012", "body": "\nSam likes to drop things.  And throw things.  Pretty much all the time.  Usually he fixates on hard plastic objects or cardboard boxes but sometimes he selects dangerous things. Sam decided to punctuate his morning today by smashing one of Maya's snowglobes on the living room floor whiloe I made him breakfast.  Yes, I realize that the snowglobe should not have been where he could get it but at this point there are very few places he can't reach.  \n\nSam has a pretty intensive behavior plan for throwing/dropping at school and we are starting to bring it home during his home program sessions.  I am thinking about scanning it and posting it in case anyone wants to learn about behavior plans. \n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/07/broken-glass.html", "title": "\nBroken Glass\n"},
{"date": "Friday, April 27, 2012", "body": "\nYesterday Sam turned seven!  I can't believe I have been a mother for seven years.  It was a regular day - everyone had school/work.  I gave Sam a musical toy as his gift.  He likes these Baby Einstein toys which look like stuffed animals with pictures of instruments on their paws. You press the paws and it plays a tune.  Hannah got the turtle for Christmas but Sam quickly claimed it and began holding in right up to his ear and playing it again and again and again. .  I found out they make the same toy in different animals so I got him the Panda (and actually the lion a few weeks back as well) to be extra.  We had ice cream cake after dinner and called it a day.  \n\nIt was, as his birthdays always are, bittersweet.  I am happy that we are in a better phase with him. He is happier so fewer tantrums, and we have a decent therapy schedule for him.  The fact that he is getting older is hard because chances of his gaining clear communication and cognition are getting slimmer and slimmer.   \n\nBut we keep trying!\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/04/seven.html", "title": "\nSeven!\n"},
{"date": "Wednesday, June 27, 2012", "body": "\nI met with a very nice doctor today.  I almost didn't go.  I got a call on Monday reminding me that Sam had an appointment with the developmental pediatrician.  I totally forgot about it and my first thought was to cancel it.  THere is really no role for a developmental ped. at this stage of the game.  We don't need a diagnosis and he doesn't handle meds.  It is one of those appointments that you have to make about 8 months in advance so about 8 months ago someone probably said to me, have you followed up with the developmental pediatrician?  and it seemed like a good idea at the time.  \n\nI wanted to cancel because dragging a baby and Sam (Maya had camp) to one of the worst areas  (the hospital is surrounded by \"gentleman's clubs\") just made me want to vomit.  But I thought about it for a while and realized that if it went terribly, I just wouldn't go back.  If it went well I might leave with some suggestions.  \n\nSam was a complete nut, throwing things that whole time. Hannah was a doll.  The doctor was very kind.  He didn't offer any new information but he did give me some suggestions of psychiatrists who work with severely disabled kids.  None of them take my insurance, of course but I will at least call to find out their fees.  \n\nAnd he said he was sorry things turned out this way.  He was the one who originally said he thought would turn out to be on the higher functioning end.  He didn't say it in a condescending way.  It was sincere and well, just kind. \n\nHe even called me when I got home because he thought of another specialist in another state I might want to call - also doesn't take my insurance but that fact that he continued to think about Sam was very nice. \n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/06/nice-doctor.html", "title": "\nA Nice Doctor\n"},
{"date": "Friday, May 25, 2012", "body": "\nThe school year is winding down and so IEP season is in full swing as we all plan for next year.  Sam's meeting went well.  It seems that instead of dropping items on the floor hundreds of times a day he is only doing it tens of times a day.  Woo Hoo! (insert sarcastic eye roll) Without any debate, the district consented to continue Sam's after school home program without any breaks in the summer and they added additional hours in August.  He is set to continue at his current public school program- which is a good program-next year.  Sounds good right?  In the moment I went with it and signed the IEP.  I know how lucky we are to live in an area where special education services are provided at this level.  \n\nbut. . . . . I met with the special education director of the district in which I work.  We discussed Sam's (lack of) progress and behavioral issues.  SHe told me that if he were in her district she would most definitely look for a private school program for him.  She helped me clearly articulate why his current program is not the most appropriate option for him.  She confirmed one of my big concerns - Sam's current program keeps kids through age 14.  After that is is assumed they will go to life skill or job training programs.  Sam is not on that path.  Unless he has major congnitive gains, he will not fit into a program like that.  At 14 he is likely to be 6 feet tall and very strong.  The chances that we will be able to get him into a good private school program at that point will be very slim.  THe chances are better while he is younger.  She also told me that around here, it isn't much cheaper to send kids like Sam to public programs.  SHe urged me to push for it now.\n\nso. . .  I left a message for my case manager last night (you know, just to make sure she has a great holiday weekend).  I will follow up with a letter today.  \n\nLet the games begin.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/05/iep-season.html", "title": "\nIEP Season\n"},
{"date": "Tuesday, January 15, 2013", "body": "\nSam was hit hard about a week and a half ago with a nasty bug.  I got it too but he was knocked out worse than I was.  He had fevers for about 10 days and he was sleeping 20+ hours a day.  It started on a Saturday and it appeared to be a 24 hr bug because SUnday he was fine.  Monday he went to school and I got a phone call saying he had dozed off, they were having trouble waking him and he seemed to be having seizure -like activity when they tried.  The nurse said he didn't appear to lose oxygen and she wasn't overly concerned.  Then she called back and said it happened again and she would need me to pick him up because she didn't want to put him on the bus.  For the next week he spiked fevers and slept.  While I certainly don't want Sam to be uncomfortable, I have to admit that his being ill had some advantages.  It allowed me to cuddle him and be with him without anything being thrown for a few days.  \n\nSam is back to normal today and as soon as we got home he started throwing things everywhere.  sigh.  We follow up with the neurologist tomorrow.  \n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2013/01/illness.html", "title": "\nIllness\n"},
{"date": "Wednesday, May 23, 2012", "body": "\n\n\n\n\nSO instead of feeling sorry for myself (and Maya) for not knowing anyone to invite to her party I decided to just send invitations home with all the girls in her class.  I figured there are only about 6 of them and so even if they all said yes it wouldn't bee too big of a gathering.  Four girls came plus two others we know from outside school.  Maya had a blast and Sam managed to only steal a few water bottles and throw them over the fence. \n\n", "outgoing_links": ["http://3.bp.blogspot.com/-K3e4BnsnOsI/T71tOeDfDHI/AAAAAAAAAUM/FVYofddxDVU/s1600/IMG_1826.JPG"], "link": "http://spectrumliving.blogspot.com/2012/05/maya-is-4.html", "title": "\nMaya is 4\n"},
{"date": "Monday, November 24, 2008", "body": "\nYou might notice that the \"Blogs I Read\" are adoption blogs.  I have known since I was a teenager that I wanted to adopt some day.  After I had my son Sam, I was so madly in love with him, my desire to adopt grew stronger.  I couldn't stop thinking about how all children should have a parent who loves them this much.  My niece was adopted from China and the man who helped facilitate her adoption went to work for Gladney so my brother-in-law told me to check out that agency.  I researched the agency was drawn to their Ethiopia program.  My husband and I agreed it was something we would pursue when we had the money.  Through the Gladney site, I found some fantastic blogs.  Then Sam developed Autism and everything changed.  He requires almost all of our energy and money and we are just hoping we can do enough to give him the best chance possible at a normal life.  We have a six month old daughter who is so far very typical so we are crossing our fingers. . .So adoption is on hold, probably for quite a while.  BUT I just found a great way to do something for an Ethiopian orphan.  We joined an online community being coordinated here - www.bottomlysandethiopia.blogspot.comAs an online community we are sponsoring an orphanage  - Kebebtsehay Children's HomeThe group setting up the sponsorship is Children's Hope Chest - www.hopechest.orgI am thrilled to be able to participate.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2008/11/adoption.html", "title": "\nAdoption\n"},
{"date": "Saturday, July 26, 2008", "body": "\nFor those of you who don't know, PECS is a picture exchange communication system.  Sam has a book filled with little laminated pictures of things he can request - cookie, chips, video, juice, etc.  When he wants something he must give the adult the picture of the item he wants.  He is still in the early phases of learning this communication method so basically when he wants something he just gives us any picture and then he tries to tell us what he wants or we figure it out somehow.  Today he figured out which picture card represents \"cookie\"!!!!  He sure had fun giving us that one.  We are supposed to reward him quickly so that it motivates him to use the system so this boy had quite a few cookies!!!  Sam actually already knows haw to ask for a cookie verbally but now there are many things he wants that he can't articulate clearly yet.  Now that he \"get\" PECS, hopefully it will allow him to use it for things he can't say yet.  I have always wanted to believe that my boy was very bright but he was hiding inside this PDD shell.  Seeing him learn this so fast was fantastic.I was reluctant for Sam to learn PECS at first because I thought it meant we were giving up on verbal language.  I didn't want him using his speech therapy time at school doing PECS instead of talking but the idea is that is will facilitate language.  FIrst you build communication skills and then use that interaction to build language.  I see it working a little already as he is whining less and trying to use pictures and words.  When he brings me a picture I make sure to say the words very clearly and he tried to repeat it.  He can now sometimes say \"juice\" instead of \"nn-ga\" when he wants a drink.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2008/07/pecs-hurray-for-sam.html", "title": "\nPECS - Hurray for Sam!\n"},
{"date": "Monday, November 24, 2008", "body": "\nSchool is in full swing now for Sam and for me.  I have a great groups of juniors this year and Sam is very happy to be back at his pre-school program.  We had a TERRIBLE summer.  Sam seemed to develop some behavior problems when he first started school - throwing, yelling, jumping on furniture - but when school ended for the summer, he just went crazy.  He was constantly wired and trying to take care of him and the newborn baby left me in tears most days.  I just couldn't see any hope.  Sam was so out of control I couldn't take him to other people's homes.  In addition, Sam stopped sleeping properly.  There was one night towards the end of the summer when he bounced on his bed and screamed (for fun) pretty much ALL night.  His receptive language skills were so low that I couldn't tell him things like \"it is time to sleep\"  or \"stay quiet while the baby is sleeping\".  I am SO relieved to be back in the swing of a school year.  Sam does so much better when he has a structured day.I also put Sam on the gluten free casein free diet.  I resisted for so long because I thought it would be too hard and I wasn't convinced it could really make a difference.  Why did I change my mind?  I kept meeting people who said they felt it helped.  I started noticing gluten free foods at the grocery store.  I started slowly by getting him interested in Van's Waffles and substituting rice pasta for his regular stuff.  ABout 3 weeks ago, I committed to it completely.  Do I see a difference?  I think so.  Sam has always had a crusty weepy rash behind his ears.  I was comstantly treating it with creams.  It has almost completely vanished.  Was it a food reaction?  Sam's spacial planning and climbing ability reall jumped about a week into the diet.  Has the brain fog lifted?  He is also sleeping better but that was starting to improve the deeper into the school year\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2008/11/new-school-year-gfcf-diet.html", "title": "\nA New School Year/ GFCF diet\n"},
{"date": "Monday, January 26, 2009", "body": "\nQuitting GF/CF DietWell, we gave it a shot.  Sam was gf/cf for 3 months and I didn't see the changes I had read so much about.  Sam got dairy back last week and gluten this past weekend.  His tantrums are terrible on or off the diet.  I am sad it didn't help because it is something I could control but it is much cheaper to be off it.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/01/quitting-gfcf-diet-well-we-gave-it-shot.html", "title": ""},
{"date": "Thursday, July 24, 2008", "body": "\nSam was a healthy 8lb 3oz boy at birth.  He met his developmental milestones during his first year - he smiled, he laughed, he babbled, he played peekaboo. . .At 1, he wasn't really using words.  He babbled often and he would repeat things we asked him to say but he didn't really use meaniful language.  We weren't too worried because he was happy, well-attached to his mommy, and meeting his physical milestones.       Hindsight  - Sam tended to fixate on one toy at a time.  For a while, it was the plastic ring stack toy.  At one point, it was    the peekablocks train which he eventually broke by using it so much.  I though all kids had favorite toys so I didn't worry about it.  At 15 months the pediatrician recommended an evaluation because he still wasn't talking.  SHe said she wasn't concerned about autism because he seemed to only have a speech delay.  I resisted.  Everyone around me said boys are late talkers so why go to the trouble of an evaluation .  All this stuff in the news about the rising rates of autism must be due to over-diagnosis, RIGHT???  I can't tell you how many times people told me Einstein didn't talk until he was at least 4.       Hindsight - Sam had a habit of doing what we jokingly termed the \"hop-hop-headbop\" once he started walking just after his first birthday.  He would stomp/hop a few steps across the room and then bob his head.  He would entertain himself with this \"game\".  We though he was just excited to be up and moving.  The repetitive nature of it should have been a clue.  He wasn't really interested in toys.  He wasn't pointing with one finger.At 18 months, he was still only repeating words when we pushed him.  He didn't seem that different from other kids his age.  he sometime cried when we first arrived at a new house but it was always a brief reaction.  He still lacked language but he babbled a lot and pretended to \"read\".  He used inflection and sounded natural so we though language was just around the corner.  He loved being read to and one of the few words he said was \"read?\"     Hindsight - Sam still wasn't pointing and or using language.  He didn't have good play skills and basically ignored his toys.  He would sit and flip through books on his own but since he also like being read to we didn't think that was bad.  Other than that though he seemed very typical at this age.  No one around us voiced any concern.At 2, in the spring of 2007, Sam was still barely talking and I knew it was time to think about evaluating him.  WHen he was outside in the yard or at a park he would play normally for a few minutes and then run/walk back and forth along the fence.  At my parents house he would run up and down the hallway looking at the banister.  He began lining up puzzle pieces in a perfect arch.  He stopped letting us read to him.  He would flip through books on his own and get annoyed if we tried to intrude.  His eye contact began to slip away.In July 2007 he had his EI evaluation.  He qualified for early intervention due to greater than 25% delays in all areas (receptive language, expressive language, social skills and self care).  THey suggested a follow up with a developmental pediatrician but they said that they didn't need a diagnosis in order to give him services, they would treat symptomatically.  I figured why label him?  BIG MISTAKE!! If I had gotten that diagnosis I would have gotten more services.  I waited unitl Sam was about 2 1/2 to get an official diagnosis.  In December, Sam was diagnosed with PDD. At 3, a couple of months ago, Sam entered a full day public school program for disabled preschoolers.  He is making progress but it is slow going.  On the positive side-He makes pretty good eye contact-lots of smiles-a few single word requests-he is learning PECSOn the negative side-hand flapping-shrieks and yells-frustration when he can't communicate what he wants-doesn't understand \"play\" so he throws whatever he can get his hands on\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2008/07/timeline.html", "title": "\nTimeline\n"},
{"date": "Tuesday, April 10, 2012", "body": "\nI finally got a video of Sam's mouth movement.  I emailed it to the neurologist today.  Have any of you seen this before?\n\n\n\n\n\n\n", "outgoing_links": ["rtsp://v6.cache6.googlevideo.com/ChoLENy73wIaEQmHhC7yRb9T4hMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://spectrumliving.blogspot.com/2012/04/roll-tape.html", "title": "\nRoll Tape\n"},
{"date": "Wednesday, April 15, 2009", "body": "\nSome parents of autistic children seem so sure of the moment their child \"became\" Autistic.  It was right after the MMR or the DTaP or a fever or seizure. . . They KNOW that nothing was the same after that incident.  I have no such moment I can pinpoint.  In recent months I had convinced myself that I could have detected his autism much sooner, possibly as early as 1 year old.  Maya's incredibly social personality is such a contrast to what Sam's \"mommy only\" attitude was at her age.  Her behavior had me convinced that something could have been detected sooner.  Earlier this afternoon I came across some photos of Sam when he was younger and all of these memories of the way he used to be came back to me.  The first is a photo of Sam in his exersaucer as happy as can be.  I remember when he used to play in it while I cooked and/or cleaned up in the kitchen.  He would babble and bang around just happy to hang out with me.  The second is a photo of Sam in the cutest Hanna Anderson pajamas.  He is probably 14 or 15 months in the picture.  It made me remember the dancing game we would play in the kitchen when he was too big for the exersaucer.  I would say \"Sammy dance\" and he would \"dance\" by running/hopping in place.  Then he would stop and look at me.  I would follow with \"Mommy dance\" and do a similar jig myself while he giggled.  We would go back a forth a few times while pasta sauce or chicken simmered on the stove.  A third photo is one we used for Christmas cards whan Sam was about 19 months old.  Sam is in his fleece one piece pajamas and sitting on a chair in the family room.  He is beaming at the camera with one of the happiest grins you can imagine.  The final photo that prompted this reflection is a picture of Sam sitting on the stairs in khaki pants and a striking blue polo shirt.  It was the day of our neighbor's son's first communion.  Sam got right on the dance floor and bopped up and down nervously when we arrived at the party.  In the picture he is looking right and the camera and smiling.  Looking at each of these photos I was suddenly hit but this feeling that he seemed so NORMAL at those times.  He was not withdrawn, stimmy, or hyperactive at those times.  While he may have shown signs of autism early on - not much pointing, difficulty waving/motor planning/imitation, running back and forth when he learned to run, slow verbal skills - he also did things to negate our concerns - sit on my lap for stories, snuggle, smile at other children, make his wants and needs known through nonverbal communication.  After 2 the signs became more apparent.  I remember watching in horror as he lined up puzzle pieces in perfect arches across the carpet and tearing up as he stopped letting me read to him.  As Sam grew from 2 to 3 his condition got worse.  He started hand flapping, jumping, humming, bouncing on his bed for hours at night, losing the few words he had, chewing paper, and throwing everything in sight.  Looking at these pictures made me sad missing the little boy I thought I had but it also made me realize that I wasn't negligent missing his diagnosis in those first two years.  There was so much he did that seemed \"typical\".  So when did the world change?  I just don't know.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/04/wondering-when-world-changed.html", "title": "\nWondering When the World Changed\n"},
{"date": "Saturday, April 4, 2009", "body": "\nWe are trying a new therapy called the Tomatis Listening Program.  We are using the lovely people at Bergen Pediatric Therapy in Westwood, NJ.  They are fantastic - I recommend them to anyone looking for a sensory integration approach to OT.  Sam completed the first loop (15 days@ 1 1/2 hours a day).  I haven't seen any gains in language so far although I my husband I and I both think we have seen him be more affectionate with my husband.  I hope that with the second and third loops we see more gains.  It is so hard to know what hterapies to try.  Everything cost so much money and each one is a gamble.  In a few weeks we are going to see a \"holistic\" doctor who also know the DAN! (Defeat Autism Now) approach.  DAN! is very controversial but I feel like we have to try eveything.  At the moment Sam attends an ABA based school for autistic students, gets Spectrum COmplete (a multivitamin.mineral supplement from Kirkman Labs), DHA/fish oil, and we just started a high strength pro-biotic (Three-Lac).  We also do one private OT session a week.  Maya, our second child, is 11 months now at she is right on target with her development - such a relief.  She makes great eye contact, responds to her name, points at things she is interested in, babbles, dances, crawls, pulls up and eveything else an 11 month old should do.  What are we doing differently?  I refused the flu shot when I was pregnant.  It contains mercury and if getting the flu during certain critical periods of pregnancy is a risk factor for the child developing schizophrenia (which has been found in studies), why PUT flu in my body on purpose?  In addition, we are using a alternative vaccine schedule.  She gets no more than one shot at a time and we are putting off any vaccines for diseases she won't be exposed to as a baby.  She will get them but when she is older.  We believe vaccines are important as a public health factor but after learning about what they contain, I can't see ever injecting a tiny baby with ALL of them.  I recommend The Vaccine Book  by Dr. Sears for anyone who wants to know what each brand of vaccine contains.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/04/tomatis-listening-therapy.html", "title": "\ntomatis listening therapy\n"},
{"date": "Tuesday, July 7, 2009", "body": "\nWe have something going on here that I really wasn't sure would ever happen - Sam is using the toilet!  He has a week and a half off from school (he went back this past Monday).  The school has repeatedly told me not to try potty training at home until he was on a 2 hour schedule at school.  I respected their wishes until this break.  I felt that putting him in diapers the whole time would be a waste.  It took about 2 days for him to \"get\" that what he did at school was the same thing as what we were going for on the home toilet.  Then he stayed dry the rest of the week.  He won't request the bathroom but as long as I take him on a regular basis, he pees like a champ.  Poop is a whole other story.  I have known some typical children who took 6 months or more to poop in the toilet so I imagine I am in for months of undie washing.  I happened to catch him squatting this afternoon though and I grabbed him and ran him to the bathroom.  We had a success and he got a lollipop right away.  I don't imagine that any light bulbs went off in his head but hopefully I will \"catch\" him as often as I can! SO, is he potty trained?  No, but he is at least on the way.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/07/potty.html", "title": "\nPotty\n"},
{"date": "Friday, April 17, 2009", "body": "\nWe had our first DAN! appointment yesterday.  It was much more pleasant than I expected.  Sam's behavior was horrible, of course.  He threw things around the office, ran around and climbed the furniture.   The doctor, though, was very mellow.  I almost went to another DAN practitioner back in the fall but my quack radar went off when she told me she would sell me lots of supplements before we got any test results.  Also, she charged $500 for the first appointment and she isn't even a doctor!  I cancelled the appointment with her.  I heard about the woman we did go see from another family and they felt very at ease with her.  She didn't try to sell me anything, she didn't insist we immediately go back to gf/cf or anything like that - she is going to wait for test results before making recommendations.  We just paid for the office visit and we will have to pay for labwork -EXPENSIVE!!!  I am not going to harp on all the prices though.  I made up my mind before we went to the appointment that we were just going to go for it.  Sam will be 4 in a little over a week and I feel like our window is closing.  I am hoping for major gains before he turns 5.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/04/dan-appointment.html", "title": "\nDAN! appointment\n"},
{"date": "Tuesday, June 30, 2009", "body": "\nSam has completed his first full year of school.  While I am very proud of him for the gains he has made, I can't help but wish they were a little more apparent.  He understand more directions at this point.  For example, I can ask him to pick somehting up and give it to me or to carry something from one room to another.  There is still very little language.  He can ask for help, more, chips, cookie, juice, shoes (to go outside), open, jump (trampoline), and a few other things but no phrases. His behaviors are still very abnormal.  He will spend hours pulling leaves and dropping them through the boards of the deck or stcking blocks and dropping them.  At certain times he gets wound up and starts throwing then hand flapping again and again.  When he does that we are holding his hands down at his sides and saying no throwing - it seems to be helping a little.I, like many parents of autistic toddlers, hoped that school would lead to this explosion of development and Sam would be able to go to regular elementary school.  That is looking less likely as he is now 4 and barely verbal.  We will keep trying though.  We have a great new speech therapist who uses the Prompt method.  Sam responds well to that. We are continuing with nutritional/wellness therapies as well. Maya is doing beautifully - pointing, toddling, talking, playing, and generally being cute. We are continuing sponsor a lovely little girl in Ethiopia.  I wrote her a letter and sent pictures a little while back and I am hoping to write again this week.  We are sponsoring through a group called Children's Hope Chest.  Every time I shell out for extra private therapy I think about how for abotu a third of the cost of 45 minutes of therapy I can feed a child for a month.  Amazing.  Those of you that know me know I have always thought I would adopt someday.  I don't know why, it has just always been on my mind.  Of course, I never expected Autism.  We will have to see how Sam progresses.  I am still hoping for a success story.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/06/sam-has-completed-his-first-full-year.html", "title": ""},
{"date": "Tuesday, July 21, 2009", "body": "\nI check Autism message/support social network sites occansionally and I often read comments like \"everything happens for a reason\"and \"this is what was meant to be\".  That kind of stuff really gets under my skin.  Usually it is framed in some sort of religious context although not always.  It troubles me that people can believe God just decided to start striking our kids with this devastating disorder.  I DO believe in a very powerful life force that I call God but I believe what happens to us is largely due to our own actions and those of our society.  I don't understand how some people can say things like \"everything happens for a reason\"  or \"this was meant to be\" and still maintain that they have free will. I know that sometimes these comments are just meant to encourage people to find the good in a situation.  The belief that everything happens for a reason might lead one to search for that reason and glean something meaningful and positive.  That is a good way to live but I still can't jive with some great wizard in the sky pointing his wand and saying \"Autism for you!\"My son was not meant to be like this.  It could be genetics, spontaneous mutation, pollution, shots, water filled with prescription drugs, or some other toxic chemical but I believe WE did this.  WE, meaning my husband and I, possibly passing on some genetics defect, or WE, meaning society, poisoning our children.  It is probably a WE that includes both of those things and maybe something more.  Call on God for strength or comfort or peace but as the creator of Autism?  No, that is all us. Autism was not \"meant to be\".  It just is.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/07/things-i-hate-to-hear.html", "title": "\nThings I Hate to Hear\n"},
{"date": "Monday, August 10, 2009", "body": "\nI are trying a variety of approaches with Sam.  Autism treatment has become a real money maker and so I try to approach each option with healthy skepticism. Sam attends an ABA based pre-school for autistic children.  Every child has a well-trained aide and the aides rotate evey 2 weeks.  It is a public school program and I know we are lucky to have such a program in our area.  During the school year he attends from 9 - 2:45.  In July he attends the ESY program at his school from 9-1.  It is a little too \"campish\" for me but the staff are all his regular teachers/aides and he enjoys it.  Last year Sam had nothing in August and it was terrible.  This year I fought for August services and we have 20 hours of ABA at home and 16 hours of parent training. It works out that Sam has 2 hours of contact with a therapist almost every day this month and it is working otu really well.I also take Sam for private speech therapy once a week with a woman who does PROMPT.  SHe is wonderful and get great things out of him. We are also tyring biomedical therapies.  Dietary interventions proved useless for Sam.  He never really had digestive issues so it didn't surprise me that his gut didsn't seem to be a major factor in his autistic behaviors.  My personal opinion is that gf/cf and other diet programs are worth a try for anyone with digestive problems but those gut issues are not just an autism thing.Our biomedical plan also includes various vitamins and supplements.  Sam takes a vitamin/mineral supplement made by Kirkman Labs.  I didn't like their super nu thera vitamins but their kids multivitamin/mineral capsules have been good.  Sam also takes the following in addition to that:-extra vitamin D (his bloodwork showed he was deficient)-probiotics-prebiotics-digestive enzymes (not sure this is doing anything but it doesn't hurt)-DHA/fish oilI saw the greatest improvement when I added the vitamin D and then again when we added the EPO. Later this week, Sam will get his first B12 shot.  Cross your fingers!All of these supplements were recommended by a qualified doctor.-Evening Primrose Oil\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/08/our-current-treatment-plan.html", "title": "\nOur Current Treatment Plan\n"},
{"date": "Monday, July 27, 2009", "body": "\nWhile planning for, working with and advocating for Sam occupies a lot of my time, there is another child in this house for whom I am responsible. Our amazing daughter Maya is 14 months old and she is racing past milestones. She loves to play with toys, feed and kiss her \"babies\", carry \"purses\" around the house, dress up, and play outside. While Sam attends ESY this July, I get to spend one on one time with Maya - something I haven't been able to do since last July. This is the final week of Sam's ESY program and although he will receive some ABA in August, it will not be as intensive as regular school. I am relishing each day this week and trying to maximize my quality time with my girl!\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/07/it-is-not-all-about-autism.html", "title": "\nIt Is Not all About Autism\n"},
{"date": "Wednesday, September 9, 2009", "body": "\nWhen you have a child with special needs, little things are so much more complicated.  You can't just go to watch the high school football game or take a trip to the park without seriously scouting the layout first.  You can't just get a babysitter and take a night out (assuming there is any money to go out or get a babysitter).  My husband and I went into a panic tonight because he has to leave very early Friday morning for a seminar.  It is my husband's job to get Sam up and put him on the bus in the morning.  What to do???  If he were typical we could send him to a neighbor or something like that.  You just never know what he will get into in a new house.  My fear is he could potentially spend and hour jumping on and off their lovely coffee table.  Once he is addicted to a behavior, he can't stop himself.  Luckily, there is a girl in his class who lives nearby.  She is much higher functioning but her mom \"gets\" the disorder.   I am still worried that Sam will give her hell for the 45 minutes he will be there but we are up against a wall here.  I can't take the day off because this is the first week of school.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/09/little-things-are-so-much-more.html", "title": "\nLittle things are so much more complicated\n"},
{"date": "Monday, August 31, 2009", "body": "\nIn 2 days, Sam goes back to school.  I am very pleased with how the home ABA and Parent Training went this summer and I will fight to repeat this schedule next August.  Sam will have a new teacher this year and I know nothing about her.  I am preparing to write her a lengthy note (I know, I know) because I have a couple of concerns about Sam's transition back to school. 1 - When Sam left school he was on a 40 minute potty training schedule (meaning every 40 minutes a timer went off and he was taken to the toilet).  At home now he is fully potty trained and if I try to make him go when he doesn't need to, he gets frustrated.  He takes himself every 2-3 hours.  I want to make sure they will respect the progress he has made and not fall back on data that is left over from July.  The program is SOOOO data driven  - for everything- and it frustrates Sam sometimes.2 - Sam has made a lot of progress verbally.  Prompted, he can say \"I want ________\".  He is tought to understand but he is using more words.  After carefully reviewing his last progress report I noticed that ALL Sam's expressive programs are for PECS.  There are no programs that work on his speech.  His speech therapy does a little but it is really only his private speech therapy that make him work to produce sounds.  I want to request that they push him to speak a little more and back off on PECS a little.  I don't want to get rid of PECS since he may never be fully verbal but I would like to push the verbals kills since he is trying so hard.Maya will go see the babysitter this week.  I wonder if she will remember?  The last time she was there she couldn't quite walk and now she runs. I will be heading back to work next week.  It is always a mix of emotions for me when I go back.  I am lucky that I like what I do but I miss being home with my baby.  I always thought I would be home until my kids started school but finances haven't allowed that possibility.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/08/back-to-school.html", "title": "\nBack to School\n"},
{"date": "Saturday, October 3, 2009", "body": "\nApparently, the answer to the jacket problem is M&Ms.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/10/jackets-again.html", "title": "\nJackets Again\n"},
{"date": "Tuesday, December 15, 2009", "body": "\nI felt a flicker of hope last week. The melatonin seemed to be doing the trick for Sam. He was sleeping beautifully. I began to imagine the possibilities - an overnight at my mom's or some other place. A vacation is still out of the question as Sam has no appropriate interests and he would run away if we were out in public but an overnight somewhere? With Sam able to fall asleep in a strange place? Not waking up and trashing the place and keeping us (me) up all night? The thoughts were uplifting. If we coulld get that far at 4 1/2, where might we be at 8?He took a night off the melatonin on Saturday. He slept pretty well. I thought maybe his circadian clock had been reset. Sunday, he did not do well at all. Monday night I gave him the melatonin again. It didn't work. He was up from 2 - 4:30 hyper as ever - bouncing on his bed, yelling, laughing. He woke the baby multiple time and eventually he ran out an had to be taken downstairs. Neither Sam nor baby want dad when they wake at night so the burden is not shared. Light snuffed out.I am giving him a higher dose tonight. If it doesn't work I am going to harass the neurologist. I am making it through work on very little sleep but I can't do this long term. I am wiped out, teary, and generally fed up.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/12/flicker-then-snuff.html", "title": "\nA flicker then - snuff!\n"},
{"date": "Tuesday, November 3, 2009", "body": "\nPoor Sam is getting over the H1N1 flu.  He started to come down with symptoms on Thursday afternoon and by Friday morning he had a fever of nearly 104.  He had the nasal swab test (yuck) at the doctor's office and it came back positive.  He went right on meds and he seemed to respond well.  He was tired all weekend and he had some trouble sleeping but other than that, it wasn't too bad.  He stayed home Monday to be safe and he didn't have school today.  He goes back tomorrow.  I know it can be serious for some but for him, it was ok - not fun, but ok.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/11/h1n1-and-sam.html", "title": "\nH1N1 and Sam\n"},
{"date": "Friday, November 6, 2009", "body": "\nI posted a while back about starting methyl-B12 shots on Sam. We have to get them from a compounding pharmacy ($$$) and give them every other night. The first round went alright. I gave them to Sam after he went to sleep. He would wake briefly with a cry of indignation but them he would go right back to sleep. I noticed that he seemed to sleep better when he got the shots but there didn't seem to be any other effects. I was ready to quit them because of the cost. The doctor talked me into another round. We paired the second round with and addition of folinic acid to Sam's vitamin routine. That week, I got notes from he teacher about how much better his focus seemed. I don't know if that is really enough to draw a conclusion but I think we will continue for a while longer.  Our newest treatment is a series of Homeopathic formulations. The company that makes them is called Guna and Sam gets drops from 6 different bottles a few times a day. We just started so I don't have any clear results. Sam HAS seemmed more focused and social this weke but he is recovering from H1N1 so he might just be tired and in need of some comfort. The jury is still out on this one.  Now to the question so many parents of autistic children agonize over: Should we have more children knowing that there is an increased chance of having a child with developmental delays?I have always wanted a big family. I always imagined having 4 or 5 children. It never occured to me that I might not be able to. I was never set on having biological children and infact I always envisioned a family of bio and adopted kids). I have been lucky enough have gotten pregnant very easily both times but I was ready to adopt right away if that had not been the case. Now that Maya is becoming more indepedent and seems to be on a normal developmental track, do we roll the dice again? do we look into adoption? International? Foster care?Mark seems inclined to try again for another biological child. He is not against adopting but he resents the invasiveness of the process (he understands why it must be so but he doesn't look forward to it). He has always been interested in adoption (our niece is adopted) as well but the paperwork puts him off since his work schedule is already so busy. He also doesn't want to commit to an expensive international adotpion which could be a hardship for our current children. He is actually more open to the idea of adopting from foster car if we got that route..I loved (and hated at times) being pregnant and part of me wants to jump at the chance to go through it again. Another part of me wants to throw our urge for another child into the adoption process. We have had a few conversations about it and we have not resolved the issue. I think we both agree that we want one more (after that we will see) and that we will wait 6 months to a year before we go for it. In the meantime, I am going to research foster-care adoption so we can discuss the facts. I work with someone who did this recently and I am going to try to schedule some talk time with him and his wife.  To all of you out there with children on the spectrum: What decision did you make about having more kids? What factored into your decision? Sam was too sick to trick-or-treat (not that he knew what he was missing) but not too sick for a lollipop.I wasn't going to dress Maya up (I was feeling cheap) but I found a hand-me-down costume in the attic and I am glad I did. She had a great time beeing a bumble bee.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/11/new-treatment-and-question-of-more.html", "title": "\nNew Treatment and the Question of More Children\n"},
{"date": "Sunday, December 13, 2009", "body": "\nCurcuminThe newest addition to our supplement routine is Curcumin extract.  I read a number of positive reviews of it so I checked with our doctor.  She thought it would be a good addition.  Supposedly it is anti-viral, anti-yeast, natural chelator, blah, blah, blah.  I read a lot about it before making the purchase and it is very safe.  In addition, it has been found to help a number of other medical conditions. It is not a particularly expenive supplement but, of course, I had to buy the one from Lee Silsby that is supposedly formulated in a 'special\" way so it cost a bit more.  It is amazing how easy it can be to get the parents of autistic children to spend money.Sam had a little trouble with bowels movements the first few days.  It seemed to make him go and go.  Not loose or anything like that, just frequent.  He had a couple of accidents but he bounced back soon. I can't say I have seen any major changes yet.  He has had good reports from school and his speech therapist said he seemed more emotionally connected.  I am reluctant to attribute that to a supplement without giving it more time. I am giving biomed a little bit longer.  Sam will be 5 in April and if I haven't seen any major changes by then I am begging for meds.  I never thought I would even have to consider medicating my child but here we are.  He can't stop stimming.  It is so distracting and addictive to him that it prevents learning and appropriate behavior. StrawsSam's current obsession is straws.  He chews them, bends them, and drops them into various cracks.  If it is warm enough to go outside, he drops them through the deck boards.  If he is inside, he goes upstairs and drops them down the sides of my sweater trunk on the upstairs landing.  I wish he likes something more appropriate but that doesn't seem to be happening anytime soon.  Hours and hours of home therapy and the kids still won't play with a friggin' toy.  Unless of course he is throwing it.  He is happy to throw toys. MelatoninTwo years ago, the developmental pediatrician recommended melatonin for Sam's sleep problems.  I know it is natural and safe but I couldn't bring myself to give it too him.  I was petrified of giving him anything that induces sleep. He often wakes and bounces on his bed for hours.  Usually he eventually goes back to sleep.  About 2 weeks ago he started running out of his room and wanting to \"play\" at 2 or 3 in the morning.  That, on top of the fact that the baby hasn't slept through the night in over a year, wore me down.  I gave him melatonin last week and it worked like a charm.  He slept peacefully all night.  He woke early but well-rested.  I hoped a week would re-set him and so I didn't give it to him last night.  He woke up briefly but overall he slept well.  I didn't give it to him tonight either so I am a little anxious to see how he will do.  I don't  know whether he will need melatonin most nights or just every so often like a reset button.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/12/curcumin-straws-melatonin.html", "title": "\nCurcumin - Straws - Melatonin\n"},
{"date": "Tuesday, September 29, 2009", "body": "\nSam has decided that he doesn't want to wear jackets or sweatshirts that can function as jackets.  As soon as he sees one coming at him he flips out.  If I put it on him, he flips out more - screaming, kicking, throwing things, crying - and won't stop until it is gone.  He reacts in a similar fashion to new shoes.  He also gets out of sorts changing from pants to shorts or short to pants as the seasons change.  But, the pants/shorts and shoes issue usually passes quicklywhen he realizes he isn't getting his way.  The jacket thing don't seem to be going away.  Interestingly, he doesn't mind long sleeve shirts.  It is fun.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/09/jackets.html", "title": "\nJackets\n"},
{"date": "Thursday, December 24, 2009", "body": "\nWe changed to  different Melatonin and upped the dose a tad.  That seems to have done the trick.  The type we tried came in a little glass bottle with a little dropper.  4 dropper = 1mg of melatonin.  The dropper did not have a measure anywhere on it so there was no way to know if the dose was accurate.  I switched to a different bottle (from the same company).  The dosing is 2 tsp = 2.5 mg.  Since 2.5 mg was our next dose, I gave it a try.  Sam has slept through every night this week.  He wakes early but I would rather have hims up at 5/6 each day than up racing around for hours in the middle of the night.  The only problem is that Sam HATES the taste so I have to force feed it to him with a dropper every night.  I have now ordered capsules that I can mixed with fruit puree. Sleep seems to be benefitting Sam in a number of ways.  The dark circles under his eyes are much better.  In addition, his personality seems a bit different.  He is more emotional but in a good way.  He actually seems to feel it when he is scolded these days.  He is more social as well.  Even though he still doesn't play appropriately, he wants company; someone to sit near him while he stims.  He also asks for \"gickle\" constantly (chase and tickle). Now, if only I could get Maya to sleep soundly I would be one rested mama.  Maya wakes at least twice a night and need a lot of comfort to get back to sleep.  I would gladly bring her into our bed and just co-sleep but she doesn't want that.  She wants me to hold her or to bring her downstairs to cuddle on the couch.  The doctor told me to make her \"cry it out\" but the doctor hasn't seen Maya turn herself blue holding her breathe.  I just don't have the heart.  Maybe when I meet a deeper level of desperation.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/12/zzzzzzz-for-sam-at-least.html", "title": "\nZZZZZZZ - for Sam, at least\n"},
{"date": "Wednesday, December 30, 2009", "body": "\nIt is 4 am and in a few hours I will drive Sam to the hospital for his EEG. I was supposed to do this a while ago but the whole idea made me want to pass out in horror. Keep Sam up most of the night? Put electrodes on his head (still don';t know how they will do that)? I gave myself a kick in the pants a few weeks ago and so we are getting it done on our break from schooll/work. I got 3 different sets of directions on when to wake Sam so i went with the set that allowed me to sleep until 2 am (well, sort of since the baby woke at midnight). Sam wouldn't wake at first, he just slept on me for a while. It has been so long since he snuggled like a baby that I let him stay for about 20 minutes.Then he started to wake. Oh boy. He wanted \"night night\". He hasn't slept without melatonin for weeks and TONIGHT he wants night night. He cried, he yelled, he hit me, he threw things. He even tried to lift me at one point to get me to take him back to bed (he is 4 1/2). This went on for nearly an hour and a half.Finally, I calmed him down with a waffle. I hoped it would trick him into thinking we were doing our morning routine. It seems to have worked.At 8 am the hospital staff will attempt the EEG. I am trying to have confidence that the staff are used to special needs kids. They must have methods to get them to wear the electrodes. RIght? I will be royally pissed if they can't do the test.So what makes a good outcome? If he has seizure activity then the poor guy might need meds and we have to worry about these seizures. If he doesn't have seizures going on then we have no new options. Nothing to add to what we are doing (which seems to be getting us nearly nowhere). I honestly don't know what I am hoping for. From what I understand the mostly likely outcome will be that the test is inconclusive and we will just (still) be tired.Has anyone out there learned anything interesting from an EEG?\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2009/12/eeg-in-few-hours.html", "title": "\nEEG in a few hours\n"},
{"date": "Saturday, March 13, 2010", "body": "\nJudge NotWe recently completed Sam's MRI and it came back normal.  It was nice to know that there are no obvious structural problems that will prevent Sam from developing. The anti-seizure med has yielded unclear results.  Sam seems to be making more direct and sustained eye-contact.  His receptive language seems to have improved.  Just yesterday he got upset that there was a hole in one of his socks so I told him to take them off and throw them away.  He did it!  That was huge since it was a multi-step process.  His mood seems to be better as well.  Since the gains are not dramatic, it is not clear whether the gains are due to the med or just development.The neurologist has put Sam on an ultra-low dose of med number 2.  I have been felt tremendous internal conflict over trying this medication.  If you asked me a year ago about putting Sam on meds, I would have said certainly not - it would be a last resort.  I have recently met a number of families with autistic children who have seen great gains on very low doses of medications.  Many have mainstreamed completely by 10.  The possibilities are seductive. BUT, there is such a stigma attached to putting your child on certain medications.  It is funny how no one says anything if your child is on asthma medication or allergy pills but as soon as it is for a learning or developmental disability, the judgements begin.  Everytime I talk to someone about what is going on with Sam I feel like I have to make very clear that medication is something we are turing to after trying everything else - diets, supplement and tons of behavioral and speech therapy.  Seriously, I feel like I have to justify the decisions I make as a parent - to people who don't have a clue what it means to parent a nearly non-verbal child with serious learning issues.  I even felt guilty giving Sam Melatonin, a natural supplement, when I realized that he and I couldn't continue to function without sleep.  I know that, as a society, we over-medicate.  But I have tried not to let this societal truth affect my individual decision making process.I do not move in this direction lightly or without thorough research.  We are not giving up on other therapies but we have to look at Sam's quality of life.  Obviously if he has a negative reaction to medication we will take him off of it but if will allow him to \"tune in\" and learn then he deserves that chance.  We, also, deserve that chance.  I accept that my life is now dedicated to being his caretaker but if a medication can make it safe for me to take Sam out in public now that he is outgrowing strollers and shopping carts then that is a good thing. So, this is what we are trying now.  I am going to try my best to ignore the slow nods and cautious questions that seem to occur when  people are \"shocked\" at the idea of giving a child medication. FM SystemAn additional therapy we are trying is an FM system Sam will try at school.  It was recommened to me by another family with an autistic som who recently mainstreamed.  Sam will wear a set of headphones and his teacher or aide, whoever he is woring with, will wear a mic so that background noise is filtered out and he can focus on the person working with him.  Sam already wears headphones at home for \"listening therapy\" so that part won't be a problem.  I am interested to see how he will respond the the teacher's voice.  I brought up the idea to his speech therapist since she will need to oversee it and at first she felt he was too young - but she couldn't tell me why age matters for this type of modification.  She spoke to the director and Sam's case manager and they both thought it was a good idea to try.  A vendor is sending a sample for a 30 day trial.  If we see any benefits the district will buy it for Sam to use at school.  Hopefully it will arrive in the next week and we can find out if it helps.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/03/judge-not-and-fm-system.html", "title": "\nJudge Not  . . . . and an FM system\n"},
{"date": "Tuesday, January 19, 2010", "body": "\nIt took a couple of weeks and many phone calls to get Sam's EEG report.  The neurologist, as soon as she got it from the hospital, left me a voice mail message telling me to make an appointment as soon as possible.  I think most people expected me to be upset by this.  I really wasn't.  Look at it this way - Sam is profoundly disabled.  This test was either going to come back normal, leaving us exactly where we were before, or abnormal, giving us more to investigate and possibly an action plan.  Sam is still very disabled but with the abnormal result and an action plan, at least there is the hope of at least a small amount of improvement.A certain percentage of the typical population gets abnormal EEG results even if there are no true seizures occuring.  A certain percentage of autistic people will also get abnormal results with no real seizure but for autistics, the chance is higher that seizures are occuring.  The neurologist wanted to do a video EEG to get more information as to whether we are looking at a seizure disorder but since that involve sticking things to his head and making him stay in a bed for 48 hours, we detemrined that such a test is next to impossible. The other option, the one we are persuing, is to give Sam a low dose of an anti-seizure med to see if he shows improvement.  If he does we move forward.  If he doesn't we re-think our plan. So that is where we are. If this medication helps Sam I will be incredibly happy.  I will also be frustrated.  You see, I mentioned concerns about seizures to a number of doctors because Sam had these spasms as a baby that made him rake his face during his sleep and he showed some strange eye movements.  It seems like once you have an Autism diagnosis, doctors stop looking for other issues.  Only the neurologist felt an EEG was an important step.  I first asked about an EEG over 2 years ago when we met with a developmental pediatrician. Keep your fingers crossed for Sam!\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/01/abnormal-eeg.html", "title": "\nAbnormal EEG\n"},
{"date": "Wednesday, April 7, 2010", "body": "\nI met with Sam's case manager and teachers last week. He needs a re-evaluation for primary school. His speech therapist, who I love, has been testing the FM system with him. SHe feels it is not hleping and, in fact, might be making things worse for him. I am not sure how to react. I don't feel that a coulel of weeks is enough time to evaluate something like that but the loaner is only available for a month. I am not sure whether to argue about this. I was so sure it would help and it is hard to accept that I might be wrong. But, I have faith in this speech therapist so I think on this issue, I am going to defer to her and not make a stink.This is a hard time of year for a few reasons. As the weather warms up, we get the pleasure of going outside but along with that come feelings of intense grief and jealousy (at least for me). It is hard to watch the neighbors standing outside chatting while their kids ride bikes, play ball, and/or chase each other. I used to be out there with them. We can't do that anymore. Sam would run away, eat someone's plants and generally get in trouble if we tried. So we stay in the backyard. We are lucky that we have been able to make the yard a usable space. We have a swingset, trampoline and a deck so it is a nice place to play. From our backyard I can see the local park. It is little league season. Sam can't play. He doesn't care or even know what he is missing but it makes me sadder than you can possibly imagine. I know that I am griving for myself more than for Sam - like I said, it doesn't matter to him. I am sad that he can't understand or enjoy a sport, I am sad that he can't make friends or be part of a team and I am sad that I can't bond with the other moms. It is very lonely.I try to get us out of the house as much as possible when the weather is nice so we go to fenced in playgrounds in nearby towns. I have to picked fenced in places because if Sam takes off, I ca't leave Maya to tke off after him. People tend to stare at Sam. I don't blame them. We are born with the habit of tuning in to what is different. No one has ever said anything hurtful. I guess I am lucky. Sam tends to put sticks in his mouth at the park. I try to bring him nice clean straws to substitute. SOme parent will usually signal to me and tell me \"Did you know he has something in his mouth?\" I know they mean well but yes, I know. If I could change it I would. Kids often get a little freaked out by Sam's hooting noises and they often very loudly yell to mom, \"Why is he doing that?\" Again, I don't blame them, they are just being kids. Hopefully their parents will use it as a teachable moment. As Sam gets bigger he is more and more conspicuousNo real news on the medication. I don't see huge changes at home - a bit more intense eye contact. School reports changes (and I didn't tell them about the new med at first). They feel is concentration has been better since we started a few weeks ago. We will talk it over with the neurologist in a couple of weeks.Sam will be five soon. When we entered this world of Autism, I thought we would be considering mainstreaming by now. We are so far from that possibility. Like I said- grief.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/04/warm-weather.html", "title": "\nWarm Weather\n"},
{"date": "Tuesday, May 11, 2010", "body": "\nSam has developed a new frustration.  He loves to play with plastic drinking straws.  They keep him busy and out of trouble so I buy them in bulk!  He has a box with slits in the tops into which he can drop the straws and then retrieve them.  He does the same thing outside on the deck - he drops the straws through the spaces between the boards of the deck and then goes under to get them (there is room for him to go under relatively comfortably).  Lately, when he drop them through the boards of the deck he starts whining and crying when they fall.  He cries the whole time he walks to go get them.  Due to the way he chews them, some of the straws don't fall but many of them do.  I try to explain that if he drop them they are likely to fall.  Of course he doesn't know what I am saying but I try.  He does it again and again and again and again. . .  Part of me wonders if perhaps part of his brain is tired of this stim/perseveration but another part won't let him stop.On the adoption front, everything is on hold.  After getting the letter about training, rushing around trying to arrange a babysitter and finding one, I got a call saying they have too many families interested in that particular program right now so we have to wait.  If we do everything now it will might expire before we get a referral/placement.  We have to talk again and decide if this is still the way we want to go.  We know we want a third child but which route?\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/05/sams-frustration.html", "title": "\nSam's frustration\n"},
{"date": "Thursday, April 8, 2010", "body": "\nI spoke at Barnard College a couple of days ago - it was a developmental psychology class (one I took when I went there).  I was just there to give an overview of Autism from a paretn's perspective.  I had a great and I met some great students.  One of the things I touched on at the end of the presentation is the endless tug of war between grief and acceptance when you have a special needs child.  In the moments of grief, it can feel all-consuming.  THe life you planned work, worked for, felt you deserved is gone.  You rage against this new life.  It is not like getting stuck in Holland when you planned on going to Italy (I don't care for that essay).  It is more like never getting to leave the airplane.  All the other passengers get off and head to their destination but you are stuck and feeling more clostrophobic by the minute. On the other hand, there are moments of acceptance.  TImes when you can relish your child's efforts and accomplishments.  The highs are higher because of the lows.  I remember that Sam potty trained nearly a year ago today.  He had just turned 4.  I couldn't believe it was real.  i was just entering panic mode because he was about to outgrow size 6 diapers.  But he did it and it stuck.  I try to remind myself of moments like that on the days that I feel tugged toarads grief.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/04/little-more-positive.html", "title": "\nA little More Positive\n"},
{"date": "Sunday, May 2, 2010", "body": "\nSam is 5.  Actually he has been 5 since April 26th but I haven't had time to write about it.  I sent cupcakes to school and picked up an ice cream cake on my way home from work. I hoped that all the sugar might signal something in his brain and make him realize that it was a special day.  He allowed me to put the paper crown his school sent home on his head for a photo at the dinner table.  Then he willingly let his sister steal it because he hates hats.  He seemed happy.Medication update - we continue on this path for now.  No miracles yet but we have noticed a slightly increase in his abilty to understand and follow directions.  What I had really hoped for - a decrease in the CONSTANT stimming- has not happened.  I am eagerly avaiting the results of Ohio State Medical's study on mecamylamine.  I don't know why I have a gut feeling about that one; I am far from qualified.Other stuff - we are considering adoption (from foster care).  Family members: I know we haven't discussed this with you so please don't be upset with us if this is the first you hear of it.  We just don't want to have to justify our decision right now.  We are aware we have a lot on our plate and we are aware that this is not an easy road to travel.  We have been speaking with families who have been through it and we are hearing about the good and the bad.  We know we want a third child, we know we have always been interested in adoption, and we know a lot about getting services for special needs.  We know that is we do this we will need help )like a sitter once a week so I can run errands)  We feel we have a particular set of skills now that would make us good at parenting a child who is at high risk for various forms of special needs.  We are in the exploration phase.  I attended an initial orientation with another family I know.  We registered our interest with Children's Aid and we are having an initial safety inspection this week when we will get more information about the state's requirements.  We may learn that we cannot meet their reqirements.  Or they may say we need really expensive work on our home that we can't do right now.  We will see.  Since , at the moment, we are only open to infant or toddler adoption, they may say that my needing to work full time as a teacher disqualifies us.  We also may not be able to complete the required 27 hours of training this May (anyone want to watch my kids monday and wednesday nights????).  SO there are many unknowns but we would like to figure out if this is a possibility for us.If you would like to speak to me about this please do but leave out phrases like \"taking on another problem\"  \"asking for trouble\".  I will completely tune you out once I hear those things.  As the parent of a special needs child and as a high school teacher, I can tell you that I have see just as many \"problems\" in families with biological children as with adopted.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/05/5.html", "title": "\n5\n"},
{"date": "Thursday, April 8, 2010", "body": "\nBack when we thought we would adopt (probably from Ethiopia) I began following this blog.http://bottomlysandethiopia.blogspot.com/They are doing a give-away for a piece of jewelry by a great artist on etsy.com  Junkposse jewelry - love it!We don't know if we will still adopt.  We are looking into foster care adoption (which I know probably sounds strange after my last post) and we have the initial paperwork.  More about that later.\n\n", "outgoing_links": ["http://bottomlysandethiopia.blogspot.com/"], "link": "http://spectrumliving.blogspot.com/2010/04/not-autism-post.html", "title": "\nNot an Autism post\n"},
{"date": "Sunday, May 16, 2010", "body": "\nI love yard sales. I am slowly becoming one those crazy ladies who makes a quick zip around a corner if I see a sign on a telephone pole. I get even more excited if I can park right next to the sale so that I don't have to bring both kids out of the car. I take a quick look around to see if the sellers have toddler clothes or toys and then I make selections or leave. I have found some incredible deals. Take last weekend - Mark was home on a Saturday (very rare) so I went to the post offic ewith just Maya in tow. We drove by one yard sale on the way home which was a no go. THe second stop was a hit. The family had about ten big plastic bins outside in the driveway. They were closed because it was raining off and on. I stepped out of the car and asked if they had children's clothes. They said yes. I asked if they had stuff for a toddler girl and they said \"That's all we have here!\" Their price? 2 for $1. A steal right?Especiallly considering most of the stuff was from The Children's Place. As I began to gather an armful of stuff, they offered me a clear garbage bag and said fill it and pay $5 bag. I filled two. I got two bags full of 2T and 3T clothes for Maya for $9 (I was short a dollar bill and as I counted change to reach the 10 they said 9 was fine). I think I may have actually done a little jig as I carried the bags to the car. I counted the items up when I got home - 55 items for $9. Why such a deal? I think they were worried that with the rain they might not have many people show up. Also, the wife works with autistic children and as we talked while I looked, out mutual interest came up.Now just to let you know how obsessed I can get, I went back a little later to see what was left. I got another 22 item for $11. Maya has all the 2T jeans, shirts, skirts, sweatshirts etc she couldpossibly want.Some of my favorites:Today I got a Parent's Magazine brand wooden trike and a toy vacuum cleaner for $12.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/05/yard-sales.html", "title": "\nYard Sales\n"},
{"date": "Friday, July 2, 2010", "body": "\nI don't know what is going on with Sam and his feet lately but whatever it is has made it necessary for me to by him lace up high top sneakers.  A couple of weeks ago Sam began to obsess about wearing socks in the house.  That was no big deal.  He also began to compulsively remove his socks and shoes when was was outside.  The problem?  half of our backyard is mulch and he began to get splinters in his feet (which he refused to let be removed - and he can FIGHT).  I tried a behavioral approach.  He had to go and pick up his shoes and socks and go inside each time he took them off and he couldn't go back out until both socks and shoes (or sandals) were back on his feet.  Literally a minute later they would be off again.  Now you should know that we spend A LOT of time outside when the weather is nice.  It is the only way I can stay sane.  Sam is a disaster in the house.  I found myself making Sam put shoes bakc on upwards of fifty times a day.  Sometimes I would be busy with Maya and not catch it right away.  He continued to get splinters.  The frustrating (sad?  puzzling?) thing was that he didn't like walking in bare feet.  He would make a face and look like it was uncomfortable but the compulsion was too strong to resist.  It is the same thing with his need to drop straws through the deck boards - he is happy to do it most of the time but every so often he gets upset and seems angry that he can't pull himself away from this self - stimulatory activity.   So today I changed strategy.  I bought high top lace up sneakers (Target's Converse One Star Sneakers) and Sam can't get them off.  If somehow he develops the attention span and the fine motor skills to untie double knotted high top sneakers then I will have to come up with a new plan.  But I think we are safe for a while.\n\n", "outgoing_links": ["http://3.bp.blogspot.com/_P3O2yD1xoJ0/TC5L1vZoLWI/AAAAAAAAACE/1_O_13F-p_8/s1600/10june3+014.JPG"], "link": "http://spectrumliving.blogspot.com/2010/07/new-shoes.html", "title": "\nNew Shoes\n"},
{"date": "Tuesday, June 8, 2010", "body": "\nI had Sam's IEP meeting last week.  It went pretty well.  I got something I wanted - Sam's parent training hours (his home program) will be switched to ABA hours so that hopefully Sam can generalize better.  We are still in \"disput\" over whether Sam be with a 1-1 aide next year or in a 2-1 set-up (2 kids with 1 aide).  I am 100% sure that Sam requires a 1-1 aide in order to make ANY progress but the program automatically switched them at primary level.  We (the teacher) have to take \"data\" to demonstrate Sam needs to remain in a 1-1 situation.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/06/iep.html", "title": "\nIEP\n"},
{"date": "Monday, June 28, 2010", "body": "\n Maya, age 1, feeding her baby Maya, age 2, \"changing\" her baby's diaperMy 2 year old daughter Maya has shown a strong maternal instinct since she could move. As soon as she had the ability to manuveur her arms and legs, she would feed spoon and bottle feed her dolls and stuffed animals. She now loves to \"change\" their diapers as well. She gets out her mini changing pad and lies each one down. Then she gets a baby wipe to wipe them and she tells me they have \"tiny poo\". recently she has transferred some of this caretaking behavior to Sam. It both warms my heart and makes me sad. If he is crying, she gets a tissue and wipes his face saying, \"Sam crying\". She will hold the tissue to his nose and say, \"blow\". A couple of days ago I caught her in the bathroom with Sam trying to wipe him (Ew?). SHe could only reach his back so she was rubbing the toilet paper up and down his back. I finished the job for her and when he got up she said, \"good job Sam\". When Sam come in she sits down next to him and tries to help pull his shoes off.It is foolish to think children don't notice difference. Maya has clearly noticed that Sam is different. SHe recognizes that at 5 he needs much more help on things than she does at 2. She also know his behvaior is different. Sometimes she imitates his stims - dropping a straw and flapping her arms while saying, \"oooooooh\". The difference of course is that she is fully aware that this is an imitation. Her pleasure from this behavior is just that she is copying her brother - there is no other neurological reward. SHe notices the differences but they just don't matter to her - yet.Even though Maya is only 2, it makes me happy to know that she loves him and \"gets\" him. I expect that there will be a period of time when she resents him or, perhaps, is embarrassed by him. I won't fault her for that. He is a tough brother to have. I feel a little sad for her. Ultimately though, I hope the caretaker in her will overcome any bad feelings. I think this is why I really want her to have another sibling. She shouldn't have to be a caretaker alone.\n\n", "outgoing_links": ["http://1.bp.blogspot.com/_P3O2yD1xoJ0/TCjrwkqs9_I/AAAAAAAAAB8/yAh-QI40014/s1600/09JuneJuly+026.JPG", "http://3.bp.blogspot.com/_P3O2yD1xoJ0/TCjqiytNHnI/AAAAAAAAAB0/EG0N5YZQvRU/s1600/10june2+007.JPG"], "link": "http://spectrumliving.blogspot.com/2010/06/little-caretaker.html", "title": "\nLittle Caretaker\n"},
{"date": "Friday, July 16, 2010", "body": "\nWhat I like about her:-She can usually see us within a couple of weeks of our calling.-She returns calls promptly.-At each appointment she tries to give Sam as full an exam as he can tolerate.-She watches him, tries to talk to him and asks me questions about his behavior.-She doesn't rush us through the appointment.-She doesn't push medication.-At each change she asks about my comfort level with the medication.What I don't like:-There is often a significant wait for the appointment (I know it is because her style is not to rush people but Sam doesn't do well in waiting rooms).-She is 1/2 hour away (which I realize is nothing to people in other parts of the country) so with the wait and the drive, an appointment takes up a chunk of the day.-She doesn't speak to Sam like a therapist so she doesn't get much of a response.  She writes A, B, and C on a piece of paper and asks Sam 3 times in rapid succession to show her which one is B.  He stares off in the opposite direction and waves his arms.  A therapist would write them on separate cards or pieces of paper and say simply \"touch B\" or \"show me B\".  I know this shows a deficit in his skills but to her it looks like he has NO skills.-SHE ALWAYS SAYS THE WRONG THING.  It is just a lack of tact but it is frustrating.  At one appointment a few months back, as we were leaving, she looked down at my daughter and said \"she doesn't say much\".  The suggestion was there.  Maybe you have another one.  In truth, Maya talks non-stop in most situations.  The exception is a doctor's office.  This past appointment she told me Sam reminded me of another patient she has.  I said \"oh yeah?\" expecting some kind of advice about something that helped the other child.  Instead she continued to tell me this other child is 13, can't talk and won't even get off the bus to go to school.  His parents have a lot of trouble with him.  Really? Thanks.  Way to give me something to look forward to. We have a new plan.  I will post about it once we get started.  Cross your fingers, pray, send positive energy, and/or think positive thoughts on our behalf.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/07/neurologist.html", "title": "\nThe Neurologist\n"},
{"date": "Saturday, May 29, 2010", "body": "\nPeople want to hear:that you are making the best of itthat you have faiththat you'll never give upthat Autism is a giftthat you wouldn't change your child for anythingthat this experience is making you strongerThey don't seem to want to hear:that your barely verbal five year old who seemd to be potty trained has started to regress.  That he pooped in his underwear while stimming on the deck yesterday then took off his pants and ran through it a few times before I could stop him. that later that same night he had more poop to make on the toilet (after starting in his night time pull-up)but the second I looked away he reached down to feel it and then wiped his dirty hands all over his clean pjs, his arms and his facethat last summer I worked my ass off getting him to string 3-4 very apraxic words together \"I want ___________\" and now the ability has completely disappeared. that I literally want to poke my eardrums out sometimes because his vocal stims are so loud, so constant and so annoying. These types of things either end conversations or result in an attempt at understanding (like: my two year old got his hands in his diaper once).  I really don't know what kind of response I want.  Maybe there is nothing anyone can say and maybe I shouldn't bother mentioning these things. Here is the truth:I am sometimes unable to make the best of it because sometimes even \"the best of it\" sucksFaith?  still thinking about that oneno, I will never give up but I have to balance that with accepting realityAutism is not a gift.  My son is a gift but it is delusional to say that something that takes away his ability to function, care for himself and communicate is a gift.  Have I learned a lot?  Sure.  but I would trade it all for one conversation with my son.If there was a magic pill that would take away Sam's Autism I would get it. While this experience may have made me \"stronger\" in some ways, it has made me weaker, sadder, more lonely, and more terrified in others.  I am not sure the trade off is worth it. It has been a crappy week in more ways than one.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/05/people-want-to-hear-yes-another-pity.html", "title": "\nPeople want to hear (yes, another pity party)\n"},
{"date": "Monday, July 12, 2010", "body": "\nSam has had some rough nights over the past couple of weeks.  I think he has built up a tolerance to the melatonin b/c he is waking at around 3am.  He refuses to stay in his bed and he works himself up into a frenzy - jumping, running, stomping, flapping, and laughing.  He crashes at around noon and sleeps a bit.  I, of course, have consumed so much coffee by that point I can't nap myself.I don't think medication is working for Sam.  I always think I see something at the beginning of each new intervention but I think it is just because I am looking so hard I find things to hold on to.  I am taking Sam back to the neurologist this week to see what the next step should be.  I assume we will wean him off (shouldn't take long since he is on such low doses).  I would like to try other options but she may tell me there are none.  I know WANTING to medicate my child may sound funny but you have to realize that he cannot function in the world.  His behaviors are not manageable.  We have done countless hours of behavioral interventions with very little to show.  He is still mostly non-verbal, pretty hyperactive and extremely impulisive/compulsive.  I had a couple of therapists come look at him last week and they both agreed that there is more intellect in there than we can see but his stims and microsecond attention span make simply functioning impossible.  They both felt that if there was any way to reduce his level of distraction, he would be able to do much more.  I am not delusional - I don't think I have a little Einstein hiding in there but I do think he is capable of more.  That is why I want to try more meds.  My biggest fear is that he will still be like this when he is five feet or six feet tall.  How could I possibly manage him?  People tell me not to look too far into the future because things may change but his progress is sooooooooo slow and he is soooo tall that I don't think my fears are baseless.I hope the neurologist has some options for us.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/07/rough-nights.html", "title": "\nRough Nights\n"},
{"date": "Sunday, May 30, 2010", "body": "\nFunny how I only seem to want to post when I am in a bad mood.  I am feeling better today so I am going to try to post somethign more positive.  Sam's poop issues are still driving me bananas.  I don't know what is going on.  I think it may be something Freud could comment on since I think there is some control/sensation issue involved.  I am also looking at his diet.  He has been eating more fruit and I wonder if things are moving more quickly than he is used to?  I had to throw away the little trampoline we had in the family room last night.  I want paint too detailed a picture for you but imaging play doh going through the spaghetti maker?  Yeah.  gross. I finished grading a huge number of research papers so that weight is off my shoulders. I am gearing up for Sam's IEP meeting.  I just got his re-eval reports and basically he is functioning in the Maya is talking up a storm and adding new words every day.  It is very cute to hear her in her crib yell out \"Hear I come!\".Both kids are enjoying the nice weather.  We have worked hard to set up the backyard like a playgrounf.  Today will be fun for them.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/05/feeling-better.html", "title": "\nFeeling better\n"},
{"date": "Sunday, July 18, 2010", "body": "\nOur first try with medication a few months ago included Trileptal (since his EEG suggested seizures and meds can trigger) and Risperdal (tiny dose).  As I do with most interventions, I thought I saw something change but it didn't last.  I don't feel those meds helped him.  Sam's school disagreed and felt they saw something but I suspect it may just have been a touch of development. I had two additional therapists come to the house and describe to me what they saw as Sam's biggest obstacles to learning.  They both felt his EXTREME inability to focus and need to stim are the issues.  We have done years of ABA and OT to address behavioral and sensory needs - we need somethign stronger.  I used their feedback when I met with the neurologist and we made a new plan.  We are trying Adderall (fraction of a dose for now).  This med is for ADD/ADHD.  SHe warned me that is may have the opposite effect on Sam since that seems to be the case with many autistic kids.  He still takes the Risperdal at night to try to help with sleep issues (still no better - up most of last night).  I suspect that we will take that one away soon since I don't think it is doing much.  I know many other people who have had good luck with it but I don't see much - either it doesn't work for him or he needs a higher dose. The medication is not in place of any of the other work we do.  Sam will continue in his school and home programs - we just hope the medication helps him learn more effectively.The first two days were interesting.  Sam is starting on half of his prescribed dose.  He WAS calmer for a few hours but it didn't last.  By 11:30 he was wired again.  He was up from 2 am until 5:30am.  Same thing today- calm until midday.  I am curious to see what happens when he gets  the full dose. So we continue.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/07/this-weekend.html", "title": "\nthis weekend\n"},
{"date": "Monday, July 19, 2010", "body": "\nHope is the most powerful drug.Right before each new intervention I ride this wave of hope; it gets me every time. I think to myself, \"Maybe this is it! Maybe this time he will start it understand me and to interact with the world in a productive way.\" THen, hours (or sometimes minutes) before we try whetever diet, supplement, therapy or medication I fall into total despair. I convince myself nothing will change- I am destined to be housebound with an unmanageable child. I will lose my job because no one will be able to watch him for that 5-30 minute gap between when his bus drops him off and I get home because he is too difficult for someone else to watch. Without my job we will all lose out health insurance. We will be hit with medical bills that stretch our already strapped financial situation and we will lose the house. . . you see where my mind goes. Perhaps this is a defense mechanism. It prevents too stark a contrast between reality and my expectations.I went through this rise and fall of hope right before starting our current plan. After spending Saturday morning fully depressed as I gave Sam his first dose, I am now cautiously hopeful. Adderall seemed to calm Sam down for a few hours in the morning each day so far. His vocal stims were reduced, his hand flapping was down and he was less frantic to get outside and start stimming with his straws and the deck boards (usually he starts yelling \"TIDE, TIDE, TIDE\" at the top of his lungs about 15 minutes after he gets out of bed). The effects were brief - about 3-4 hours- but noticable. Later in each afternoon we noticed some slight differences as well. Sam seemed just a bit more interactive. We saw lots of deliberate and direct smiles. Also, Sam came in from outside all on his own a few times to ask for \"gickle\" (chase and tickle). He will ask for that sometimes in the house or if we are all out together but this was Sam leaving his stimmy activity and coming in to tell us something interactive he wanted to do. I hope now that Sam is up to the full (but still lowest) dose the effects might last longer. I know some kids take a half dose at noon to help them through the afternoon. Before we look into that I want to be sure these effects are real and not some placebo effect.As for sleep, we have not made much progress. Ever since his 3mg of melatonin stopped doing the trick, he has been up most of every other night starting around 2am. He is wired and unable to settle back to sleep. He often crashes again around 5 or 5:30, just in time for Maya to wake up. I try to let him sleep for an hour or two before getting him up for school. The neurologist said we can give a higher dose of Risperdal at night, try clonidine or increase melatonin (or perhaps some combination of those options). I prefer to increase melatonin for now since it is the more natural option. We will see how that works.Today, Sam is at school and I am very curious to see what feedback I get from his teacher. I hope I have not deluded myself into seeing something that is not there.**Update** News from school was not good.  Sam was aggitated and emotional.  Was it the med?  Monday blues?  We will see.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/07/my-chemical-romance.html", "title": "\nMy Chemical Romance\n"},
{"date": "Sunday, July 25, 2010", "body": "\nWe are running around making last minute preparations for this week.  Early tomorrow morning I will drag the kids out of bed at about 5:15 (of course they may be up already)and drive my husband to the hospital.  He is having a hip resurfacing procedure (similar to a replacement).  This is his second procedure - he had the other hip done a couple of years ago.  The recovery is rough.  He will be able to walk but slowly and with crutches.  It will be a while before he has full stability.  Once recovered though he should be in better shape than he has been in years.  He has been in tremendous pain for many years.  Unfortunately, our financial issues have prevented him from being able to take the time to get this done.  We aren't exactly in a great position right now but he can either do it now or wait until next summer when I am home again and able to care for him.  It will be tough on all of us.  Mark is not responsible for much of the child care but after the surgery he will not be able to do any for at least a month, probably longer. On the sleep front, Sam just had two great nights.  It may just be chance but I have a theory.  I think the bottle of melatonin we had been using may have been defective.  I switched to a new brand (same dose) and we got two nights of great sleep.  I guess time will tell on that one.  Now if only I could get Maya to sleep.  She still wakes like a newborn most nights.  I think some of it is behavioral - those months of continuing to nurse when my milk supply was so low led to lots of middle of the night feedings and she never dropped the habit.  Also, I think she just gets hungry.  There are days when she hardly eats anything and I think she wakes up feeling empty.  I am trying to get her to eat more but she is stubborn. With the medicine, things seem to be going well.  The week we just finished was tough but Sam was ill with a fever ( I suspect roseola since he has a blotchy rash today).  Since the fever went away, Sam has been very calm.  He has been stimming less in the morning and he has been much better in the evenings.  I took both kids to Trader Joe's yesterday.  Maya rode in the cart and I held onto Sam's hand as we shopped.  When I was checking out I wanted to help bag but I was afraid to let go of his hand.  I gave it a shot and Sam just stood by the wall and waited for me.  Had I tried this a little while ago Sam would have run off and pulled things off shelves.  Again, this could just be a fluke and not the meds so time will tell on this one as well. The next few weeks are going to be very interesting.  Hopefully we will all make it through with our sanity.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/07/getting-ready-for-week.html", "title": "\nGetting Ready for the Week\n"},
{"date": "Thursday, August 12, 2010", "body": "\nEven when I vow to be positive, I have a hard time staying that way.  I don't think it is just the result of autism; I think I have always found myself more on the side of worry and frustration.  I have been thinking a lot about the source of my most recent bout of anger.  I suspect it stems from a combination of the \"Just-World Hypothesis\" and a sense of entitlement. The just world hypothesis is the idea that bad things happen to bad people and good things happen to good people.  It is something we all KNOW is false but it still lurks somewhere in most of our minds.  We perpetuate it by saying things like \"what goes around comes around\"  when someone does something mean (because we assume something bad will come back this person) or \"You sooo deserve that\" when someone gets something good.  We don't mean any harm with these comments but they present the idea that if you are a good person you should get good things and if you are a bad person you should get bad things.  So when bad things happen to you, is it payback for some earlier wrongs you committed?  Probably not.  Plenty of bad things happen to good people but this hypothesis lurks and prompts thoughts like \"why me?\" and \"what did I do to deserve this?\"Then there is entitlement.  I think many of us who were raised in middle class homes are guilty of this.  We assume that if we follow the \"rules\" and work hard, we will end up better off than our parents.  That is how is works in America, isn't it?  My parents were immigrants and I saw them move from supporting us on an assistant professor's salary with very little to their names to earning a pretty good middle class income (my father an ivy league researcher and my mother a full time teacher and part time classical singer).  It didn't hurt that they came here with Oxford degrees and did not have to face the racial prejudice many immigrants deal with.  My point is, I saw it work.  They followed the rules - they made the most of their educational opportunities, worked hard, and they \"made it\".  Halfway through my childhood we moved into a 3 bedroom home on a pretty street in a neighborhood with good schools.  We took vacations - nothing too crazy - a week at Cape Cod one year, a visit to the rest of the family in England the next.  THey put 2 daughters through college - Barnard for me and Brown for my sister.  I guess a big part of me assumed that if I followed the same \"rules\" I would have a similar life. But really, just because you do well in school and work hard,    Who says you are entitled to a pretty suburban home?    Who says you should get to go on vacation?    Who says you should earn a great salary?    Who says your children should be \"typical\" and grow up like everyone else?People with what look like \"perfect\" lives may have done very little to deserve them or they may have been the most wonderful people in the world.  The Just World Hypothesis is false but it creates frustration regardless. I realize that happiness is a choice.  I can attempt to appreciate the small things that go right in a day or I can moan over the life I wish I had.  Happiness is a choice but it is one I am just not very good at making.  Obviously, I need to work on that.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/08/reflection.html", "title": "\nReflection\n"},
{"date": "Tuesday, August 10, 2010", "body": "\nI think the worst is over, for this summer at least.  My husband's hip is healing nicely.  It won't be back to normal for quite a while and he still has quite a bit of discomfort but the recovery is going better than the first time he had this procedure.  He has been able to drive a little this week which is a huge relief.  He is trying to go into work a few hours a day which is also a huge relief.  As soon as he gets home he has to lie down and elevate the leg and he still can't help out but it is good for him to get out of the house for a while. Last week was hell week in my mind.  Mark was mostly bed-bound and Sam had no ABA or other therapies.  Who needs a stairmaster? Over hell week Sam developed a new obsession - the swing.  When he was a baby, he hated swings but once he was moving on his own, he loved them and he has loved them since.  Over this past week, his love hit obsessive heights.  From the second he was allowed outside each day he began requesting \"Wee\" (swing).  I would push him for a while and then take a break.  The second I stopped, \"WEE WEE\" would begin.  After a few minutes break I would concede to push him again.  Repeat and repeat.  At some point I would let Sam know that I had other things to do (care for 2 year old, cook, clean, wash clothes, wash or feed husband).  Complete tantrum.  The sort that involve throwing, screaming, pulling, etc.  Of course once such behavior begins, I can't give in.  He must become quiet and request nicely if he has any hope of getting what he wants.  We had some very loud afternoons. Over the weekend my husband wanted to see if he was steady enough to push the swing.  Very nice, don't you think?  I thought so, except that he chose the middle of one of Sam's tantrums to give it a try.  I think he thought he was helping me out by getting Sam to stop screaming.  The thought was nice but by offering to swing Sam in the middle of the tantrum, he was rewarding the tantrum.  He told Sam to get ont eh swing and stop crying so he can swing.  To me there is a big difference between stopping the tantrum BEFORE getting on the swing and stopping the tantrum BECAUSE he is getting on the swing. Sam's new medication seems to be ever so slightly quieting some, but not all, of his stims.  The vocal stims are less frequent and the straws seem to hold a little less appeal but his attention span remains almost nothing.  His sleep is a little better.  I had hoped for more as usual but we are pretty much where we always are.  It reveals a personality trait I am not particularly proud of - insane jealousy.  I am so insanely jealous of people whose autistic children are progressing and learning.  I am happy for them as well but in my private moments I am just jealous.  What am I doing wrong? - public therapy? private therapy? vitamins?  supplements? diets? home program? behavior plans?  medication?  I have tried it all.  And still, except for potty training, Sam has not mastered a single age appropriate skill.  He doesn't have a single appropriate play interest - not videos, puzzles, books, trucks, cars - nothing.  If you attempt to engage him in any appropriate activity he will scream and run away.  He doesn't \"get\" them.  His most recent assessments place him in the So there is my confession.  I am not proud of my feelings but they are very real.  To all of you out there who are seeing your children make great strides - learn to play, to interact, to talk to socialize, to self-care - I am thrilled for you and for the possibilities your children reveal but I am also insanely jealous.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/08/ups-and-downs.html", "title": "\nUps and Downs\n"},
{"date": "Saturday, August 28, 2010", "body": "\nSIBLINGSOne of the nice aspects of Sam being older than Maya is that to her, he has always been this way. When she came into awareness there was this boy who doesn't really talk, who makes funny noises and chews on straws.  Because she is only two, she has not yet defined what is normal in her own mind. Perhaps, because of her experience, her ideas will not be too rigid. In Maya's mind, mommy is this way, daddy is that way, and Sam is another way.Maya long ago passed Sam in her verbal and play skills. At times she tries to engage him in her doll or kitchen play but often she seems to realize that it just won't work. Sam does his own thing. She is aware enough of his quirks that she does a Sam imitation. If you ask her what Sam does she will drop a straw into his straw box (a big plastic tub with slits cut in the top for him to drop things through - it saves our air vents) and waves her arms saying \"Oooooooooh\".One nice thing they do \"together\" from time to time is chase. Maya will tell Sam, \"gonna get you\" and he will take off running. She will squeal with delight and try to chase him. They can't reverse roles - Sam only knows how to BE chased and tickled, not how to do it to someone else- but Maya doesn't seems to mind.Every so often Sam will lean over and stroke Maya's cheek or hum right in her face, acknowledging that she is there.SANDWICHFor some reason, one of my recent obsessions has been getting Sam to eat more appropriate lunch foods. For one thing, as he gets older he will no longer be allowed to have food heated up for him at school. He is allowed in his current classroom but as he moves up, the other building (in a different town) doesn't allow microwaves in the classrooms. I also just don't think it is a good idea for him to eat pasta products allthe time. I decided a few months ago I wanted him to be able to eat a sandwich.We worked an eating program into Sam's home program this summer and it has gone very well. Prior tot he program, Sam would pinch off tiny pieces of the sandwich rather than take bites. Or he would pull the sandwich apart and lick or pull out the filling but leave the bread. THe program involved started with a full physical prompt along with SD: Take a bite. We faded back to just verbal and gestural prompts as needed as he got better. I also started him on a very easy sandwich - butter and golden syrup (looks like honey). It is easy to bite, the pieces of bread stick together nicely and the flavor is mild. For the past two days, outside of his home program, I have made Sam sandwiches for lunch. He ate them perfectly with only one or two verbal reminders to \"take bites\". I am very pleased. My hope is that we can add more flavors over the next few months - peanut butter, almond butter etc. Then maybe we can move onto things that are harder to bite like turkey and cheese but that may be asking too much. My hope is to also build in a fruit and vegetable eating program as well. Sam will eat fruit purees (baby food) but rarely will he eat solid fruit.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/08/siblings-and-sandwich.html", "title": "\nSiblings and Sandwich\n"},
{"date": "Wednesday, August 25, 2010", "body": "\nI had to take Sam off the Adderall.  It was working in many ways.  Sam was stimming less - he was making fewer noises, he was paying attention a little better and he wasn't throwing things at the ceiling compulsively.  Unfortunately he was spending about 50% of his day crying or having intense tantrums.  My mother drove down one day last week to try to give me a chance to go into my classroom for an hour but as soon as I got there I had to turn around and come home because Sam was freaking her out by crying and being aggressive.  It stunk.  The only upside was that my mom got a chance the worst of his behavior.  I think sometimes other people think I am over protective about leaving him.  I suppose I am a little bit but only because I know how he can be.  I don't want to plan to be half an hour or more away doing something important only to get a call that Sam is scaring the pants off a sitter. Sam has had these types of tantrums before but never so many at once and for such a long stretch of time.  I suspected the Adderall might be to blame.  I took him off (after talking to the doc) and he was happy again.  Unfortunately, he is back to climbing the walls and throwing things at the ceiling all day long. So, it seems we can't live with it and we can't live without it.  (btw, he has been on behavior plans for the throwing for the past 2 years.  Nothing helps.  I am just waiting for him to smash a light bulb in his or someone else's face)\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/08/medication-failure.html", "title": "\nMedication Failure\n"},
{"date": "Friday, September 3, 2010", "body": "\nWe are back in territory I had hoped we left long ago - sleepless night.  Sam used to wake frequently as a baby but he went back to sleep pretty easily.  He also went through phases when he would sleep through perfectly.  Just before he was 2 1/2, he began having a lot of trouble sleeping.  He insisted on my staying with him while he fell asleep.  Then he would wake in the night and want the same thing.  Eventually he stopped going back to sleep for HOURS.  At the time I was pregnant with Maya.  I was beyond tired.  One night I never even go to go to sleep because he woke so often.  Then I taught the whole day.  At that point I decided Sam had to cry it out.  It worked like a charm.  THe first night was tough but by night 4 he was right to bed on his own.  He still woke in the night but he stayed in his room and on his bed until he fell back asleep. At 3, Sam began waking more and more.  He would stim on his bed for hours and look like a zombie the next day.  On occasion he would get out of bed and I would have to settle him back down but usually if I repeated the bedtime routine, he would go back to bed.  Even if he couldn't sleep, he would stay in his room.  At that point, Maya developed sleep issues.  It was pretty much my fault.  When I went back to work, my milk supply dropped (for my body, pumpin gjust doesn't keep my milk flowing the same way nursing does.  Plus, as a teahcer, I can't always take a break and pump when I would normally nurse).  I insisted on nursing at night because I wanted to give Maya all the health benefits for as long as possible.  Since she wasn't getting a great feeding from me in the evenings, she would wake a feed at night.  She continued long after she was weaned and really only started sleeping well a few weeks ago. I don't remember exactly when I started Sam on melatonin but it brough some peace to his night.  Every so often he had a rough night but not with the same regularity we used to see. At the beginning of the summer Sam began waking again despite the melatonin.  It sook my nerves and sent me into a panic - if the melatonin stops working will we have to turn to a medication to get some sleep?  When we did the Adderall experiment, things seemed to even out.  He slept better in July.  Of course then we had the side effects and stopped the Adderall.  The first few days off he still slept fine.  Just over a week ago he began to have some problem.  he went to sleep well but woke sometime between 2 and 4wanted my company while he stimmed for a few hours.  Most time he wouldn't go back to sleep. This past week Sam also began having trouble falling asleep.  He screams if I leave the room before he falls asleep.  Luckily this seems to only take 20 minutes or so.  Then he wakes around 1 or 2 and cries for me to come back.  He then proceeds to NOT sleep until morning when he falls back asleep for a couple of hours.  I have to go to work at that point (or take care of Maya depending on the day) and try to function feeling like a zombie. I don't know why this is happening (besides the obvious \"autism\" answer.  Has he built up a tolerance to melatonin?  Has being out of a routine (no school in August) been too much for him?  Is he going through something physically that he can't express?  I just don't know.  What I do know is that I can't do this much longer.  I need to be able to do my job well and Sam needs to be able to start school again next week with the ability to learn to the best of his ability.  I don't know what next steps to take.  Slow release melatonin?  give it time and see if he does better once school starts?  Beg for Clonodine?  I don't know but I need some kind of plan.  Letting him \"cry it out\" is no longer an option because he can get out of his room (climb the gate). Any suggestions are welcome. -We have a bedtime routine-he takes 3-4 mg of melatonin-he is still on Risperdal\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/09/how-do-i-bribe-sandman.html", "title": "\nHow do I Bribe the Sandman?\n"},
{"date": "Friday, September 10, 2010", "body": "\nThank you for the comments.  I can't tell you how nice it is to get such thorough responses. This week has only gotten worse.  I increased Sam's melatonin to 4mg every night and I added magnesium.  He still will not go to sleep on his own but he falls asleep quickly.  Then he wakes multiple times during the night in a panic that I am not there.  With the melatonin increase, he falls asleep again more quickly (before he often would NOT fall back asleep or take hours to do so) but he wakes up again an hour or so later looking for me again.  Now, I suppose I could just sleep eith him but I am not willing for a number reasons.  With the way Sam arranges himself on his bed, the only way I can lie down is to curl up at the foot of the bed.  That is not a great way to rest night after night.My next step if to try time release melatonin.  I also contacted the behaviorist at Sam's school to see if she has any suggestions.  If neither of those steps work, I may have to find a way to safely secure Sam in his room and let him cry.  I know he CAN sleep on his own and I suspect this is a behavioral phase.  It sounds mean but cutting him off is generally the best strategy with him - he doesn't \"get\" gradual change.  I don't know what we will do with Maya those nights but I would rather have her sleep ruined for a few nights than mine ruined for months or years.  If we still have no luck I will consider sleep meds.  Cross your fingers for us.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/09/next-steps.html", "title": "\nNext Steps\n"},
{"date": "Saturday, September 11, 2010", "body": "\nOne of the most difficult aspects of having a disabled child is the isolation.  I have never been a social butterfly but I never imagined I would have pretty much zero involvement in the community.  This has been on my mind lately because Maya is getting to a point where whe wants to be out and about, meeting people and socializing.  I had one of those magical days yesterday when Sam had school and I didn't have work.  Maya and I took a walk over the to local park and she had a blast.  She played alone at first and then with an older girl who took an interest in her.  This is something I cannot do when Sam is home.  The park is not fenced in and I can't rely on him to stay within a safe distance of me.  Plus, there tend to be a lot of wrappers and straws on the ground and Sam has a compulsion to pick them up.  If the weather has been damp, the park has huge puddles and Sam makes a beeline for them.  He will happily jump in them and drink the muddy water. I have been looking for a church lately.  I miss the routine of going on sundays and feeling connected to a community.  I heard about a Catholic church that is starting a \"differently-abled\" mass.  I am not Catholic, and in fact take issue with a number of things in the Catholic church, but I am open at this point.  I don't have to take communion.  Unfortunately, their idea seems to be to have a separate mass during which people with disabled kids can attend with their children.  Sam can't sit through mass.  He would splash in the holy water, chew on the books, and all kinds of other things. I contacted two UCC churches in the area since that is the denomination in which I grew up.  Pastors from both churches responded to me quickly.  They were both very open to having me come see the church and meet the congregation.  Neither has a special needs program or any kids like Sam so while I will probably go and look, I don't know if either will work out.  WHat do other special needs families do?  Do they just stay home and remain invisible?  I have asked around and not found any churches with accomodations for kids with severe developmental disabilities.  There is a Jewish temple a couple of towns over offering to work with kids IEPs in the religious religious school classrooms but as with everything, I think Sam's severity is more than most people expect.  He cannot be in a class with typical kids.  And I am not Jewish - I am open for the sake of community but I would prefer not to change religion. What I really want to find is a church with a nursery-style room for developmentally disabled kids with bean bags, tramoplines and basic sensory toys.  Sam could \"play while I sit through the service.  I don't think it exists around here. I am at a loss on this one.  I realize Sam will not understand anything about church or religion but I don't like the idea that I HAVE to leave him at home and just take Maya.  I DO want Maya to have exposure to religious education.  I firmly believe that religion must come from within though and it will be completely her choice if she chooses to remain part of a church once she is old enough to decide.  I just think it is important to learn the history, the stories and the traditions while one is young. If anyone reading has a low functioning child, what kind of community activities have you found?  or do you just stay home like we do?\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/09/in-search-of-community.html", "title": "\nIn Search of Community\n"},
{"date": "Sunday, September 19, 2010", "body": "\nNight one went better than expected.  Sam woke at about 2:10 just like I expected.  I took him to the toilet just to make sure that the need to pee didn't factor into any future night wakings.  I put him back in his bed and repeated the routine.  He cried and called for me.  He pulled on the door.  Then he tried the \"naughty\" stuff again, flicking the light switch and throwing a few toys.  After about 10 minutes he climbed into bed and whimpered a bit.  He switched to stimmy noises and hummed to himself for the next 20 minutes.  At that point he let out one last \"mama, mama\" and then fell asleep.  He slept for the rest of the night and didn't get up until just before 7am (late for him).  I was very pleased.  I was, of course, sad to make him cry and as penance I sat outside his door and listened to him long after I needed to.  I was happy to see that he was in better spirits after a pretty good night's sleep (compared to what he has been getting lately).Tonight, night 2, he cried again but for only 10 minutes and then he went right to sleep.  I suspect we will repeat in the middle of the night but it seems the idea is sinking in.  The possiblity of a full night of sleep for everyone soon is growing.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/09/night-2.html", "title": "\nNight 2\n"},
{"date": "Saturday, September 18, 2010", "body": "\nSam's sleep issues persist and I am very tired.  I suspect Sam is tired too but it manifests differently in him.  His pattern is to insist I stay while he falls asleep.  This actually doesn't take too long so if that were the only issue I could live with it.  He sleeps until somewhere between 12 and 2.  I suspect his little brain has gone through 1 long sleep cycle at that pointatsge 1,2,3 4,REM,4,3,2 and as he re-enters stage 1, a point when you or I would turn over, resettle or adjust our pillows, he snaps awake, looks for me and runs out of his room in a panic.  I take him to the bathroom, escort him back and help him fall asleep again.  It doesn't take too long.  I go back to bed but before I can get into a real sleep cycle myself he is up again.  This repeats about every hour until 4:30 or 5 and then he is done for the nightI have been on the phone with the neurologist every few days and she has been gracious enough to return all my calls even though there is nothing she can bill for.  We discussed various options.  The first was to assume this is behavioral and see if going back to a school routine \"re-sets\" his clock - it didn't.  Also, I could let him \"cry it out\"- I feared this option.  The second was to increase his medicine in the evening to increase sleepiness (and/or increase melatonin).  The third was to give him a heavy sedative for a few nights to \"break\" his habit of running out of his room looking for me (she mentioned this option but said she was reluctant to try it unless we were out of other choices).  The final option was to try Clonidine. We both felt that we wanted to avoid adding another medication unless nothing else works.  We adjusted when and how much he gets of his current medication and increased his melatonin.  The benefit of this was that Sam began falling back to sleep more easily during the night.  It did not prevent the wake-ups.  So while he got a bit more sleep, I didn't.  After yet another week of this I got a call from Sam's school - they were concerned about how tired he seemed (they also don't like the lunches I have been sending but that is another story).  I was a little surprised since I informed them of the sleep issues a while ago. Surprise, he is tired.   I even put in a request for the behaviorist to advise us (a request which I have not heard back about - but that is a whole other post).  I also felt terrible at the end of this week.  I have a full teaching schedule, Sam's afternoon therapy hours and a house to maintain.  Did I mention I am pregnant?  - yeah, almost 15 weeks but friends, please maintain Facebook silence on this one until I tell work. I spoke to my husband this afternoon about the next step.  I felt strongly that it would be a bad idea to add more medicine before trying a behavioral approach.  Now that Sam has a boost with his current med and his supplement, he SHOULD be able to stay in his bed all night.  The fatc that he is able to fall back asleep when I am in there tells me he SHOULD be able to make it through the night.  The running out and looking for me seems behavioral to me.  I told him I wanted to try to extinguish the behavior starting tonight.  The hard part about this is that I cannot lock him in his room (no lock), he can climb any baby gate ( he is VERY tall), and his sister sleeps in the room next door.  I didn't exactly have everything figured out but I started our bedtime routine determined to succeed. I put Sam to bed with his usual song and then I walked out closing the gate behind me.  As expected he began to freak out.  It is terrible when your non-verbal son manages to scream out \"mama mama mama\" and you can't go.  He cried and stomped and kicked and cried some more.  He threw all his pillows out and climbed the gate.  I put him back in.  Repeat.  I added a second, pressure mounted gate on top of the first but he punched it down.  I held the doorknob.  He pulled and cried.  Then he decided to be naughty to see if I would come in.  He started flicking his light switch and throwing toys.  He tried the door a few more times, still screaming.  I heard him climb into his bed and bury his face in his pillows.  He continued crying but it got less intense.  He ran tot he door again, pulled and screamed.  He got back into bed and cried more quietly.  The he fell asleep.  The whole ordeal took 20 mintues.  It was only 20 minutes.  I don't want to minimize how emotionally painfull those minutes were for him (or me), but now he is asleep in his own bed and he fell asleep without me. I don't like that I had to shut him in his room.  That is not the kind of parenting I wanted to do.  I just don't see any other choice.  He doesn't have the comprehension to reason or bargain with.  And when it became a choice between shutting him in and adding more medicine, I felt better about shutting him in.I suspect he will wake at least once in the night and we will repeat this process but at least my resolve will not be new to him.  WHen he wakes I plan to take him to the bathroom, put him back to bed and walk out.  If I have to hold the door again I will.  In the past, with issues like this, Sam has taken about 3 days to adjust.  I am hoping this holds true.  If, after a week of this, Sam still can't make it through the night, we will consider more drastic measures.  I am looking forward to a few 8 hour nights later this week.  I can't even imagine.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/09/here-we-go.html", "title": "\nHere we go. . .\n"},
{"date": "Monday, September 20, 2010", "body": "\nSam did very well last night.  He cried again at bedtime but only for about 10 minutes this time.  He slept through the the night until 5:30 and I have to get up then for work anyway.  We are headed in the right direction. \n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/09/jammies.html", "title": "\nJammies\n"},
{"date": "Monday, September 27, 2010", "body": "\nLet me just say that I am about to rant about school but I feel a little guilty doing so because I know I live in a state with some of the best special education services.  I know people in other states and countries might willingly give their left arm for these programs. I feel very frustrated with Sam's school at the moment.  When I feel this way I am never completely sure whether I am angry with the school or frustrated that Sam can't seem to progress - Whose \"fault\" is it?  Is he more capable?  Is the school good enough?The seeds of my frustration were planted early.  Right when Sam started school he developed an obsessive need to throw.  At first it was food and small objects and he woudl just toss them again and again and again. . .Sam's program provides 12 hours a year of behavioral consultation.  I had the behaviorist come and evaluate.  Her first suggestion was to ignore the behavior (which RARELY works with Sam) and then to make him \"pick up\" every time he threw.  He just incorporated the pick up into the stim.  The behavior became a problem at school as well so they \"took data\" and developed a behavior plan for use in the classroom.  That sounds great right?  It took over 4 months for the behavior plan to be developed. This seems to be a problem with the school.  They take a \"wait and see\" approach to behavior problems at first, then they have to take data, then they have to consult with their outside group to develop the behavior plan, then implement.  It takes FOREVER.  With a kid like Sam this is not appropriate.  Behaviors are very addictive to him and the longer they are allowed to brew, the worse they get. Once a behavior plan is developed, I have to look it over and sign off.  I sometimes have a good laugh.  For example, a behavior plan was developed for Sam's vocal stims which are socially stigmatizing and very distracting for him.  The first step in the plan was to tell Sam \"shh\" when he inappropriately vocalized.  THe second step was to lightly touch his lips with a finger and say \"shh\".  Seriously.  This is what someone was paid to come up with.  I signed off and added a note in which I told them the plan was not strong enough and wouldn't work.  SUrprise - it didn't work and was discontinued.  No plan was developed in its place. Right at the start of school this fall, I requested a consultation with the behaviorist to discuss Sam's sleep problems.  We were dealing with the chemical end with the neurologist but I knew there must be a behavioral component as well.  The behaviorist confirmed that she got the request . . . . and that is it.  There is no appointment scheduled or anything.  It has been nearly a month.  I understand that everyone is busy at the start of school.  WIth all the budget issues, this person is being pulled in many directions, I am sure.  But this is not some small issue.  Sam's lack of sleep was affecting his mood, his behavior and his family.  How can you let a family go this long without even a phone call?  I went ahead and tackled it as best I could but I would have felt better with some expert guidance. I am also frustrated because Sam didn't make much progress at all last year.  His progress reports were terrible.  His teacher was lovely but far less experienced than the one he had the year before.  Sam liked her very much but he got away with too much.  For example, in Sam first year at school, with the strong teacher,(age 3-4) he began using an open cup in the classroom, he transitioned from a Riftin (sp?) to a regular chair, his need for edibles was reduced and he worked for other things.  His second year, last year, he went back to the Riftin, went back the sippy cup and not only went back to pretty much all edibles but he began working for lollipops.  This is the teacher he is with again this year and I am not happy about it.  SHe is lovely and sweet but he is a nudge and he needs some one stronger. I try to keep telling myself that the problem might be Sam and not the teacher.  If I have trouble with him, I can't expect he will work perfectly for her.  But really.  Really?I called my case manager last week because there is another public school program for Autism and they have much more experience.  I KNOW from my various sources that some autistic kids in town have transferred there due to concerns with my son's school.  I want to visit the program and see if it seems more \"appropriate\" (have to watch how you say things to the child study team!).  I just told the case manager that I had some concerns I wanted to bounce off her.  She said she would call me a work at 2:30 today.  My cell phone was nearly dead so I called her ahead of time to set up an alternate number.  She was out for the day.  I am sure there is a good reason.  She was probably ill but I bet she properly cancelled her other appointments.  I cleared that time slot during my extra help schedule to talk to her and I am booked the rest of the week.  I guess I will have to call her on every prep period until I get through.  grrrrrr. Plus, I am getting fat.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/09/school-frustration.html", "title": "\nSchool Frustration\n"},
{"date": "Sunday, October 10, 2010", "body": "\nI tried a church this morning - on my own, without the kids.  It was really lovely.  The congregation is tiny - there were about 50 people there total.  Because the congregation is so small, during the passing of the peace, everyone literally greeted everyone else.  For the last song, everyone held hands.  It might just be hippy-dippy enough for me.  I enough just having an hour of peace and quiet.  I also think it was helpful for me to remember to think about people besides myself - to remember flood victims in Pakistan, people who have lost their jobs in this economic slowdown, victims of violence in the Sudan, and people who are sick and dying.  I was able to put aside being sad about Sam and all his Autism has taken from our lives (and his life)and think about how lucky we are to have jobs a safe place to live. I might go back another week or I might try a couple of other places.  There is another church of the same denomination in a different town and I might check that out.  I also heard about an Episcopal church that has a service designed for families dealign with Autism.  It is a short service and the kids are not expected to sit the whole time ot to be quiet.  I would like to try that one week as well.  Then I have to make a choice.  I don't know if I want to make church my \"get away from it all\" activity and just go by myself for now or if I want to kind a place I can bring the kids.  I am not sure I would get the same benefit from a service with Sam chewing paper, jumping off the pews and making his noises.  He is not going to understand the concept of church so is it worth choosing a place based on him?  In a perfect scenario the church would have a regular service with a special needs Sunday school room.  Then, I could get the nice calm church service and Sam could have an interesting place to play.  But I can't find such a place.  Tough call. I met with the Director of Special Services for my town and he was open to considering another placement for Sam.  True to form I brought 2 typed pages of notes on my concerns (since my first negative experience with the district I have been a nut about writing down my concerns and requests.  That way everything is documented and dated - most special education issues have time limits and that way no one can jerk us around).  He actually seemed upset that we were only presented with one option for Sam's original placement.  Now, it is very possible he was giving me a sympathetic act.  I am visiting the other option this week.  It is another public school program a couple of towns over.  I have heard good things from other parents and I know this school has more experience.  It may be no better but I am excited to see.  If it is no good then I have to battle for other options.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/10/church-search-and-school-update.html", "title": "\nChurch Search and School Update\n"},
{"date": "Monday, October 4, 2010", "body": "\nBoth of my kiddos take \"dance class\" this year.  Maya takes a Saturday morning class for 2 year olds.  They have to wear full ballet gear (pink ballet shoes, pink tights, and a pink leotard).  I was skeptical at first.  2 year olds?  Really?  But Maya loves to go to places full of kids so, since pre-school was out of our price range this year, I put her in dance class.  SHe LOVES it beyond belief.  The first day, when other kids cried or clung to mom and dad, Maya marched right in and got busy.  They don't exactly get a lot of dancing done but the 45 minute class is full of great activities.  They learn to follow directions, do things in a group, and pay attention to a teacher.  The very very early stages of dance are introduced - toe pointing, leg lifting, \"arms like a pizza pie\".  Maya cries when it is time to leave.  I am sure that any recital they do will be ridiculous (did I mention they are 2?)but she is learning a lot along the way.THe biggest issue I have with it is what to do with Sam while Maya is in there.  The first day, he did a beautiful job listening to his earphones and eating a snack.  Last week was a disaster. There is a door at the end of the hallway with an alarm on it. . .  Luckily for me the owner took Sam into one of the other studios and let him run around.  I ran to the bathroom to try not to cry in front of the other parents.  As I have said many times, Sam has NO appropriate interests so I can't bring him a game, a puzzle, a handheld video game  or anything like that.  I told my husband that I really need him to work his Saturday schedule out so that he can either stay home with Sam or take Maya to class.  We are getting to the point where I really can't do all this alone anymore.  My husband is not used to having much more responsibility than getting Sam on the bus in the morning.  All other times, including weekends, it is assumed I will be responsible for the kids.  Now that they are staring to do things outside the house I need him to fugure out how to be more involved. Sam also takes dance class.  The owner is an amazing person.  A few years ago a mother with two autistic daughters approached him and asked if he would consider doing anything for autistic kids.  She was having a hard time finding anything in which she could enroll her kids outside of school.  The Beyond Boundries class was born.  There is one teacher but some of the other adults that work there and some of the students who dance there help out so, usually, each kids has a one-to-one \"aide\".  I signed Sam up because the owner of the school is my neighbor.  I really didn't think it would work out.  We tried sample classes over the summer and Sam was way to hyper to participate in any of it.  But I signed up anyway.  As the start date grew near I began to doubt whether this was worth the time or the money.   I was ready to quit before we even started.  The first class was as ridiculous as I expected.  Sam put everything in his mouth and ran around the room like a madman.  The second class was pretty much the same but he did clap his hands and sway a few time.  Today was our third class and Sam did great.  He is still nowhere near the level of participation the other kids demonstrate but the difference from the first day until now is huge.  Sam jumped with the music a few times, kicked the pad when instructed, swayed back and forth with his aide (the owner).  Much of the time Sam looked spacey and confused but there were a few moments when he actually seemed engaged.  I think we will stick with it for a while.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/10/dance.html", "title": "\nDance\n"},
{"date": "Sunday, October 3, 2010", "body": "\nSo the district seems open to considering other placements.  My case manager told me on the DL that she was pretty sure she was going to get this call from me b/c of my comments at Sam's last IEP meeting and she pointed otu Sam's test scores to the director.  I want to see the other public program but I also want them to show me what other options might be available.  I am supposed to speak to the director directly tomorrow.  Cross your fingers for us.On the sleep front, Sam is doing better.  He often wakes up at 5 which isn't exactly the best thing but sometimes I can convince him to lie in bed with me for half an hour or so.  On most days I have to get up at that point anyway. Unfortunately, a few days after Sam started sleeping through, Maya started waking again.  She started sleeping a bit better this weekend.  I really hope their sleep patterns even out before I have to deal with newborn night wakings again. As for the pregnancy, I told my boss but I asked her to hold off spreading the word until all testing is complete.  I am almost at 17 weeks and I don't know how much longer I can stay out of maternity clothes.  I am much sicker with this one than the last.  For me, it has been worse each time.  Since I still have nausea and I still throw up from time to time, I am afraid it may be this way the whole time.  The worst is when I take my prenatal vitamins - about 20 minutes later I lose everything in my gut.  Fun. There are moments when I think having another child is a great idea - times like when Maya chases Sam or he chases her and they laugh together.  Other times, I think I have made a big mistake.  Not that the child is unwanted or anything but that s/he may be more than I can handle.  I won't be able to go to a grocery store or do much of anything unless I get serious help or my husband is able to set up a different schedule.  I am not sure I can deal with even MORE isolation.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/10/school-sleep-pregnancy.html", "title": "\nSchool-sleep-pregnancy\n"},
{"date": "Thursday, October 14, 2010", "body": "\nDo you believe in signs? I don't know what I think. But today I thought I was being pointed in a certain direction when I visited the new program Sam may attend.Many months ago, one a particularly bad day I sat on my deck with my head in my hands and cried (this happened many times but this day was important to the story). My nearly 90 year old neighbor spoke to me a little later in the yard. She asked about Sam and about me. I don't remember how it happened but somehow in the conversation she offered me one of her statues of \"the blessed mother\". I think it came up because I mentioned that one of Mark's patients gave him a saint card for Sam and I asked what she knew about that one. How do you turn down the offer of a statue of one of your neighbor's most sacred figures? SHe gave me a very simple white figure of Mary. It is in my dining room and when I walk by I am reminded of all the things mothers go through. WHen I arrived at Sam's new program, which turns out to be housed in a Catholic School, th, essentially living with our hearts outside of our bodies. There was almost the exact same statue right out front. I realize that is not huge but it struck me as I saw it.In a previous post, I mentioned hearing about an Episcopal church that has a service for families who have members with Autism. When I visited Sam's new program I found out that the church is about a block from the site and, in fact, they rent 2 classrooms there as well. I accidentally drove by in on my way home. Another sign?\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/10/signs.html", "title": "\nSigns?\n"},
{"date": "Saturday, October 23, 2010", "body": "\nOver the past two weeks Sam has started waking at night for increasing amounts of time.  Last night he woke up at 11:30 pm and he has been awake ever since.  We have not changed medications or supplements and we have not changed his routine.  I knew we would be back here again.  Every night since the behavior plan was put in place I have been going to bed with my fingers crossed.  It started with middle of the night wake ups.  I would take him to the bathroom just in case and then put him back to bed.  Each day his level of protest grew.  As he became more upset during the night it got harder for him to go back to sleep.  Last night he went to bed at 8 and woke up at 11:30.  Then he tried to come out of his room every 30 minuted or so.  Finally, he gave up trying to come out at about 3 and settled for making noises and kicking his wall.  At 5 he came out again and he was done for the night. I am pretty much out of ideas.  We have a routine, he gets lots of outside time most afternoons, he had plenty to eat, his room is a good temperature, he has a white noise machine. . so now what?  I really am not convinced it is worth continuing to give him risperdal if is isn't going to help him settle down when he really needs to.  I am going to call the neurologist but I don't know if this is one of her Saturdays at work.  Not sleeping is not an option - for him or me.  Clonidine?  more melatonin?\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/10/monster-returns.html", "title": "\nThe Monster Returns\n"},
{"date": "Tuesday, October 26, 2010", "body": "\nSam had an odd episode last night.  He woke up wet, which hasn't happened in a long time, at about 1am.  I took him to the bathroom and changed his clothes.  I put him back to bed but he couldn't sleep.  He hummed and bounced for about 2 hours.  During that time Maya woke a few times (she tends to wake up hungry because she refuses to eat dinner - seriously, I can't get her to eat after 5 o'clock).  I am sure all Sam's noises didn't help her relax.  At about 3 am Sam came out of his room and I broke with the behavior plan and let him come to our bed like he wanted.  Pregnant me was just to tired to fight him the rest of the night.  He fell asleep in the middle of our bed and rested very well.  It wasn't exactly comfortable for us but at least no one was crying.  At about 4 am Sam started making an odd noise in his sleep.  My husband thought it sounded like chewing but to me it sounded like lip smacking.  Either way, it went on for a few minutes then stopped.  Then it repeated a few times.  He didn't wake at all.I looked that up this morning because I thought I had read something about odd motor movements being connected to a certain type of seizure.  Lip smacking in sleep or along with zoning out can be a sign of Partial Complex Seizures. I called the neurologist about the sleep issue and to ask if the lip smacking sounded like a seizure.  As I expected, she can't say for sure.  We would have to do a video EEG to learn more.  I am thinking about it but I have no idea if Sam could tolerate it.  As for the sleep, she advised increasing the Risperdal slightly for the next few days to see if that helps.  If he is able to establish a good pattern, slowly lower it again.  IF it has no effect, reduce and try Clonidine. I hope one of these options works but I suspect we will battle to insomnia demon for the rest of our lives.  I am trying to see if I can spare a sick day from my maternity leave to take a nap.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/10/seizure.html", "title": "\nSeizure?\n"},
{"date": "Wednesday, November 3, 2010", "body": "\nSo it is not working.  At least not yet.  Sam has regressed back to where he was a while ago.  He wakes around midnight and wants to sleep in my bed.  I take him to the bathroom and put him back in his room.  He yells and cries and tries to leave.  I hold the door shut until he settles down.  Repeat every 1/2 hour to hour for the rest of the night.  At around 5 or 6 he will end up in our bed so he can grab an hour or two of sleep before school.  It is too late for me at that point.  He manages to stay awake with 2 meds that should make him sleep and melatonin.  That is one messed up brain. A friend at work suggested that I might have to put a lock on his bedroom.  Then I wouldn't have to stand by his door most of the night.  I know many families have had to do so for safety reasons.  I just hate the idea.  When I became a parent I never imagined locking my child in a room.  But I know I may have to.  If any of you have had to secure your child in a room at night please share.I don't know what to do next if this doesn't change.  Sam is holding it together since he gets that nap before school.  But how long can a little boy last on so little sleep?  I am trying to function on about 2 hours of sleep a night and I feel horrible.  So far, I don't think it is affecting my job or the preganancy but how long can that last?  I sort of snapped at my mom that other day because she said, \" you really need you sleep; you're pregnant.\"  I know she was just showing concern but in the moment it just made me mad - as if I don't know I need sleep?  As if I am not getting any on purpose?  If I had a solution I would go for it but I don't.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/11/no-sleep-til-brooklyn.html", "title": "\nNo Sleep 'til Brooklyn\n"},
{"date": "Saturday, October 30, 2010", "body": "\nSam has continued to have sleep issues this week despite my manipulating the things he already takes.  I spoke to the neurologist again today and we are adding Clonidine.  I have no idea if it will work.  I am pretty much assuming it won't.  Even if it does I am pretty certain it will stop working a few weeks after we start. Sam continues to have episodes of chewing/lip smacking/teeth grinding in his sleep.  My husband now thinks it might be seizures too. I want to have hope because we are trying a new med and Sam is starting a new school but I really don't feel any.  AFter a day of pulling rocks out of Sam's mouth, trying to stop him from throwing things at the ceiling, narrowly avoiding a major accident when Sam threw a boot at the dinner table missing the light fixture and my husband's plate by inches, and trying to explain to Maya that her brother just doesn't understand b/c he threw a shoe at her face, I don't have much positive left.  He isn't being aggressive, it is all stim.  This was all after a day in which he had lots of attention and lot of chances to work out his sensory issues.  We played outside for hours - he went on the swing, jumped on the trampoline, and ran.  Nothing turns down the stims.Hopefully it will get better but here's the thing - the problem with throwing all your energy into trying everything is that eventually there is nothing left and you are really really tired. I miss the little boy I had 3 years ago, before these stims came out, more than I can possbily describe.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/10/sam-has-continued-to-have-sleep-issues.html", "title": ""},
{"date": "Friday, November 5, 2010", "body": "\nObviously, wallowing in self-pity is not a long term solution so I have to make another plan.  A reader suggested a child proof door handle cover and to be honest, I never thought of that.  I bought one this morning and I am going to try it tonight.  If Sam simply tries to turn the door knob, he will not be able to get out.  The problem is, most of our house is absolute crap due to years of not being able to properly maintain it.  The basement is gross, the windows are drafty, the back room is barely insulated. Along with that, none of the bedroom doors close properly.  I have slowly been trying to replace the doorknobs that are so old they no longer turn.  The doors also need planing since they don't quite match up witht he frames anymore.  Sam's room has a door I fixed up a while ago but it doesn't quite latch close as securely as I would like.  All it takes is a good shove and you don't need to turn the door know.  So, if all Sam tries to do is turn the knob, it will probably stay shut but if he pulls, even without turning, it may open and then I will be back to hold the door closed.  I bought a lock I can put on if necessary but I would liek to try all options that don't make me feel like a horrible person first. I also bought Sam a long body pillow to try to make his bed more cocoon-like.  I don't think that will have any major effect but the pillows were on sale. Wish us all a good night's sleep.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/11/obviously-wallowing-in-self-pity-is-not.html", "title": ""},
{"date": "Friday, November 12, 2010", "body": "\nWe started the Clonidine a while back.  The first doses didn't work, at least not enough to get him through the night.  I added a child proof door knob cover.  It didn't work (b/c Sam wouldn't give up and door sucks).  I took a long hard look at our medicine experience and decided it was time to re-evaluate.  I do not feel that any of the manipulations of the Risperdal have helped Sam.  I have weaned him off.  I DID see some minor effects from the Clonidine.  It helped him throught the first half of the night and it seemed to affect his mood during the first part of the day as well.  He was a little calmer and happier.  I spoke to the neurologist yet again and she gave me the go ahead to try slight increases in the Clonidine.  Last night Sam got 1 3/4 tablets (.1 mg tablets) and he slept soundly until 4:15 am.  It was great ( Of course, Maya still woke up but she usually just needs to check in).  Tonight we go to 2 tablets and that is our limit.  We are going to focus on this for now and just worry about getting Sam's sleep under control.  Two people with no knowledge of his medication have commented on how happy he seems lately so I think that is a good sign.  If it works, I will just have to re-train MYSELF to sleep through the night.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/11/it-might-be-working.html", "title": "\nIt. . .might. . .be . . .working. .\n"},
{"date": "Saturday, November 13, 2010", "body": "\nNevermind.  It is 7:30 am and Sam is resting on the couch from a nearly all-nighter.  I have been up with him since 1 am.  There is no end in sight.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/11/nevermind.html", "title": "\nNevermind\n"},
{"date": "Tuesday, November 16, 2010", "body": "\nEven thought the sleep issue is far from resolved, I have seen some very nice things since Sam started Clonidine.  He is a little calmer.  I know many people object to the idea of controlling behavior through meds (and I might have agreed with you years ago).  For Sam though, his hyperactivity and impulse control issues were becoming safety issues.  He compulsively throws hard objects at the ceiling, he feel compelled to put his mouth on countertops and pots on the stove (regardless of whether they are hot), he puts rocks in his mouth, he jumps off of high surfaces, he jumps straight up in the air and lands on his knees, etc.  Years of strictly bahavioral therapy didn't help this.  If anything, I feel he has gotten worse.  So, with the Clonidine he is toned down a bit.  ALso, he is more affectionate.  He reminds me of the Sam he was when he was until about age 3.  He used to sit on my lap a lot, give full body hugs, nuzzle shis head into me and sit next me on the couch.  He is doing this again.  It is so wonderful to spend the last few mintues before bed sitting on the couch with Sam rather than trying to stop him from throwing blocks and books at the ceiling.  Finally, he is a little less frantic at night.  He still wakes multiple times but he settles down a little better. I don't know exactly how Clonidine works in the brain but I know it has a number of applications.  It was originally a blood pressure medication.  It is also used as a sleep aid, for ADHD and as an aid for smoking cessation.  For Sam, it seems to be a positive addition.  We are still working out the dosage.  I think we have to wait to finalize that because Sam has a fever this week and it is hard to tell whether he is groggy because he is sick or because he needs a lower dose. I would never tell another parent to put her child on meds but I am very comfortable with this choice we have made.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/11/not-all-bad.html", "title": "\nNot all bad\n"},
{"date": "Wednesday, November 17, 2010", "body": "\nI just made a donation.  I have exchanged messages/comments with this mom a few times.  SHe is insightful and her posts are interesting to read.  This a great chance to win a hand made doll for your child. http://ourownrooney.blogspot.com/2010/11/ode-to-my-friend-and-chance-for-you-to.html\n\n", "outgoing_links": ["http://ourownrooney.blogspot.com/2010/11/ode-to-my-friend-and-chance-for-you-to.html"], "link": "http://spectrumliving.blogspot.com/2010/11/i-just-made-donation.html", "title": ""},
{"date": "Wednesday, November 17, 2010", "body": "\nI am now 23 weeks along and I haven't really posted about this pregnancy.  Superstition may have played a small part in that but mostly I just didn't really know what to write.  My early ultrasound at 11 weeks went well.  I had my 20 week ultrasound (at 21 weeks) and they couldn't see the spine properly so I had to go back a week later.  The whole week that followed I convinced myself that the baby had a spine deformity.  The baby had flipped over by then and the doctor was able to see everything. I have a placental lake that the doctor wants to check on in a couple of months because there is a very slight chance that it could affect growth.  So far there is no evidence of that.  The baby is totally normal for age. I didn't find out the gender.  I found out for both of my other children and for both of them I enjoyed knowing.  For some reason I feel like waiting until the delivery room this time.  I had a strong feeling about the gender for the first two babes but I don't this time.  I was sure it was a girl in the early months but over the past few weeks I have had the feeling it is a boy.  I really don't trust my instincts on this one.  My mind is so distracted with Sam's issues of late that I don't think I have had time to process any real intuitions I may have.  A girl would make me feel safe.  I know girls can have autism too but it is less likely.  Perhaps having Maya gives me a false sense of security.  Lately though I have been allowing my mind to wonder about having a boy - a typical boy.  That would be great too- more than great.  I just know I would spend the first year and a half on edge. I was much sicker this time around.  The morning sickness started a little later (8+ weeks) but it lasted until about 19/20 weeks.  Near the end I wasn't throwing up everyday anymore but I was often close to it.  Even though I have only been vomit free for a few weeks, I already feel like that stage was ages ago.  That must be how people allow themselves to get pregnant again - If I have already forgotten the mroning sickness weeks later, imagine how little I will rememeber about it in a couple of years!Sam is unaware of the pregnancy.  People ask if I have told him.  I haven't hidden it but he wouldn't know what I what I was saying if I DID tell him directly.  Maya knows (as much as a 2 year old can know).  SHe calls the baby \"Baby Juice\".  She is very excited to know when Baby Juice is coming but I don't think the isea has much meaning for her.  It is very cute to hear her talk about it.  Anytime she sees something baby related she says, \"That Baby Juice's clothes?\"  \"That Baby Juice's blanket?\"  Very cute.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/11/pregnancy.html", "title": "\nThe Pregnancy\n"},
{"date": "Saturday, November 27, 2010", "body": "\nSee below:http://www.ourownrooney.blogspot.com/Do you ever tell stories that start \"My friend's brother's girlfriend's roommate . . . \" - there are some connections we have that seem so distant.  How did I end up religiously reading a blog about adoption from Ethiopia?  Back before Autism, right after Sam was born, I was sure our next child would be adopted.  My niece was adopted from China and her parents suggested I check out Gladney because the man who helped them with her adoption now works there (or did a few years ago, I have never spoken to him).  I was drawn to their Ethiopia program.  I read about their process to get familiar with everything involved and I followed the blogs of a few families who published their stories.  Lori Rooney's blog is one I was drawn to.  She makes me wish I lived in Portland. Fast forward to now.  Sam is five and severely Autistic.  We have 2 year old Maya.  Along the way, adoption plans had to be put off the table.  The money, the travel away from Sam  - all too much.  I sponsor a child through CHildren's Hope Chest (who is in an orphanage but is not available for adoption).  The Rooneys are in the process of adoption their second child, a five year old girl.  They held a raffle to help with their travel expenses.  Up for grabs was a handmade doll by a very crafty lady whose blog I also read from time to time (for the craft projects, not the adoption stories).  This woman's name is Autumn and her blog inspired me to dust off my sewing machine and get it tuned up.  I haven't actually had time to use it yet but maybe soon. . .I still read Lori Rooney's blog because I enjoy her writing style and the issues she raises.  I made a donation to enter the raffle and I won!  I would like to use the doll as a \"big sister\" gift for Maya when the baby comes.  Sam's disability requires that he get a certain amount of attention.  A new baby will also need a lot of attention.  We will, of course, try to make sure Maya gets the attention she needs as well but it will be nice to be able to give her a really special gift.  I might even order an extra when I know if the baby is a boy or a girl.  The gender is written on an piece of paper in an envelope in my car.  I haven't looked. The dolls look like this:http://autumnanddan.blogspot.com/2010/11/rooney-raffle.htmlAutumn has an etsy shop.  Check out her items.\n\n", "outgoing_links": ["http://www.ourownrooney.blogspot.com/", "http://autumnanddan.blogspot.com/2010/11/rooney-raffle.html"], "link": "http://spectrumliving.blogspot.com/2010/11/i-won.html", "title": "\nI Won!\n"},
{"date": "Sunday, December 5, 2010", "body": "\nNo, it is not a metaphor for Autism, I just like knitting. I have known the basics of knitting since I was very young. My grandparents owned a wool shop in England when they were alive. Their house was attached to the shop and I remember walking from the kitchen to the shop many times a day when we visited to walk around and browse all the yarn. Each visit I would passionately start some project and then drop it as I lost my focus. One summer when I was in high school (or was it early college?) I decided to try something more complicated than a stockingstitch or garter stitch scarf. My grandmother taught me to read a pattern for a basic cabled hat. It was a success and it drove me to try more things. I moved on to crochet and made a brown and blue blanket for my college bed. I didn't do any major projects for a while after college. After Maya was born I started to pick up knitting again. I heard an interview with Debbie Stoller (Stitch and Bitch books) and I tried a few of her projects with varying degrees of success. I ordered a book of baby knits because baby projects move a lot faster than projects for me. Below is my first attempt at something for Maya - a basic rollneck sweater. the neck it too wide but the rest worked well. The second project for Maya looks ok but it isn't very practical. This green cardigan is way too stretchy because I just icked the wrong yarn for it. I made a few things for myself that I like and one or two that I don't. I also made a beautiful Debbie Bliss sweater for Maya with pockets and everything but she doesn't like it because the neck it too high - sigh. Now I am working on a striped cardigan for Maya . It is a Debbie Bliss pattern made with Cascade Pima cotton yarn . I started it a long time ago but I had to put it aside for a few months. After Maya was born I got a small patch of eczema on the middle finger of my right hand. It slowly spread over the next year and by the time I was pregnant this summer it was fully covering three fingers and spreading to the other hand. My skin was craking and bleeding pretty much every day and knitting really hurt. This sweater was supposed to be a Christmas present for Maya and a while ago I gave up on that idea. Then, out of the blue about 2 weeks ago, my hand eczema cleared up. I have no idea why. Pregnancy keeping down my immune system so auto immune issue are reduced? I stopped throwing up a few weeks ago and I can keep down my vitamins and DHA? WHo knows. But now I am furiously working on the sweater agsain. I don't know if I will make it! I have finished the body and I am a third of the way through a sleeve. I have to finish this sleeve, make the second one, sew it together and then make the button band and collar. That photo is from early this summer before I put the project aside. I don't really know why I like knitting. Making your own sweaters certainly doesn't save money. There is no guarantee that the lovely sweater being displayed on the pattern is what you will get in the end unless you are very good.I have always like to make things - painting, photography, sewing, knitting, etc. I have nowhere to paint these days. Sewing isn't practical at the moment with the kids always around. I don't have a room where I can set up my machine easily and also keep tthe kids away from the needle. I recently had the machine fixed up and I am thinking about trying to use it after the kiddos go to sleep if I can keep my eyes open. Knitting is actually a little easier for me to work on around them, especially in the summer. I work on circular needles and keep a ball of yarn in my pocket while and follow them around in the backyard. People ask me if it is relaxing. Most of the time I would say no. I work on projects with fury, always thinking about finishing. It is the same way I read - finishing the book in 24 - 48 hours. I am also always thinking about what else I want to make. There is something though about the rhythm of the needles when I am sitting down in the evening. I like the feeling of getting a few rows done before bed. I often think about whether I am getting the same type of satifaction from the needles going in and out of the loops that Sam gets from tipping a cup or a book off the table 1,000times in a row. I guess the difference is that I have a vision of where my activity is leading. There is an end in sight, not just a sensation in the present. My next project is a kimono sweater for Maya using another type of Cascade yarn. I tend to shop the sale items on http://www.jimmybeanswool.com/ The pattern is this one:http://www.jimmybeanswool.com/knitting/yarn/BlueSkyAlpacas/BlueSkyAlpacasPatterns.asp?showLarge=true&specPCVID=7280Back to knitting if Sam can manage not to break anything for a few minutes : )\n\n", "outgoing_links": ["http://2.bp.blogspot.com/_P3O2yD1xoJ0/TPvv0bNXPwI/AAAAAAAAACc/5QYqMBCAfA0/s1600/09Christmas%2B215.JPG", "http://www.jimmybeanswool.com/", "http://www.jimmybeanswool.com/knitting/yarn/BlueSkyAlpacas/BlueSkyAlpacasPatterns.asp?showLarge=true&specPCVID=7280"], "link": "http://spectrumliving.blogspot.com/2010/12/knitting.html", "title": "\nKnitting\n"},
{"date": "Tuesday, January 4, 2011", "body": "\n                 The new trampoline was a hit.  I got an adult \"jogging\" trampoline this time which will be much harder to break. Christmas was horrible - really one of the worst days in a very long time. Sam frantically stimmed all day long and destroyed books after book. He seemed distressed at his inability to stop but he just couldn't turn off. Eventually I packed the books all away upstairs in Maya's room. Her room has a gate we have to keep closed so Sam can't get at them. I am going to have to try to figure out ways to steal a few minutes alone with Maya to read from time to time. The rest of the week was better. I was off of work and Sam and Maya were home with me. With the help of increases in meds, Sam was able to relax a little and he seemed a bit happier. I a relunctant to say the meds are working because it seems that as soon as I draw a conclusion about something, Sam's brain regresses back and I have to re-evaluate. He has had a good week at school so far so that is nice.I am starting to get some of the fun symptoms of a pregnancy in the third trimester. I am tired most of the time (although I guess I am lucky the fatigue really didn't kick in until now. Previous tired spells for me were clearly linked to sleep problems with the kids). My hips bones ACHE. THe ache makes it tough to sleep and tough to get comfortable during the day. I consider myself lucky that I haven't gained a ton of weight in any of my pregnancies so while my belly feel big, the rest of me hasn't blown up too much and I can still get around well. I also have never had trouble with leg or foot swelling. I am shocked sometimes to realize how close I am to having three children. I feel like I have barely had time to think about this pregnancy. I didn;t find out the gender this time. People ask if I am curious but I haven't spent a lot of time thinking about it. I don't want it to sound like I don't care, I just mean that it hasn't been something I have obsessed over because I have been too busy. For months Maya insisted she was having a sister \"like Maya\".  But now she is demanding a brother.  \n\n", "outgoing_links": ["http://4.bp.blogspot.com/_P3O2yD1xoJ0/TSe9D9mf9jI/AAAAAAAAAC4/7tNucypyaVk/s1600/10december%2B017.JPG"], "link": "http://spectrumliving.blogspot.com/2011/01/new-trampoline-was-hit.html", "title": ""},
{"date": "Sunday, December 12, 2010", "body": "\nMy conclusion that Clonidine was helping Sam during the day was wrong.  He was just sick.  It started with about two weeks of fatigue, then a cough and then high fevers.  He got so bad he became very dehydrated.  It ended with his first round of antibiotics.  As soon as he was better he was insanely hyperactive again.  Sigh.  I should have known. Sam's new stim involves taking children's books (board books) and putting them on the edge of a counter or table.  He opens the cover and then hits it.  He flaps his arms and watched to see if the books falls to the floor (it usuallys does).  He repeats this again and again - perhaps varying the location.  At times he gets very worked up and starts throwing the books.  Some throws are long throws, designed to go across the room.  Other throws are hard throws, meant to hit the ceiling.  Eventually these books break and he chews them a bit.  He engages in this activity fom the time he wakes up until the time he goes to bed.  I have repaired many books and thrown away many more that were beyond help. We have tried, without success, to defeat this stim.  The problem is that Sam does not engage in a stim for a certain period of time (10 minutes, an hour) and then snap out of it.  Pretty much every minute of his waking life is stim - that is the point to which he has regressed.  There is no other activity to which he can be re-directed.  I could force him to do a puzzle for a minute or to but then he is right back to the activity.  I have spent the last coupld of weeks following him around trying to re-direct his energy and it is not making a speck of difference.  After following him around all day yesterday, my birthday, until my hips and lower back were in too much pain to continue (pregnancy), I gave up.  I do not  have the ability to win this battle.  I will talk agin with our home teacher next week to see if she has any other suggestions.  I will try them with my strongest resolve but I suspect we will be right back here again in a few weeks.WHat makes this stim so sad for me is that he is destroying the very same books I remember readin with him before he got this bad.  He loved books.  He would hand me a book and say \"bead?\".  We would read and read.  He would smile and point to parts he remembered (the moon in Hickory Dickory Dock, the blueberry bush and the cat in Yertle the Turtle).  Now trying to get him to sit for more than 10 seconds is close to impossible.  Getting him to listen to a story makes his skin crawl and he starts yelling and jumping or running.  Even if I could \"train\" him to sit and listen, he takes no pleasure in stories anymore.  Whatever he once understood is gone. I suppose I should feel happy that Sam managed to be pretty calm over the Thanksgiving holiday.  We managed to host dinner without too many issues.  The hard part is now family keep commenting on how pleased they are with his progress.  It is a reminder of that hopeful feeling I felt in November - the feeling that I was getting a tiny bit of my boy back.  But now it is gone again.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2010/12/stim.html", "title": "\nStim\n"},
{"date": "Saturday, January 29, 2011", "body": "\nMaya's kimono sweater. I love how easy the pattern was and I think I will whip up another with some other yarn I have.First pair of baby booties.Second pair with a yarn I LOVE (Malabrigo 100% merino)Matching hatI also made an olive/burgundy baby blanket and I started a burgundy baby sweater. I also have this lovely organic merino wool waiting to be knit.But it may be a while before I can knit because I fell on some ice on Tuesday and I broke my left arm in 3 places. I spent the day and most of the night in the hospital having the baby checked and then getting surgery (awake with a nerve block b/c of pregnancy). I guess I am lucky it was my left arm since I can still do some things. The kids are freaked out and giving dad a very hard time when he has to do something I would usually do. Both are having a hard time sleeping. My arm should heal up by the time the baby is due. sigh.\n\n", "outgoing_links": ["http://1.bp.blogspot.com/_P3O2yD1xoJ0/TURo1WrRNHI/AAAAAAAAADI/8IXcr5ZBm6w/s1600/11January%2B009.JPG", "http://3.bp.blogspot.com/_P3O2yD1xoJ0/TURpewG9QEI/AAAAAAAAADQ/R6q47Osr-fA/s1600/11january2%2B001.JPG", "http://1.bp.blogspot.com/_P3O2yD1xoJ0/TURpzeuVbvI/AAAAAAAAADY/yNsN-ugWvrg/s1600/11january2%2B003.JPG", "http://2.bp.blogspot.com/_P3O2yD1xoJ0/TURqRMBbWHI/AAAAAAAAADg/oHLXP6ZjQUQ/s1600/11january2%2B004.JPG", "http://3.bp.blogspot.com/_P3O2yD1xoJ0/TURrS7rFRdI/AAAAAAAAADo/GqG8-N7TNkY/s1600/11January%2B012.JPG"], "link": "http://spectrumliving.blogspot.com/2011/01/broken-bones.html", "title": "\nbroken bones\n"},
{"date": "Thursday, January 13, 2011", "body": "\nI got this email from Sam's teacher today:HelloI just wanted to reach out to you and tell you how well Sam has been doing lately.  He recently has shown an interest in two of his peers (_______ and _______).   He will get in their face and smile or he will pull on their shirt.  It's very cute! After he gets a reaction from them, he has a big smile on his face.Have a great day!!This fits with what Sam seems to have been trying with his sister as well.  I also caught him looking over at his babysitter's son the other day and flapping his hands like he was excited.  He saw the son playing with a friend and he looked like this tiny little part of him deep down inside wanted to join in but he had no idea what to do.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/01/note-from-teacher.html", "title": "\nA note from the teacher\n"},
{"date": "Sunday, January 9, 2011", "body": "\nEvery so often it is possible to look at what is going on in our house and not notice anything about Autism. Sam has recently figured out how to play chase with his little sister. Unfortunately the way her asks her is to walk up to her, pinch her and run away but it often does the trick and the two of them circle the house in a chorus of laugher. Sam has also started to realize that he can chase Maya too (much to her delight). He doesn't like the game as much that way but with a little nudge from me, he can sometimes be persuaded. Add dad to the mix and both kids are in total ecstasy. They both get to run away and to be tickled. Maya insists that dad yell \"yar!\" as he chases them (she associates this sound with dinosaurs and pirates). There is very little else they would choose over this game. When they are running and laughing together, you hardly notice Sam isn't really using any clear language. It is all squeals and laughs from everyone involved.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/01/moments-of-normal.html", "title": "\nMoments of Normal\n"},
{"date": "Saturday, January 22, 2011", "body": "\nSam got this cup in his stocking this year.  I decided it was important for him to have a more age appropriate cup to take to school or out in the community.  It is not that I want to \"hide\" his autism, that is pretty much impossible due to the constant stims and noises, I just don't think he should use sippy cups forever.  He CAN drink from a regular cup but he has to be very closely supervised.  He is so stimmy with his hands that the cup often gets knocked over.  Also, he has a bit of an obsession with how he \"releases\" objects.  He doesn't place things down gently, he has to release quickly so that they fall a little - not always good with an open cup.  Sport water bottles are not good because he loves to let those drop as well and they make a bog mess. He gets a kick out of water dripping on the floor or on himself.  This cup has been almost perfect.  It doesn't leak in his bag and it doesn't leak when he \"drops\" it.  He figured out the bite valve with no trouble.  It is age appropriate (I have one myself but it doesn't have the cool pictures on it).  The only issues with it is that, as with everything, Sam had figured out how to stim with it.  He holds the spout/bite valve with his teeth and walks around flapping his arms and making his stimmy noise.  I take the cup aways as soon as he starts that so hopefully we can defeat this behavior before he ruins the spout.  Overall, this big kid cup was a great buy.\n\n", "outgoing_links": ["http://4.bp.blogspot.com/_P3O2yD1xoJ0/TTtGa8knxvI/AAAAAAAAADA/wAv3T-7jaHQ/s1600/11january2%2B002.JPG"], "link": "http://spectrumliving.blogspot.com/2011/01/big-kid-cup.html", "title": "\nBig Kid Cup\n"},
{"date": "Tuesday, February 22, 2011", "body": "\nThe arm is healing although the process feels so slow. I got the stitches out on Tuesday (3 weeks after the surgery). I got a removable cast/brace that allows me to take a real shower. I can move my fingers and bear a TINY bit of weight on the (the weight of a few papers or a kid's plastic plate). I can't do much with the thumb yet. The surgery was just below the thumb so I guess that makes sense. I should be in this cast until the baby comes. At my appointment on tuesday the doctor asked me to come back in three weeks for an x-ray. I asked how flexible he was with that because I was planning to have a baby in 3 weeks. H said call when I deliver because they might be able to do the x-ray while I am in the hospital! That would save a lot of trouble.I had a bit of a scare on Friday because it felt like I was going into labor. I was awake most of the night because of Sam and because I just felt strange. When I went to work I made sure to drink lots of water and I tried to eat but I had no appetite. I began cramping/contracting right as the day began. They were not too intense but strong enough to be uncomfortable. I had three hours of non-stop teaching first thing in the morning and then a 25 minute break. During those 25 minutes I told the main office I needed to leave. I organized work for my afternoon classes and left. I tried calling my doctor but they were \"out to lunch\" for an hour and a half. When I finally got the secretaries, they asked me to come in right away. The doctor checked me and I was only dilated a tiny bit so he din't think it was true labor. He told me to take a hot shower, lie down and drink half a glass of wine. I did n't have the wine because I was afraid I would fall asleep on the spot. By the next morning the cramps had died down and I began to feel normal again. Can you imagine a newborn, a 2 year old, and Sam. . .and me with only one working arm?Sam has had a tough time with my injury. He doesn't understand that he can't grab my arm to lead me somewhere. He has also had to adjust to Dad dressing him after his bath. I am starting to be able to do it again but I don't mind keeping it as my husband's job for a while. Sam continues to have sleep issues despite Clonidine and melatonin ( it worked great for a while but like everything it seems to have stopped having the full effect). When he wakes he is less stimmy than off the meds but it still makes for tough nights.One nice thing that came of this is that I got a lot of kindness from neighbors, friends, and people at work. Some cooked us dinner and others pooled money for a gift card to a local take out restaurant. My mom sent a package of frozen meals. One neighbor took Maya outside to play in the snow with her kids (which was a real treat for her since I can't even do that when I am healthy because Sam won't go). The first couple of days I had NO arm control and I had to get a neighbor to change Maya when she pooped.On hard thing about all this though has been the \"alone\" factor. Mark just couldn't take off from work for financial reasons and I have basically been on my own with the kids (outside of work) six days a week. While it was hard to go out with Maya and Sam before, it is impossible now. I have been able to find ways to do most things one-handed but it is very difficult. If I thought I was tired before, it was nothing compared to now ( try sleeping with a 9-month pregnant belly and a broken arm). The night I had the surgery, we couldn't find anyone who could pick me up. Mark had to drag the kids out of bed at midnight and bring them to come get me. He waited outside the front doors until they wheeled me out. My mother and my sister have both made trips on Saturdays to help out for a few hours (I need help carrying laundry baskets around the house) which has been nice but I have been finding myself envious of people who live near family or who get to stay home with their kids and have the time to get to know other parents in the area.One thing that made me very happy though was that I wasaqble to knit a few rows yesterday. It was slow work but it was a start. Since knitting is my only \"thing\" outside of work and kids, it has been tough not to have that distraction.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/02/arm-is-healing-although-process-feels.html", "title": ""},
{"date": "Thursday, February 24, 2011", "body": "\nSam is finally getting over a monster of a cold.  This is the second time this year he has had one like this - a week of coughing so hard he pukes.  The other night he woke up in a puddle of vomit and then had to sleep with us with lovely smelling hair ( I tried to clean it but he was hysterical!!)  Now Maya and I have the cold but we don't seem to be throwing up (keep your fingers crossed).  So now I need the arm and the cold to get better before I have this baby . . .  .please.I just entered Sam in an ipad contest on this blog:http://marissasbunny.com/5 ipads are being given away so if you have a special needs child you might want to check it out.\n\n", "outgoing_links": ["http://marissasbunny.com/"], "link": "http://spectrumliving.blogspot.com/2011/02/sam-is-finally-getting-over-monster-of.html", "title": ""},
{"date": "Thursday, March 3, 2011", "body": "\nI am very curious to see how Sam will do when this baby arrives.  He reacted badly when Maya came home.  He wasn't aggressive or mean to her, he just acted up a lot.  Now he doesn't like to be without her.  He is so much more behavioral now that I am not sure how much worse he can get (I may regret saying that)!This has been on my mind because Maya and I got the bug Sam had a couple of weeks ago.  We have been coughing and throwing up since Saturday.  Both of us are finally on the mend today.  Maya has needed a lot of extra attention.  I never realized how independent Maya is normally.  She is very cuddly in the morning and the evening and she often hugs me during the day but in between she plays and moves around without needing to be right next to me.  Sam, who moves around the house like the Tazmanian Devil, checks in A LOT.  He will often pull me to a chair or couch and either dive behind me or sit right up next to me for a moment.  He missed out on this while Maya and I were ill.  I noticed that the second Maya wasn't on my lap he tried to climb on himself (and he doesn't fit too well these days) or he tried to sit right near mefor a moment.  He has also been a little more wired this week. The plan is to induce this wednesday when Sam is in school.  That way only his evenings will feel different.  I am curious to hear how Mark handles the night wake ups while I am gone.  Often he doesn't even hear them wake up.  If that happens, it is likely whoever wakes first will wake the other by the time he figures out what is going on. This should be interesting.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/03/jealous-boy.html", "title": "\nJealous Boy\n"},
{"date": "Saturday, February 12, 2011", "body": "\n-Bad weather kills Mark's business-the unsual financial issues-8 (soon to be 9) months pregnant-broken arm that has to heal from surgery-most stressful time at my job (high stakes testing)-Sam has stopped sleeping on a regular basisSo will our ship be lost?On a slightly more positive note, Sam is giving Maya quite a sibling experience lately.  He zeroes in on whatever she is playing with and either syeals it or knocks it over.  Classic bratty brother. Typing one handed stinks.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/02/perfect-storm.html", "title": "\nA Perfect Storm\n"},
{"date": "Monday, March 21, 2011", "body": "\nOn March 9th, I went to the hospital with these. After a very smooth delivery I had Hannah.Sam pretty much ignores her except when he snatches a blanket off of her to throw. Maya likes her but she is emotional about everything else. She gets jealous when I am nursing.Hannah is pretty easy going. She still feeds quite frequently and so she is up every 2-3 hours at night so Mark and I are pretty tired. In truth though, I feel better than before the delivery when I was pregnant, my arm wasn't healing quickly, and I had a major stomach bug that had me throwing up for days. Now I am recovering from delivery and tired but my arm is almost better, I can eat and when I do get a chance to sleep, I am more comfortable. \n\n", "outgoing_links": ["http://1.bp.blogspot.com/-_Ji5eqWNbto/TYdX-DAH85I/AAAAAAAAAD0/9Tq2hPKAYjc/s1600/11March%2B030.JPG"], "link": "http://spectrumliving.blogspot.com/2011/03/baby.html", "title": "\nBaby\n"},
{"date": "Monday, April 4, 2011", "body": "\n This is the doll that Maya got when she became a big sister. This is where you can purchase your own custom doll:http://www.etsy.com/shop/craftymommyDon't worry, we got some big brother stuff for Sam too but it was mostly chewies and I don't have a link for those!\n\n", "outgoing_links": ["http://3.bp.blogspot.com/-snJ-2wUuNOQ/TZoZbVj9WlI/AAAAAAAAAEE/riEcQNCKqyU/s1600/11march2%2B082.JPG", "http://www.etsy.com/shop/craftymommy"], "link": "http://spectrumliving.blogspot.com/2011/04/big-sister-present.html", "title": "\nBig Sister Present\n"},
{"date": "Friday, April 1, 2011", "body": "\nThis post is a downer. I have some happier ones brewing in my head for another day. This post sums up a very lonely feeling: http://severedisabilitykid.blogspot.com/2011/03/to-be-cared-for.html I feel a little guilty comparing how I feel at times to the feelings of someone whose child is so medically fragile. Sam is physically healthy, it is his cognitive and behavioral issues that keep us (mostly me) isolated. The idea of being cared for is very powerful. It isn't that I want someone to wait on me or take care of all my needs- far from it. It is just that disability often take from you those moments of warmth and comfort that you get in those situations. It isn't about getting a massage or a spa day to \"do something for myself\". Those moments may be comforting but the provider is working for a fee. There is no real bond that is being nurtured there. One of my happy memories from before the days of Autism is sunday dinner with my parents before their divorce. Sunday dinner was often roasted chicken, roasted potatoes, peas and salad. In my house we were always expected to be present for dinner (unless there was something big going on). We almost always ate together at the table. We were not always happy with each other but there was something very warm and soothing about that meal - prepared by a mother. I can't go home anymore. A couple of years ago my parents seemed to change and then they divorced. Neither one has a house that is \"Sam proof\" so we can't visit. My roommate in college tried to re-create this for me one weekend. I had gone home to visit my parents for the weekend but I had to catch a train back to NYC before dinner on Sunday. I told her over the phone how sad I was to miss dinner and when I got back she had cooked the full meal! We sat together and ate dinner. Imagine that - that feeling of being cared for. To enjoy something quietly, warmly. Or imagine going over to a friend's house one day, turning the kids loose with a toy box and sitting down to catch up over coffee or tea stopping only to aid in the occassional kid dispute. Not wondering if your five year old is drinking the toilet water or eating the house plants. It would also be nice to provide more of these moments to friends and family. To be able to concentrate on her and be in the moment with her. I love being a mother. I even love being Sam's mother (though it may not always sound like it). I adore him even when I don't like the things he does (his most recent addition to his stims is spitting - really really gross). I enjoy the role of caretaker but I miss the moments that nurture other relationships. I don't know if this post clearly communicated what Claire's post made me think about. I hope it makes a little sense. And I agree that the shower is a great place to let it out. Let any tears go down the drain because letting them linger doesn't help anyone.\n\n", "outgoing_links": ["http://severedisabilitykid.blogspot.com/2011/03/to-be-cared-for.html"], "link": "http://spectrumliving.blogspot.com/2011/04/she-said-it-best.html", "title": "\nShe said it best. . .\n"},
{"date": "Monday, April 4, 2011", "body": "\nOne thing I work really hard to do with Sam is to avoid holding a grudge. Think about it - when we have fights or tough times with other adults, those incidents hang over us the next time we interact. We may respond with anger or sarcasm because the previous interaction is still in our minds. I can't do this with Sam. He is not thinking about the fact that five minutes ago he spit in my face when he comes and asks for a cookie for the hundredth time or when he throws a bunch of blocks. With Sam I think it is important to approach him with the right attitude each time. I try try try to keep my tone positive at the start of each interaction. Sam (like many typical kids) feeds off of negative attention. There is something about the adrenaline rush that often fuels him to repeat the things he is scolded for. So every morning and at every new interaction I try to remember to be glad to see him and to act as if he is going to be appropriate.I think that this is an important thing to do even with typical kids. Children are so much in the moment that to cloud our resposnes to them with previous negative feelings will just confuse them. I am not always successful with this but I try.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/04/starting-fresh.html", "title": "\nStarting Fresh\n"},
{"date": "Saturday, April 23, 2011", "body": "\nThe other night, right after I brushed Sam's teeth, Sam leaned over and let go a glob of spit onto my slipper. THen he gave a little jump, flapped his hands, and said, \"bad, bad, bad!\" (which from Sam sounds like \"ba, ba, ba\"). Naughty boy.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/04/bad-bad-bad.html", "title": "\nBad Bad Bad\n"},
{"date": "Thursday, April 21, 2011", "body": "\nSo my quest to find a church in order to feel commected to a community has been a big failure. The churches I have visited or contacted have all been very nice. The one I attended - a very small UCC church - was so welcoming I feel bad not going. The pastor is great and I still get his newletters by email. The problem is that no matter how badly they WANT to be a great place for a child like Sam, they just can't without disrupting the experience for everyone else. In most churches I have been to kids sit for part of the service then go to class or chapel. Sam can't do that. He can't participate in a class in real way. I could go to church on my own and I may from time to time but the community aspect just isnb't working. I can't join committees, go to choir practice, or help with the rummage sale. I just don't have the ability to work full time, take care of three children and manage Sam's issues AND do those things - especially with Mark working most Saturdays.BUT I found a great community. Sam takes a special needs dance class at a nearby dance school. The other moms/grandmothers are a great bunch. There is one boy who is much like Sam, a little girl who is nonverbal and somewhat delayed, twins with Down's SYndrome, and a girl who is autistic/multiply disabled. There are other kids who come and go but the parents of this bunch are there on a regular basis and I really look forward to the hour I sit on the floor and chat with them. Sam has been a little off the class lately but I am pushing him to keep going mostly for my own sake!! The only time I feel on the outside is when they start talking about vacations and special needs camps. I am the only one in the group who has to work full time and even with 2 incomes we don't make enough to take trips or send Sam to daycamp in AUgust. These other moms take trips and some even hire therapists to go with them so they get a break. whoa. I did get a lead on a reasonably priced special needs camp for AUgust but so far they haven't gotten back to me.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/04/finding-community.html", "title": "\nFinding Community\n"},
{"date": "Monday, April 11, 2011", "body": "\nBlogger won't let me write in paragraphs. Sam's most recent addition to his constant stim routine is spitting. He pools his saliva in his mouth then sticks out his tongue and lets it drop. Sometimes he then rubs the puddle with his foot and other times he lets it stay. He used to do this every so often but it wasn't enough to get worked up over. A couple of months ago his spitting began to increase in frequency. Now it is almost constant. He has also started blowing raspberries in my face when he leans in close. Lovely. The spitting bothers me but it bothers my husband even more. I don't think Sam knows what I mean when I say \"no spit\". Either that or it is so far beyond his control that he can't resist. Yelling about it is useless. His school has him on a behavior plan for it and they are seeing a reduction. I haven't seen any reduction at home. I have asked for suggestions for a home behavior plan but I am having even less luck getting home program support than before. Grrr.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/04/spitting.html", "title": "\nSpitting\n"},
{"date": "Tuesday, April 26, 2011", "body": "\nToday Sam turned 6. I still remember the insane strength of the bond I felt as soon as he was born. I think I actually felt physical pain when he was away from me. He was a mama'a boy through and through. Today Sam woke up at 6. He was snuggly and sweet for a few minutes and so I told him it was his birthday even though he didn't understand. Then he started grabbing the books off the bookshelves and throwing them (his new obsession). Mark tried very hard not to yell and just made Sam clean up every few minutes. The cleaning up has no effect on the behavior but we do it anyway. Then Sam went to school without the cupcakes I wanted to send. I realized when we got home from his dance class that I didn't have enough eggs and I was too tired to go out so late. I am hoping to send them later this week. I couldn't bring them later in the day because it was my first day back at work since the baby came.Sam got dropped off at the sitter's house and I picked him up at 3:30 with ice cream cake in the car. He seemed excited about that idea. He decided to start pinching Maya on the car ride home. I hope this is not his new obsession because I have no way to separate them and she doesn't deserve to be hurt every time we go out in the car.Sam spent the rest of the afternoon throwing books and trying to play in the toilet. I spent the rest of the afternoon trying not to lose my temper and nursing the baby who didn't want to drink bottles while I was at work. I wish for his birthday that I could transform into a better mom, someone who knows what to do about these dangerous behaviors and how to give us all a happier life. SO I am sorry, Sam. I hope that todays feels a little different for you in a good way so that even if you don't know it is your birthday, you know that you feel happy (even if it is just happy about ice cream cake).\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/04/6.html", "title": "\n6\n"},
{"date": "Monday, May 9, 2011", "body": "\nLike many children with Autism, Sam hates to have his haircut. It puts him on sensory overload. His school has done something brilliant (which is nice because on a few other issues I have a list of complaints). One of their former employees (I think she was a classroom aide) work in a hair salon. She comes to the school twice a month. Parents, for a small fee, can sign up for as many haircuts as they want their child to get. The children then get their haircut in school with their teachers and aides on hand. The new photo of Sam is with his hair freshly cut. One less thing to try to do around the house!\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/05/haircuts.html", "title": "\nHaircuts\n"},
{"date": "Saturday, June 4, 2011", "body": "\nUps-We are having some success with medication (do I still need to give the usual speech about how I never imagined putting my child on meds like this. . .?). He takes a few but the one that has helped is Strattera. The neurologist said that it only seems to help about 50% of her patients who try it. It helps Sam mellow out a bit. Before Strattera he was so overstimulated and uncomfortable in his own skin then he was jumping up and down constantly, flapping wildly, vocalizing in a high pitched scream and running back and forth like a wild man. His behaviors are still difficult but the absolute frantic mode in which he used to operate has been brought down a notch. He is also sleeping better. Most of the time if he wakes up, I can take him to the bathroom and then put him back to bed. He still has 4 am mornings sometimes though.-Sam will likely get a significant increase in his home support hours from the district at his next IEP meeting. I sent in a couple of carefully worded letters and documented, through notes and videos, Sam's dangerous behaviors.-the baby is smiling and \"chatting\" with me every chance she gets.downs-Sam continues to obsessively destroy our books. He empties the shelves multple times a day and throws the books around the house. He has no alternate interests so diverting him is impossible. He sometimes take a break from throwing the books to chew them. The behaviorists are getting on my nerves because they keep offering suggestions that don't work. They say make him pick them up. We have been dealing with throwing for years and we have tried that. It doesn't work. It has NO effect on whether he will throw again. In the classroom they have determined that making him \"pick up\" doesn't work so why do the same group of people keep telling me to do that at home?-Sam has done a few things lately that have hurt Maya. He has knocked her off a chair, pinched her arm until he left a mark, yanked her arms really hard and made her cry- to list a few. His concept of \"other\" is limited so he doesn't understand he might hurt her.- I am feeling the effects of fatigue from the past few months. I cannot remember that last time I had more than 3-4 hours of sleep. It was hard to sleep during the 3rd trimester but with the addtion of the broken arm it became nearly impossible. Now the arm is getting better but I have a nursing baby who does not sleep through the night. Often both of the older children need to go to the bathroom during the night and they both need help. I went back to work when the baby was just about 7weeks old. It is too much. I feel stupid saying that considering what is going on in the world but I am just barely functioning. The combination of nursing all night, getting up at 5:15 to get all the lunches ready, get dressed, nurse again and get the girls out the door by 7, then teaching ( and trying not to leak milk in front of the students and trying to find time to pump), then coming home to manage Sam and various therapies and the house and to worry over Mark's massive financial issues that never seem to improve - too much. I am forgetting things, dropping things and by the time I put the kids to bed my vision is blurry. I am hoping that summer break brings some relief.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/06/ups-and-downs.html", "title": "\nups and downs\n"},
{"date": "Sunday, June 5, 2011", "body": "\n\n\n\n\n\nThis is Sam stimming with books (the voice in the video is Maya who is a bit jealous because she wants to make a video too). He does this most of his waking hours when he is in the house. When he is out of the house he does the same action but with other objects. The resulting mess is maddening. The sound of books hitting the floor still makes me cringe. We make him \"clean up\" but it has no effect on the behavior. \n\n", "outgoing_links": ["rtsp://v2.cache3.googlevideo.com/ChoLENy73wIaEQldR8Pi3htKKBMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://spectrumliving.blogspot.com/2011/06/sam-stimming.html", "title": "\nSam Stimming\n"},
{"date": "Sunday, June 5, 2011", "body": "\nI have been flirting with the idea of putting Sam back on a gluten free diet. We are pretty confident Dairy free did nothing for him last time around. He doesn't like milk and only eat sheese and yogurt anyway. I think I am thinking about it because one of the books I have had to rescue from Sam is Special Diets for Special Kids. I didn't find it to helpful the first time we did \"the diet\" because Sam couldn't have eggs and many of the recipes called for eggs. He has been cleared by the allergist to eat eggs now so I might get more use out of it. I re-read her story at the beginning of the book and it sounds so similar to ours. I bought a bunch of gluten free products at the store today and when I checked out and realized the cost I had second thoughts . . .THose of you out there who are GF, what do you do for lunch? Sam has to bring lunch to school and I haven't found (or made) a decent GF bread. GF pasta doesn't re-heat well. I am at a loss (I have already read the TACA site).I don't know if we are going to head down this read again or not but I am going to at least start introducing more GF foods into his diet this week to see what he tolerates. Anyone out there with a success story?\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/06/diet-romance.html", "title": "\nDiet Romance\n"},
{"date": "Friday, July 1, 2011", "body": "\nIf we could just bottle whatever it is that swings do to Sam's brain I think he would be ok. When he is pushed on a swing his body is calm, his eyes look around at a normal pace, and he smiles in a relaxed and happy manner. He stops stimming completely. Unfortunately, the effects do not last a second past the time he gets off the swing but it is sweet in the moment.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/07/swings.html", "title": "\nSwings\n"},
{"date": "Saturday, June 25, 2011", "body": "\nYesterday afternoon, while I was helping Maya figure out a new game, Sam stole the carton of milk from the fridge and threw it around the living room. The rug was saturated and the piano had a big puddle on top.As I cleaned up after dinner, Sam grabbed the salad spinner out of the sink and threw the leftover salad all over kitchen.That was day one of the countdown until ESY begins for Sam. Come on, July 5th. .On the positive side, neighbors have been calling me from various stores to see if I need anything. It is an amazingly helpful thing. Yesterday, a friend from work picked up bread and dish soap and this morning a neighbor brought over bagels. Since, when Mark is at work (6 days a week), I am homebound with the kiddos, I can't run out to get little thing like that when we need them.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/06/milk-and-nice-people.html", "title": "\nMilk and Nice People\n"},
{"date": "Friday, June 24, 2011", "body": "\nI am about to express my annoyance over new therapists. Please note thought at these therapists are lovely, dedicated, well-trained and well-intentioned women. I am just generally pissed off.We are incorporating some new therpaists into Sam's home program. Why? Because I am Master of the IEP (yes, I have given myself an official title)Sam will get 8 hours a week of home therapy continous throughout the year (no breaks in the summer). This is in addition to his school and extended school year program. Will it make any difference? I hope so but I doubt it. How did I get this many hours? I carefully wrote letters detailing the specific actions Sam engages in that create danger for himself and others. I also pointed out, in writing, that I was keeping anecdotal records of his behavior and making video tapes of Sam in our home. I also mentioned that I was considering private placements for Sam for which I expected the district to pony-up (considering all the documentation I have of his lack of skills developments and so on. . appropriate education environment. . )The frustrating part about adding new people is that each person askes the same questions about Sam's behaviors. (what is you give him something appropriate to throw? so you make him clean up? have you tired an activity schedule? and on and on). Yes yes and #$@^#*& yes. We have been working at this home program for nearly three years with trained professionals and YES we have tried it. It doesn't work. Nothing works. He is stimming 90% of the time. He will not substitute something appropriate because part of the appeal is the loud thud and the way things break when they hit the floor. Making him \"pick up\" did not work in the classroom so why do they all think it will help at home? We make him do it because children should clean up after themselves but it has no effect on whether he will cover the floor with books a minute later. He will only follow an activity schedule if someone stands over him and enforces it. even then his limit is about 2 activities. He is capable of doing a puzzle or stringing beads but those activities hold no value for him so he will not do them unless forced. We do them anyway but after three years and no change in his interest or ability it seems like a waste. So, while I am very happy to have these extra hours because maybe, just maybe they might help and they give me psychological and physical break (and those of you who know me know I am getting ready to add the psych hospital to my speed dial - for me or for Sam - who cares?), I am not convinced they will do much. The only suggestions a whole team including behaviorists, teachers and aides has given me are to make him clean up every 10-15 minutes and put him in his room (which is almost a \"safe room\" at this point since I had to remove almost everything from it). I made them promise out loud that they wouldn't call child services on me for shutting him in his room. A number of people have asked why I don't just take the books away. After losing quite a few books I DID remove some books and box them up. I don't have anywhere to store those boxes right now so they are in the living room looking lovely. I also have another set of shelves in another room he hasn't gone after yet (although he is checking them out from time to time)and I moved some item there. The problem is, if I take the books away he will move on to the next thing. He is throwing the books because I took away the last thing he obsessively threw (blocks). Giving the blocks back, unfortunately did not reverse the habit. I know what he is considering for his next obsession: the picture frames. I could remove those too but then what? This is a compulsion that can't be blocked with the basic behavioral tools and I can't turn the house into a psych hospital. The girls deserve to be able to play. The big problem is that Sam has no other interests and no amount of ABA has been able to develop one in him.The additional therapists are wonderful as I said before but I am already seeing looks of \"holy crap\" on their faces. They have reported back to their supervisor that Sam is one of the toughest cases they have seen. And while the validation that I am not crazy or doing something amazingly wrong is nice, it doesn't make me think that thing will improve any time soon. On the plus side, due to generous support from family members who are hoping to keep me out of the psych hospital, Sam is probably going to day camp for two weeks in August.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/06/new-therapists.html", "title": "\nNew Therapist(s)\n"},
{"date": "Sunday, July 10, 2011", "body": "\nI was working on a post about this but I think it has all been said here:http://www.lovethatmax.com/2011/07/mystery-of-missing-ipadsand-unrest-in.htmlread the comments tooYes, we were one of the \"winners\". Unlike some of the parents though I never counted on it. There was a part of me that hoped something that good could really happen but the realist (cynic) in me was pretty sure it wouldn't materialize. There were too many things that didn't add up, too many \"perfect\" promises. I figured that an entry was relatively safe since he didn't ask for any financial info. As they say, there is no such thing as a free lunch. Maybe in a few weeks we will all be surprised . . . what are the chances?\n\n", "outgoing_links": ["http://www.lovethatmax.com/2011/07/mystery-of-missing-ipadsand-unrest-in.html"], "link": "http://spectrumliving.blogspot.com/2011/07/unrest-in-blogland.html", "title": "\nunrest in blogland\n"},
{"date": "Tuesday, July 12, 2011", "body": "\nMany parents of special needs children have turned to the internet to find community. For some of us it is the only way to connect with other parents in similar situations. Our lives have been forever changed by Autism, Cerebral Palsy, Down's syndrome, Fragile X, childhood strokes, . . .the list could go on. Most of us can't just take a few hours to attend a support group so blog communication becomes our support. The appeal of meeting people who \"get it\" is huge. Unfortunately that need can cause people to let their guard down. When I work on research skills with my students, I stress the point that anyone can write anything on the internet. I can start a blog and call myself a Ralph Waldo Emerson scholar. I can write that his favorite food was peanut butter and that he played hopskotch as he formulated his transcendentalist philosophy. If you inculde that in your research paper you have made a great error. My hypothetical blog is not a peer reviewed edited publication. In the same way, someone can start a \"special needs\" blog and not actually be a person with any connection to the special needs community. Or, the person may have a family member with special needs but use the blog to pull on readers' heartstrings to get donations.Why would someone do this? Well, why would someone steal savings from elderly people? Why would someone molest a child? Because some people suck. There are people out there whose brains lack a moral compass. There are also people out there who are complete narcissists. They need an audience, they believe their story ought to be on everyone's mind and they will do anything to make people sing their praises. SOme people are pathological liars. For example, I met a girl in college who faked 2 pregnancies (I am not kidding, it was intense).On the internet you have to be as careful as you would be while walking around a strange city or strolling anywhere at night. You cannot assume that because someone claims something in a blog, it is true. You have to fact check and get to know the person before investing anything like money or personal information with that person. Your radar has to be on.Recently a number of special needs parents were scammed. I was one of them. My previous post has a link to another blog. The comments page has words from many of the parents and from the man(?) himself.I first heard about the ipad giveaway on another blog. I won't mention which because it doesn't matter. The entry was simple (if you don't frequent a lot of blogs, this is pretty standard). Just leave a comment or send an email. No information besides name/blog necessary and no money sent. I have done this before and on one blog, I won a beartiful handmade doll for Maya (with that entry I had legitimate reasons to trust the blogger because I first read her blog through a real, established agency). The contest blog is a blog about infantile spasms. The Dad writes about his experiences with his severely disabled daughter. Supposedly he has started a foundation for fundraising and awareness. He also raises money for her surgery (that is a whole other discussion).I entered Sam. At this point I figured, no harm in entering but we probably won't win.We made it through the first round. The second round simple involved having your therapist or doctor send a note confirming that your child has the disorder you claim and that your child could in fact benefit from an ipad. I am lucky enough to have a therapist (through Sam's IEP) that come to my house so she sent an email to the blogger. Again, we were not asked for money or anything that wasn't already stated on my own blog so I wasn't too suspicious. I still figured it was a long shot and I didn't count on it.Soon we heard that all forty of the finalists had been selected because this man's \"bosses\", who love to help him fundraise but want to be anonymous, could not make up their minds. We were all getting ipads plus credit for apps. At that point my scam radar went up. These are hot items. Individuals can only buy limited numbers. Maybe cooporations have different buying options but the contest was not through his company. Plus credit for apps? If they have all this money why not just pay for the kid's care? I KNOW Apple didn't donate all this stuff to him. That would be all over the news.I also noted that there was no non-profit number for his \"foundation\". As I said before, I can call my blog the Ralph Waldo Emerson Foundation. That doesn't make me legit.Again, I didn't worry because I wasn't asked for money. I figured if it was a scam, so what?We \"winners\" were stalled again and again while he waited for \"legal paperwork\" from his \"lawyers\". We got regular emails \"updating\" us on the progress of this endeavor as well as detailing his daughter's care and condition. All this took months.Then the ipads shipped. Oh wait, only 7 of them made it. Oh wait maybe 20 of them made it. But no one who did the shipping used a checklist so the man had no idea whose had gone out. At this point I was 100% sure this was a scam. No person I can imagine would ship such valuable items in such a manner. He emailed us that it wasn't his fault because HE didn't handle the shipping - some people at his company far away did it. He was going to make it right for us.I know many parents were suspicious at this point. Some of us began to contact each other quietly. I still figured it was probably not for real but what is the harm in just waiting to see?The we got an email from the man saying he was getting \"threats\". He sent us a copy of the email.This is his email which includes the \"threat\". I blacked out the man's (contest man) name for now. Otherwise this is the complete email:I just got a very disturbing email from somebody anonymous on the internet. I've included it in it's entirety... I apologize for the language in it in advance.----------Hi Mr. _______,I know who you are, and I know what you're doing with regard to the iPad scam, and all the other scams in which you've participated. I have all of your contact information, employment information, as well as your criminal history. I have archived your entire blog. I have a file that is ready to be sent both to the Fairfax County DA and police department, to Apple, and to every single parent who thinks they will be receiving an iPad from you.Here is what you need to do if you want me to drop this issue without reporting you. I want you toa) announce on your blog that no one will be receiving an iPad. I don't care what story you make up as to why this has happened, just announce it.b) refund all the donations.c) stop accepting money.d) get the fuck off the internet, you crazy, disgusting bastard.You have one hour from now to make the announcement on your blog (NOT in private emails) or the file will be sent to all concerned parties.Looking forward to your update,MePS I have spoken with Apple's legal department, and they have no idea who you are.----------I don't know who sent this. I don't know what their motivation is. I'm just letting you know. I'm trying to engage whoever this is in a dialog to see why they'd want this.If anybody wants the email directly forwarded, then I'll be happy to send it.-_____At this point we were told all shipping was on hold while police looked into this. Protecting his family was his primary concern. There were no threats to his family in that email. It was just another reason not to verify shipping. It all came to a head this weekend. One blogger brought up what many of us were thinking and as you can see in the link I listed in my previous post. The person (actually 2 people who sent the \"threats\" have revealed themselves and explained their actions here:https://sites.google.com/site/bustedyourbunny/After many demands to prove that the ipads existed, the contest man gave in and admitted there were no ipads. He still tried to come out looking good. This is what he said:There are no longer any iPads. I've never had access to the matching funds I've been promised. Something along the way changed and I'm getting hung out to dry by my bosses. As to my obliqueness about my bosses and the company I work for, If their identities ever got out, long ago they promised I'd lose my job, my insurance, and take us for everything we have making Marissa's surgery impossible to afford. If I keep my mouth shut and the fact that I got screwed never gets out in any way then I keep my job, and my insurance, and they've promised to pay for Marissa's surgery after we give everything we can. My reputation is now screwed with the SN community but I have to be able to give Marissa the best chance for as close to normal as possible and will happily work under whatever conditions I need to. I'll dance with the Devil if it gets Marissa what she needs. We're not going to fundraise any more. There won't be any more giveaways on Marissasbunny for special needs or otherwise. I'm still going to update with Marissa's surgical preps and that kind of thing, but that's all. Marissasbunny is going back to what it was before they got involved, back when many of you started reading. No more promotions, just Marissa and her brother's story. There are the first words that are my own and not through a corporate lawyer since Thursday. Regretfully,-_____I suspect this is just another ploy for sympathy. If this man cared about his reputation in the SN community, he would not have put the dreams of so many on the line. I would not be surprised to find out this guy is using another name and site to fundraise in the next few years.So what did he do that was so bad besides disappoint a bunch of struggling parents? I have said again and again that he didn't ask us for money. So what did people lose besides a little hope and faith? This man used the ipad givaway as a way to promote his fund for his foundation/his daughter's surgery. Some parents were so taken by his generosity that they gave to his fund. Other people who knew parents who were promised ipads gave money out of gratitude. Some people with no direct connection gave money because they thought he was a do-gooder. Also, some who didn't \"win\" in this round were encouraged to enter the next round which was a raffle. It required a small entry fee because according to him he was hit hard by legal fees for tje first givaway.I had a lot of doubts throughout this process but in the bustle of everyday life with 3 kids and special needs, I didn't put a lot of thought into it. I wish I had really thought about what was going on and asked some questions sooner. Maybe if more of us had done that, people wouldn't have lost their money in the fundraising. I think we all owe SN Avenger a thank you for bringing this out into the open. Hopeful families would probably waited weeks more before calling this guy to the mat.So bloggers and readers beware. If it seem too good to be true it probably is. If a group claims to be a foundation, there ought too be contact information and in most cases a non-profit number. If there is fundraising connected to the givaway, procede with caution. Some are legit but make sure you are are clear on where the money is going. If you win something that is worth more than a certain amount, there is paperwork you have to compelte for tax purposes.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/07/many-parents-of-special-needs-children.html", "title": "\nBloggers Beware\n"},
{"date": "Monday, July 4, 2011", "body": "\nIn my self-absorbed state a couple of weeks ago, I was only worried about how I was going to get through the break between school and ESY. I can usually keep my temper in check and my sadness at bay for most of the day but by late afternoon I am at the end of my rope. listening to my books hit the floor, break apart and then get torn to shreds wears on me. Getiing spit on all day isn't fun either. In addition, at over four feet tall (and only 6 years old!!) Sam can reach most of the drawers and cabinets in the kitchen. He has smashed a number of things on the floor (luckily all plastic containers). I was not thinking about how all this would affect Maya. I have always assumed that until she starts school and has playdates, she won't really think to much about Sam's behavior - it will just be \"Sam\". I was wrong. She has had a tough week and I have seen her frustration grow. We have basically been housebound since Sam is very destructive in stores. With his impulse to push I am uncomfortable taking him to playgrounds where he might knock someone off the jungle gym. Some of her outbursts mimic mine and I am going to have to be better about yelling when I reach my limit, but some are clearly her anger at not being able to play normally without being spit on or having her toys snatched and thrown/broken. Her plastic toy bins have been smashed, her crayons have been chewed up and/or thrown, her books had to be locked away upstairs for bedtime only. WHen she tries to practive ballet in the living room she has to duck flying books and gobs of spit. I can't take her on playdates (not that we have friends nearby to go see) with Sam home so she is as isolated as I am.I know when Sam is in school I will be playing catch up on work and cleaning I can't do when he is around. I decided last week that she needs something for herself. We got some respite funding to help pay for two weeks of day camp for Sam in August. We still have to contribute but the funding makes it easier and it allowed me to get a cheap program for Maya. The preschool she will attend this fall has a 3-day a week day camp in July. I didn't sign her up previously because I thought she was a bit young and I didn't think we could pay for it. I contacted them and explained the situation. They said they had a spot free for next week and for two weeks from now. they are book the week in between. I sent a check right away. It was way past the deadline but they were fine with it (I assume it is better for them to have all spots filled anyway). SO Maya is starting camp tomorrow and she is beyond excited. SHe will get to do arts and crafts and play with kids her own age. I think she will do brilliantly.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/07/siblings.html", "title": "\nSiblings\n"},
{"date": "Thursday, July 21, 2011", "body": "\nI have had a number of quiet panics over the past few months about what I would do with Sam in a real emergency. I started to worry about it when I broke my arm and had surgery this winter. Taking care of the kids on my own while pregnant with a broken arm was. . .interesting. The massive snow storms were dangerous. Now we are in a heat wave. I am thinking about that huge blackout years back. . . What if we lost power and had to go to a cooling center or a shelter? What would I do with Sam? He does not have major medical needs but his behavioral issues would cause a disaster. He can't sit still for more than a few seconds. He would run and jump all over other people's stuff. He would grab their water bottles and tip them upside down. He would throw things everywhere and spit on people. We have no way to control him despite hours of consultation with behaviorists and therapists. He does not have the receptive language skills to understand why we need him to stop. He is ruled by hyperactivity and compulsion. Even holding him by the hand doesn't bring him down when he gets worked up. So what would we do? Get in the car and drive until the power is back on? Drive to a state with power and find a cheap motel room and hope not to catch anything gross (I have a thing about hotels/motels)? I have no idea. This needs some thought.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/07/emergency-plans.html", "title": "\nEmergency Plans\n"},
{"date": "Wednesday, July 13, 2011", "body": "\nThat green and tan thing is Sam's knee and his hand is right above it. He is chilling out for a bit since he got up long before the crack of dawn.Sam has a thing for pillows. As soon as he started sleeping in a bed, he started putting pillow on his face as he went to sleep. It freaked me out and I used to move them as soon as he was out. He would just put them back as soon as he noticed. He also love the couch cushions and as soon as he was able he made a habit of knocking them off the couch and onto the floor.At about age 4 he started dragging his bed pillows around the house and sitting with them downstairs. Becuase they tended to get dirty we designated two pillows as Sam's downstairs pillows. They stay downstairs and if the pillow cases get food, drink or other mess on them we don't care. When Sam sits at the table he often suqeezes a pillow between his lap and the table.On the rare occasions when Sam is not moving and aggitated it is usually because he has sqeezed himself into a den of pillows (think Temple Grandin's squeeze machine).Sometimes he gets obsessive about pillows. Every so often he wakes up feeling funky and upset. Those days he will wait at he gait making grumpy noises and holding all his bed pillows as well as his down comforter. If you try to make him leave those things in his room it will result in a full blown meltdown.For a long time Sam would not sleep with any covers, even in the middle of winter. I put them on his bed anyway but he wouldn't use them. This past winter he realized that his down comforter is like a pillow. Now, even in the middle of summer he piles the whole thing in a jumbled mass on top of himself when he goes to bed.\n\n", "outgoing_links": ["http://3.bp.blogspot.com/-tdN9QFS0isA/Th3aWCenK2I/AAAAAAAAAF4/NtapShhxjvs/s1600/11june4%2B017.JPG"], "link": "http://spectrumliving.blogspot.com/2011/07/pillows.html", "title": "\nPillows\n"},
{"date": "Thursday, August 11, 2011", "body": "\n\rSam has trouble pulling his pants up properly after using the toilet. He sits to pee and often his pants and underwear go too far down for him to get back up on his own. Sam's solution is usually to just step out of them and be naked from the waist down. After dinner yesterday I heard him go pee. Then I saw him prance out of the bathroom without any shorts. It had been a looooong day so I shrugged and said \"whatever\". Less than a minute later I walked into the living room to see this:\r\rJust hanging out on the couch in his birthday suit. Very pleased with himself.\r\r\r\rSam goes through periods of obsession with different things. Thankfully his book (and by book I mean destroying books) obsession is lessening (at home at least). He has gone back to obsessively stacking and dropping/throwing blocks. It appears that there is no pattern or meaning to what he is doing but every so often the stacks look like this:\r\r\r\r\r\r\r\r\rInteresting.\r\r\r\r\r\r\n\n", "outgoing_links": ["http://2.bp.blogspot.com/-XkBdUZjutDE/TkQeb5Rg1SI/AAAAAAAAAG8/-HNL02UE8Dk/s1600/11august2%2B012.JPG", "http://1.bp.blogspot.com/-x1CtMoE6ZWw/TkQeQtR0euI/AAAAAAAAAG0/-Kyar_CLkOA/s1600/11august%2B007.JPG", "http://3.bp.blogspot.com/-DngvimUkLBw/TkQeExOJL7I/AAAAAAAAAGs/o-osI8BMvCY/s1600/11august2%2B001.JPG"], "link": "http://spectrumliving.blogspot.com/2011/08/funny.html", "title": "\nFunny\n"},
{"date": "Thursday, July 28, 2011", "body": "\nI like to work on projects to maintain my sanity. It is something I do \"for myself\" even though the projects are often for the kids. I have been avidly knitting and crocheting for well over a year now. I recently took up sewing again. Knitting, as long as the pattern is simple, is something I can work on while I hang out with the kids. I use circular needles and follow them around. Sewing is a little harder. I doubt I will get into anything too complicated. I leave a half hour or so per night after the kids go to bed and pin or cut or sew. Yes, this is sometimes at the expense of chores. Oh well. Baby shoes for Hannah:Maya's hooded sweater:Elephants:\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/07/maintaining-sanity.html", "title": "\nMaintaining Sanity\n"},
{"date": "Monday, August 15, 2011", "body": "\nGood work is being done over here:\rwww.missionipossible.blogspot.com\r\rTake a look at all the wonderful kids who have their ipads now. Sam is on the list (#19). \r\rIf you know any philanthropists, send them over as well : )\r\r\r\n\n", "outgoing_links": ["http://www.missionipossible.blogspot.com/"], "link": "http://spectrumliving.blogspot.com/2011/08/good-work.html", "title": "\nGood Work\n"},
{"date": "Sunday, October 2, 2011", "body": "\nI started this post at 4 this morning after yet another sleepless night. For some reason, the magic cocktail that had Sam sleeping for the majority of the night stopped working a couple of days ago. But that is the subject of another post.When I saw that Sam was number 19 on a list of 20 at the Mission Ipossible site, I really thought it would be a year or more before enough funds were raised to purchase his ipad. What has happened over the past few months has been amazing to watch.I got an email from Ken, one of the people in charge of Mission Ipossible, earlier in the week letting me know that Sam's ipad was on the way. Since I am a teacher, I was home for the Jewish New Year and I was able to watch for the mail. Friday at 11, this box was on my front step. My mailman was a little lax with the signature required issue (although to be be fair he could probably hear the dog going nuts and me yelling at her so he knew I was home).Is that the most neatly wrapped box you have ever seen?I started to open it up while Sam was with one of his home therapists. I had to move from place to place as I opened because I knew Maya would go bananas when she realized what was inside. To my surprise, as I pulled apart the layers of bubble wrap, I found a bag of little toys and this little guy. That's a Dream Date Gonzo in case you can't tell (What are you trying to say, Ken? ).Then I pulled out this:Seriously, the wrapping job was amazing. Neat tape, perfect corners, no wrinkles. I distracted Sam when therapy was over by leaving the shipping box out. This is Sam balancing it on the edge of the table. He is gearing up to watch it drop again and again and again and again. . . . . I left the bubble wrap on the floor to see how long it would take the kids to discover it. 30 seconds.WHile they popped bubbles I took a look at this. I didn't try to get Sam to unwrap it. He CAN rip paper but he doesn't understand the meaning of a present and won't attend to the task.Over the course of the afternoon I set up the ipad with simple apps. One of Sam's home therapists has her own and so I already knew a few things that were worth getting. Maya ended up being the first to play with it because there was a crazy 3 kids yelling at me all at once moment and it gave her something to do for a while.Sam didn't really \"get\" it when I showed him that we have our own ipad now. I felt a tiny twinge of jealousy each time I read an \"i\" post detailing a kid's enthusiasm over the new device. For us this is going to be a way to try to focus his attention and, hopefully, communicate. I would LOVE it if Sam could develop some recreation skills but I think it is unlikely. WHen I sit him down, Sam can do simple shape puzzles and discrete trial programs. We are working up to investing in the big guns - Proloquo2go. What is amazing is that the kid who had to be taught to point with his pointer finger in early intervention understood the concept of the touch screen right away. Is this an instant game changer for Sam? No. But I see a lot of possibilities (Ipossibilities? Too corny?) The ipad is an amazing teaching tool that will allow us to work where ever we are without lugging tons of supplies. Hopefully, once we get speech software and Sam is able to hear the ipad speak for him he will find that motivating and appreciate it even more. I am trying not to drip my wet hair on the ipad.Here is Sam doing a shape puzzle ( no pieces to throw or eat!!!):Here he is doing a discrete trial program for color identification (bonus-no flashcards for Sam to fold and chew):My deep heartfelt thanks to the people at Mission Ipossible and the community of donors without whom this gift would not have been posisble.\n\n", "outgoing_links": ["http://1.bp.blogspot.com/-V-ZBUaNr324/Togxkn3YcnI/AAAAAAAAAJE/twbHqKaRKfU/s1600/11september%2B026.JPG", "http://3.bp.blogspot.com/-lw9OjGIsXe8/TogxXxuh4WI/AAAAAAAAAI8/KJuSaMOvOeY/s1600/11september%2B029.JPG", "http://2.bp.blogspot.com/-53J9NOpzKX4/TogxOvntOhI/AAAAAAAAAI0/ssmOwJI-kEM/s1600/11september%2B030.JPG", "http://1.bp.blogspot.com/-oJ_l8vXS3Dk/Togw7zfzYXI/AAAAAAAAAIs/9I8Ba-QKk_4/s1600/11september%2B035.JPG", "http://4.bp.blogspot.com/-DlwCpxggvRI/TogwmrY3SfI/AAAAAAAAAIk/SQzRlbEk9QQ/s1600/11september%2B036.JPG", "http://1.bp.blogspot.com/-oCUX_ETwROA/Togwabm5l8I/AAAAAAAAAIc/t22zvk8vuDA/s1600/11september%2B037.JPG", "http://1.bp.blogspot.com/-GgDDi5pgB5k/Togv9RH1FYI/AAAAAAAAAIU/8c31wv9ANCI/s1600/11september%2B043.JPG", "http://2.bp.blogspot.com/-8USaqwQrX0M/TogvzUCCf4I/AAAAAAAAAIM/yWAFGlZPLa4/s1600/11september%2B045.JPG"], "link": "http://spectrumliving.blogspot.com/2011/10/isam.html", "title": "\nISam\n"},
{"date": "Thursday, September 1, 2011", "body": "\nSummer is winding down and I am feeling that mix of emotions that comes with \"back to school\" time. I anticipate the extra fatigue of having to get the girls and myself out the door by 7am after interupted nights. Then I will teach all day, pickup the kids, manage Sam's afternoon therapies, try to keep up with the house and grading only to go to bed expecting, at best, an hour or two of sleep at a time. I feel sad about not being with the girls during the day. I feel guilty about NOT being sad about time away from Sam ( I don't know how you homeschooling moms do it). I feel frustrated before Sam's school year even starts because I am pretty sure we will see little progress again this year. Who knows, maybe Sam might be able to get to 3 whole minutes on his \"waiting\" program. (insert sarcastic eye roll here)\r\rI also feel a little down that yet again we have done nothing away from home as a family. I have been watching through the window while neighbors pack their bags and their cars and head out to make memories at the beach or in Europe or at a campsite. I am not dreaming of a a resort vacation but a day or two at a lake or the ocean would be nice. My mother, my sister (with her husband and son) and my father all ended up on holiday in England (my parents are British) this summer. They were there at different times but they got to see the places we lived/visited when I was a child. They got to see where my grandparents ashes were scattered. jealous. jealous. jealous. I was so jealous I felt sick to my stomach. I know it is selfish and stupid when considered along with all the real problems in the world but that it how I felt. Yet again this year I thought about buying a bathing suit but didn't. Yet again I didn't need it. I can't blame it all on autism. We couldn't have afforded a trip even if Sam were typical.\r\rSo, can we pick up your mail? Sure, we are not going anywhere. Can we pick up the papers? Sure, we are not going anywhere. Keep an eye on the house? Sure, we are not. going. anywhere.\r\r* * * * * *\r\rI have been keeping a mental list of simple things that would make life a little nicer here at home. I am hoping to add these into Sam's home program over the next year. Some of these goals are more about me than Sam\r\r1. I would like to be able to take a walk - a long one. I have had three kids now and I need some excercise. We actually started this one already by teaching Sam to hold the stroller and walk with me. He gets Skittles every so often if he \"walks nicely\". If anyone has a more natural alternative for Skittles please tell me. They gross me out but Sam won't go for jelly beans or gummies with natural colors and flavors. He has done pretty well. A few block is he starts jumping up and down osessively and hooting but we will keep at it.\r\r2. I would like to be able to sit together at the table for more than 2 minutes.\r\r3. I would like to be able to have something to drink with dinner. If I bring a glass of water to the table Sam will either steal it and spill it, stick his hand in it, or break the glass. If I use a plastic cup he will go bananas wanting to play with it.\r\r4. I would like to put the books back on my bookshelves and know that Sam will not destroy them.\r\r5. I would like to be able to take Sam to the grocery store and not have him try to knock all the cans off the shelves.\r\r6. I would like to be able to spend a day at a beach next summer - any beach. I don't expect to get any relaxation from this but I want to girls to have summer memories that include sand and water.\r\rI had more goals on my mental list but I can't recall them right now. Sam has been up since four and the baby still nurses during the night so that might have something to do with it.\r\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/09/watching-through-window-and-simple.html", "title": "\nWatching through the window and simple goals\n"},
{"date": "Friday, November 11, 2011", "body": "\nI haven't posted for a while. It has been a bad month. The sleep situation sucks, the destructive behaviors are in full force every waking minute (and since sleep is rare, that is a lot of destruction), and we are all feeling frayed.We switched to a new neurologist in the hope the he may have new suggestions. So far it is not promising.The good news is that I secured some additional services for Sam through the health insurance so we get a couple of hours of respite on the weekend while Sam is at some special needs classes. I use it to try to do normal kid stuff with Maya like arts and crafts that she can't do with Sam at home.I honestly don't know if I could feel like a crappier parent these days. The horrible angry vemon that spews from my mouth when Sam smashes something in the kitchen or rips up another book is terrible. I have lost all self control in that area. Between the nursing baby and Sam's night time fits I have not had more than an hour or two of uninterupted sleep in months and usually I am awake from about 1 or 2 am on due to all the wake-ups. My hair is falling out and my eczema is consuming my hands. I am very angry at myself for not being able to maintain a little more composure. I have had many ideas for posts but I have been too tired or pissed off to concentrate and write them.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/11/i-havent-posted-for-while.html", "title": ""},
{"date": "Saturday, September 3, 2011", "body": "\nI recently made Maya two skirts using an Oliver and S free pattern. You can make your own using these very EASY directions:http://www.oliverands.com/blog/2008/08/lazy-days-skirt-free-pattern.html  The bottom skirt is made from a great remnant I got at the fabric store and some pretty blue ribbon. The top one is polka dot Riley Blake fabric with ric rac trim. Maya LOVES them and has worn them every day this week. I think I will need to make a few more soon. SHe calls them her big girl skirts and tell me she is going to wear them to school.The project below is a knit necklace I made my sister for her birthday. The kit is from Jimmy Beans Wool (http://www.jimmybeanswool.com/). the yarn is a beautiful silk/merino blens and the tiny beads are glass. I designed some simple earrings to go with it to make a nice set. I hope they wear well.We have been adjusting to life with three children. Hannah is a pretty easy going baby as long as mommy is in sight. She does not get through the night without nursing a few times but I don't really mind. She goes to bed in her crib and then after her first wake-up she sleeps with me. She is growing FAST. At five months she was 17 lbs 6 oz. Since she was born earlier in the year than Maya and she is growing faster my goal of trying to only re-use Maya's clothes is not going to work out (I got her a few things of her own at first but I was hoping to limit the shoppingas much as possible). I caved and bought her more short sleeve items to last into the early fall. There she is on my lap.Maya loves to be a big sister but she has some jealousy to manage. She also wants desperately to play with Hannah and finds it hard to be gentle. She is not displaying anything out of the normal range of sibling adjustment. Whenever I take a picture of Hannah, Maya wants in on the action.Sam loves water as much as he did last year. He has a water table on the deck which I fill a few times a day. He has various items thathe dunks and then lines up on the table or the railing. He also has Mega Blocks (like large legos) that he lines up on the table upside down. THen he sucks up a mouthful of water and fills each block to the brim. Then he knocks them off the table and repeats. The only problem with the water play is that he ends up drinking a lot of the water. He pees and pees all afternoon and then wets the bed at night. I think I am going to have to cut off the water play at 4 from now on to see if that helps. He refuses to go back to pull ups at night (and I don't really want to anyway). Here is my tall handsome boy with a selection of water filled items:\n\n", "outgoing_links": ["http://www.oliverands.com/blog/2008/08/lazy-days-skirt-free-pattern.html", "http://2.bp.blogspot.com/-t7KwjA1uviQ/TmI5h5faXRI/AAAAAAAAAHs/eH8EPsaihqQ/s1600/11august3%2B001.JPG", "http://1.bp.blogspot.com/-CQzu2q144ok/TmI5YkQ-3oI/AAAAAAAAAHk/DIX7ED80ojc/s1600/11august3%2B002.JPG", "http://www.jimmybeanswool.com/", "http://4.bp.blogspot.com/-9eqeOjchT6g/TmI5G7yUILI/AAAAAAAAAHc/Ipccv7Hkvak/s1600/11august2%2B029.JPG", "http://2.bp.blogspot.com/-VNUlaJlZEDc/TmI4thp7ZEI/AAAAAAAAAHM/VYd_Q-iY8Jk/s1600/11august2%2B021.JPG"], "link": "http://spectrumliving.blogspot.com/2011/09/recent-projects-baby-hannah-and-sam.html", "title": "\nRecent Projects, Baby Hannah, and Sam with Water\n"},
{"date": "Sunday, November 13, 2011", "body": "\nOne of the things that went really well this month was a trip we took to an event at the local zoo. One weekend in October they decorate the zoo for Halloween and open the zoo at night (must buy tickets in advance). Kids walk around an \"trick or treat\" around the zoo. Local businesses and charities set up \"trick or treat\" tables at various locations around the zoo. I was determined to go this year - and I was determined to try to bring Sam . A friend was able to pick up tickets for me which was a huge factor in our being able to do this.We went on a Friday night. Sam wore a sweatshirt with a glow in the dark skeleton printed on it. It is about as much costume as he can tolerate. He has been able to use it for the past 2 years and I am hoping to find something similar in a bigger size next year! Maya dressed up like (a fully clothed) Ariel from The Little Mermaid (he interest in being a Disney princess was much to my dismay - I know I could have vetoed the costume but I had a weak moment). Hannah wore a jacket with bear ears and pants with paws on the feet.We got there a little early (note to self- go a little later next time) so we had to wait in line for the gate to open. Sam had a hard time but he got through it without stealing anyone's water bottle and smashing in on the ground. With the help of a pocket full of small treats, he managed to stay with me and not run away.Sam walked around with us pretty well. He tried to steal and throw water bottles at every table and he didn't understand the concept of taking ONE piece of candy. Maya had a ball!! She was so excited to see some spooky (or as she says it, \"booky\") things.We kept moving and made the rounds pretty quickly. We decided not to take any chances and left on a good note. I was on cloud nine the whole ride home because we actually did something all together.I am very glad we went because the real Halloween was preceded by a huge nor'easter. The Saturday before we were hit with snow and ice that downed power lines and knocked the power out for days. We had a few dark cold nights but we were in better shape than many since we got power back for good by the tuesday followong the storm. The storm was prodigious. During the snow a bunch of us on our street stood outside to survey the snowfall and every few minutes we would hear a loud \"crack\" and another huge branch would fall. Maya got some good snow play time on Sunday. Sam had a number of fits because he couldn't flick the light switches or listen to music. Many schools closed for a few days due to power problems and tree damage. On the \"real\" Halloween I took the kids to a few houses but due to all the ice and branches on the ground we were limited. The photos:Zoo BooThe snow:Maya having fun:Keeping the baby warm because we had no power/heat:\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/11/zoo-boo-and-storm.html", "title": "\nZoo Boo and the Storm\n"},
{"date": "Saturday, December 31, 2011", "body": "\nI tried to make sure a decent portion of the gifts I gave this year were handmade. People at work got ribbon scarves or ornaments. A good friend got knit fingerless gloves. These kimono sweatshirts were easy and fun to make. I got the pattern from Stitch magazine but I had to figure out the 3T size myself. I ended up giving these to the girls before the holidays because I couldn't wait to see if they fit. Finding gifts for Sam is always tough. This tin of popcorn (kinda gross, I know) was a big hit and he was very excited. He seemed to know it was his. We also got him a set of bristle blocks but so far they haven't been as great as I had hoped. Maybe they will grow on him. I knit Hannah a sweater that came out very well although it is too big at the moment. I also need to tighten up the button holes or put on new buttons.I finally gave Hannah the quilt I made for her this summer. It is my first quilt and I can't wait to make another one. I also made the girls matching jumper dresses but somehow I managed to forget to take a picture. They may not get worn much at the moment because Hannah is crawling like crazy and so dresses are not the best option for her. The style is very easy though and I expect it will still fit when she walks. The girsl got stuff that was not handmade as well. Hannah has a nice selection of noisy rattles and an adorable pair of shoes. Maya also got shoes (she loves shoes. . . ) and a \"big girl doll\". It was not one of THOSE dolls that cost an arm and a leg (I remember when they were 68 dollars and I started a cat feeding business to save up for one). It was an imitation but it is just as good especially for a 3 year old. I made the doll some pajamas because Maya pointed out she had nothing to wear to bed!I finally found someone selling the Oliver + S Bedtime Story Pajamas pattern on Esty so that is on the way. I have plenty of fabric just waiting to be used. I think that pattern is one I can actually make for Sam. Now for a day or two dedicated to sewing. . .\n\n", "outgoing_links": ["http://3.bp.blogspot.com/-1H2-fsDYrhw/Tv9UilLL_tI/AAAAAAAAANg/TV57ajsGozw/s1600/kimono%2Bsweatshirts.jpg", "http://3.bp.blogspot.com/-5cZzqL_5Pmw/Tv9Q7wCyN-I/AAAAAAAAANU/HBqK2CD90Xg/s1600/11december3%2B327.JPG", "http://1.bp.blogspot.com/-NALcObLE1lc/Tv9Qx6JUx_I/AAAAAAAAANI/3HWaDe0tZDg/s1600/11december3%2B317.JPG", "http://2.bp.blogspot.com/-XbCkMROpv5o/Tv9QZJC4XNI/AAAAAAAAAM8/HObF6942RjE/s1600/11december3%2B313.JPG"], "link": "http://spectrumliving.blogspot.com/2011/12/christmas.html", "title": "\nChristmas\n"},
{"date": "Wednesday, December 21, 2011", "body": "\n Time to knit a new hat.\n\n", "outgoing_links": ["http://2.bp.blogspot.com/-UOwk276LOqg/TvGwDM3GnUI/AAAAAAAAAMw/jSLh7qsLWSY/s1600/11march2%2B134.JPG", "http://3.bp.blogspot.com/-nNsaPnstR1Q/TvGvHUT2NkI/AAAAAAAAAMk/m9rF1Sfw1AE/s1600/11december2%2B101.JPG"], "link": "http://spectrumliving.blogspot.com/2011/12/where-did-time-go.html", "title": "\nWhere did the time go?\n"},
{"date": "Tuesday, December 27, 2011", "body": "\nSam's school made lots of promises back in early November. The most important were that they said they would help me negotiate respite care with DDD and they said they had \"connections\" and could send over a cheap carpenter to help me modify the home to create a couple of \"safe spaces\" for Sam when he is having a tantrum or being too destructive.SOme posts I started but never got to finish explained the reasons why we need safe spaces - the short of it is Sam has had a few episodes in which he has hurt the girls and damaged the house. Much of it was due to a medication reaction (he is off the med) but some of it was just Sam realizing his own size and power. Once you know you can't unknow. . .None of the promises came true. I suspect no one followed up with DDD but that is not my primary concern. I am wary of random respite care. I called various people and (politely) reminded them that because of their lack of action the girls and I were about to spend a week with Sam with no way to manage him if he gets worked up (other than perhaps to sit on him but i think he might be able to fight he way put from under me if I tried - I tried, by the way).I believe my case manager must have been a little annoyed at the school because she also thought they would get this done. She got permission for our home program teachers to come over break ( I am surethey are thrilled but truthfully I don't care. After they do their time they get to go home to their typical families and not listen to the constant clatter of objects hitting the floor). The school also gave us 5 hours through their budget (Sam is basically in an out-of-district placement). I got some hours through health insurance and so while it is not perfect, I have put together a decent program for him. I hope I can do as well in the summer.Last year we realized that we were no longer going to be able to travel for Christmas or Hanukah. Family members kindly say \"we don't mind\" and \" we will help keep an eye on him\" . but when their books get ripped and their stuff hits the floor, they mind. To truly keep an eye on Sam you must stay 2 steps behind him every waking minute and be ready to physically move him if he gets out of control.So for some reason we decided to travel on xmas day. My sister lives just over 2 hrs away and next summer she and her family are moving to California ( my sadness on that one is a post in itself). The drive there was smooth. The visit was terrible. Mark and I took shifts following him trying to prevent disaster but neither one of us really relaxed or got to enjoy the people we were there to see. Mark and I were unhappy but most of all we realized how unfair it was to Sam. There was nothing he could do. In our house we may hate the dropping but when we can limit it to blocks and toys we live with it because there is no choice. Our floors are damaged and we wish we had good earplugs sometimes but it is what it is. In someone else's home Sam is over stimulated and he is basically not allowed to do anything because nothing he does is appropriate.The ride back was scary. Early on we hit MAJOR traffic. We were at a near standstill for almost an hour and Sam FLIPPED out. He screamed at the top of his lungs, threw anything he could gets his hands on, kicked the front seat with all his strength, tried to escape his seatbelt, and tried to hurt Maya. Mark had a hunch the traffic was due to an accident so he got off at an exit that took us east and we took a chace that it would eventually hit a route that went north. After about 25 minute it did and we were ok. Sam loves car rides as long as we are moving.So no more travel. For real this time. Unless I get a visit from the mini van fairy and I find a safety harness Sam ca't get out of. And I don't see those things appearing any time soon.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2011/12/no-such-thing-as-vacation.html", "title": "\nNo such thing as a vacation/ no more travel\n"},
{"date": "Sunday, March 4, 2012", "body": "\nWe have learned some things over the last few months. I took Sam to a new neurologist because his ups and downs over the course of a day were so frustrating and he stopped sleeping again. We attempted a new EEG - BIG FAIL. Sam will have to be sedated if he ever has another one. And since he will also have to be sedated if he ever has his teeth properly cleaned I am hoping we can just make a list of all the things that need to be done and coordinate doctors and dentists for one big party in the hospital. WHat are the chances that will work???We tried different meds. MASSIVE FAILURE. We also tried cutting meds which was also a failure. Sam's behaviors got to the point where the school had to send me restraint paperwork because his tantrums were so bad they were afraid he might get hurt as they tried to stop him from hurting others or breaking things. He caused some pretty major destruction in the home as well. I starting reading about residential placement - and then hated myself.I got some ABA hours covered by insurance. They were already a covered service but there were no in-network providers when I first looked into it. Now there is someone local and he gets taken to art and music therapy as well as special needs swimming. Sam doesn't give a hoot about art but it gets him out and since he like ot be on the go, it helps.We went back to the main med Sam was on before only in a different form (tablet instead of liquid) and a once a day dosage instead of twice. Sma is a much happier camper. He is no less hyper and he still causes damage with his constant dropping and throwing but the aggrssive tantrums are down quite a bit.In this whole adventure I lost my bed. Sam has been fixated on sleeping a chunk of the night in our bed. For the last couple of years I have done the \"right\" thing and put him back in his room each time he tries. Usually this meant a few sleepless nights putting him back again and again until he got the idea. Then a few weeks later I would have to repeat the process. THis is the dirty secret of behaviorism - beating the behavior is only temporary. You may never win the battle. WHen Sam was really bad in the fall, he smashed his closet door, broke it and then threw it out the door at me. He is not the incredible hulk - it was one of thoose Ikea frestanding wardrobes (his room has not build in closet). But that was the end of putting him back in his room. He realized his strength and now he does try to kick through his real door (and I think he could if he wanted to). His school wants me to strip his room of everything but a mattress so he can be contained in there but that idea assumes that there is room somewhere else in the house to put everything and there is not. Also, when he is worked up I cannot transport him to his room so it is a silly idea. Now Sam comes to out bed sometime between 11:30 and 12:30 and I go to his with the baby. Unless he has wet the bed and then we get the couch downstairs.We are very glad to have a happier Sam back but we are still at a loss as to what to do next. His behaviors, while not aggressive, are still very destructive and impossible to manage despite the help of a team of home therapists.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/03/losing-my-bed.html", "title": "\nLosing my Bed\n"},
{"date": "Sunday, March 25, 2012", "body": "\nRead this story and then PLEASE send an email.  What if your child were denied the right to use his legs in school? Or maybe forced to tie her arm behind her back?   What if my son were not allowed to use his augmentation communication device (which would be like putting a gag on a typical child. )http://www.lovethatmax.com/2012/03/school-bans-kid-with-cerebral-palsy.html\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/03/read-this-story-and-then-please-send.html", "title": "\nRead and respond\n"},
{"date": "Saturday, January 14, 2012", "body": "\nEven those of us that have children who struggle to communicate KNOW that there is more going on in those heads than can be expressed. \"Mentally Retarded\" and \"Intellectually Disabled\" may be valid labels but they should not determine the worth of the child.This raises some serious questions about who gets to determine the value of your child's life. I suggest you read it and pass it on/repost.http://www.wolfhirschhorn.org/2012/01/amelia/brick-walls/If you feel moved to do something about it there are some suggestions here:http://www.lovethatmax.com/2012/01/should-kids-with-disabilities-be-denied.html\n\n", "outgoing_links": ["http://www.wolfhirschhorn.org/2012/01/amelia/brick-walls/", "http://www.lovethatmax.com/2012/01/should-kids-with-disabilities-be-denied.html"], "link": "http://spectrumliving.blogspot.com/2012/01/value-of-life.html", "title": "\nThe Value of a Life\n"},
{"date": "Thursday, March 8, 2012", "body": "\nHannah was born a year ago tomorrow. She nearly came six weeks earlier when I broke my arm in three places and almost went into early labor. I exhaled when the doctor said, \"It's a girl!\" As you can see from the picture I still had a cast on my arm. Getting her in and out of the hospital bassinet was not always easy! She nursed right away without issue and she cried when they took her away from me to clean her up and check her out.Here she is wearing the booties I knit her. They were the best!She loves to watch her sister.Big bright blue eyes.Lucky for us there are 3 spots on the swingset!The ipad is a big hit in our house. Sam is learning Proloquo2go, Maya loves games, and Hannah like to try to copy both of them. I think this would make a great poster for Apple.Teething.Big smile.We still spend a lot of time like this. Early on we used the Moby wrap and now we use the Ergo carrier. She can't settle down to nap with the constant Sam noise so when she looks like she is fading, I put her in the carrier to nap.Happy Birthday!\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/03/hannah-was-born-year-ago-today.html", "title": ""},
{"date": "Thursday, March 29, 2012", "body": "\nWe have wondered whether or not Sam is having seizures ever since his \"abnormal\" EEG. The report says the abnormal activity could be partial complex seizures. To get more conclusive information we would have to do an inpatient EEG with video. Since Sam would likely tear off his own flesh to remove the wires, we haven't done that yet. A while back, when Sam went through a phase during which he flipped otu if I wasn't in his bed, I noticed some strange mouth movements when he was sleeping. When he started coming into our room in the middle of the night we saw these movements again. It is kind of like a sucking/chewing/lipsmacking motion that happens repeatedly throughout the night. I mentioned it to the various neurologists and they said the only way to know if it was seizure related was to do that inpatient EEG but neither of them seemed in a rush to do that. Recently, Sam began to make foam in his mouth during this motion. We have twice seen a big gob of foam on his mouth in his sleep. I called and he has asked us to try to film it so he can get a look at it. I got a picture of the foam the other day but the motion had stopped by the time I got my Flip cam. So, we will keep watch and try to get it recorded. And I have a feeling we may have to do that inpatient EEG at some point in the near future.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/03/seizures.html", "title": "\nSeizures\n"},
{"date": "Sunday, April 15, 2012", "body": "\nSomething about this doesn't sit right with me.Earlier this year I found an in-network provider of ABA hours through my health insurance.  The BCBA running the program used to work in my son's first school so she knew him.  We met and discussed her program.  She said she like to get the kids out of the house doing community experiences, social skills classes, swimming, etc.  I stopped her right there and said I was not in position to shell out for a bunch of classes if that was going to be necessary.  She told me that the classes were covered because they were part of the therapy.  We got started and it seemed to be going well.  Then. a few weeks into the program, I got an email telling me that she wanted to bill me extra to cover \"expenses\" not covered by insurance like the swimming and incidental expenses when they go out in the community.  She wanted to double my co-pays (an extra 120 a month).  I told her that I already provided a few dollars for each community outing and that I could not budget to double my co-pays.  I pointed out that I had specifically asked about the cost of the class before we started.  SHe dropped the issue.A few months later I got a bill for double my co-pay amount.  I emailed and asked what was going on.  SHe replied \"We talked about this - it is for extra expenses\".  I reminded her that we DID talk about it and that I had said that was not ok.  As an in-network provider it is illegal for her to bill me beyond the co-pay.  Since then she has started dropping all his acitivties.  SHe only wants to send a therapist to work alone with him in his room.  She doesn't even want him going otu for community experience.  SHe has told me that she either wants me to pay out for swimming or to get disabilty to pay for it.  Here is the kicker - she wants me to cover the cost of swimming so she can have her therapist dribve him  there and she can bill the time as ABA.  Does that sound like fraud to you?  My husband took Sam to the swimming class once because the  therapist was sick.  There was nothing for him to do but sit and watch and then get Sam changed after.  If there therapist were in the water with him I could understand calling it ABA but if there therapist just takes him there and I am paying for the class, how is that ABA?  If she has to cut the class because she can't run her business that way then that is fine but she shouldn't ask me to pay for something that she then wants to bill as one of her services.I understand she has to run her business and be able to make a living but it feels likes dropping everything that involves taking him out of the house is just mean spirited.  Sam loves to go out and they know that.  Sam already get \"at the table\" ABA all day at school and we have a home program from the school.  The whole point of signing up with this provider was to add something different to his schedule.  It was also to get a little respite for the rest of the family members.  I used his Wednesday outing to take a shower - it was the only time possible.  I used his other outing to take Maya out.  If they are in his room every time then that is all out the window.  Going on a community outing doesn't cost her any extra.    I send a rather critical email to the group last night so now I am waiting to get kicked out of the program.\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/04/billing.html", "title": "\nBilling\n"},
{"date": "Friday, April 13, 2012", "body": "\nThis is one of those posts that sounds a little pathetic and is full of self pity.  Sorry in advance.When I moved in with my husband I was finishing up graduate school and working full time.   I didn’t really have time to make a lot of friends.  I was commuting from New Jersey to New York City. Then I had Sam and between working full time and spending time with him, I didn’ t have time to make a lot of friends.  I stared to – I got to know a few more people around the neighborhood and we spent some weekends with friends of my husband.  I changed jobs and was working closer to home.  I thought I was getting into a routine that would allow me to meet other young parents and build a social network.  Then Sam started to show his symptoms.  My life became all about therapy, research, and work- as it should have in that situation.  As it became more and more difficult to take Sam places I just stopped going anywhere but therapy appointments, work and the grocery store.  I have people I talk to at work but there are limits to that.  When a friendship doesn’t extend beyond the walls of a particular building it doesn’t fully develop.  The financial problems don’t help.  On exam or professional development days when we have more than the usual 25 minutes for lunch most of my coworkers go out to eat.  Because I worry about splurging on a restaurant meal, I often opt to sit in my room with whatever I packed to eat that morning.  No one really calls anymore.  I understand why – you can only hear no so many times before you just stop asking.I am a relatively introverted person.  All my life I have needed a certain amount of time to myself so I think I handle the isolation better than many might.  There are days and even weeks when I don’t notice or mind at all.  But then there are times when it is just lonely.But even the occasional bought of loneliness would be manageable for me.  I might feel down about it from time to time but I would work through that.  What is really making me upset right now is that it is starting to affect Maya.  You see, her birthday is coming up and I can’t give her a party like she wants – because I have no one to invite.  Maya went to a “real” birthday party last summer and ever since she has been dreaming about having a party –with friends- when she turns 4.  I assumed that would be possible.  I assumed that once she started pre-school she would start getting play date invitations and birthday invitations.  So far, she has only had a play date with a girl she knew before school started (don’t misunderstand – this girl and her family are lovely  - Maya would play with her every day if she could).  She has not been invited to a single birthday party this school year.  I don’t know if it is just the age, the particular culture of this school, that fact that I work and so none of the other parents know me?  I tried to put her in a Sunday school program to make more friends (and since I would be at church I would meet the parents) but I haven’t found a place that has any kids her age in my religion.  Do I have to convert??? I realized how quickly Sam’s and Maya’s birthdays were approaching a couple of nights ago.  I started to realize that even if I wanted to plan a simple “kid” party, I don’t have anyone to invite.  I don’t have other parent friends with kids who could come, I don’t know any of her classmates’ parents, and our extended family is very limited.  We WILL have family over to celebrate but that will be her grandmother, and her great aunt and uncle who are in their 80s and maybe her 2 year old cousin.  We love to have them over and it will certainly be a fun time but it is not a get together with friends which is what she keeps asking for and hoping to have in addition.  (I am not minimizing the importance of a family celebration here  - please don’t misunderstand)I realize that at her age this is not the biggest deal.  She probably will have no memory of not having a birthday party at this age but what I keep thinking about it that I have no way to change this.  There is no chance I will ever be able to quit my job.  My hours will never allow me to drop her off/pick her up at school so I will never know her classmates or their parents well.  Sam is not likely to improve to the point where we can start reconnecting with past acquaintances.  At age 5,6, 7 she will notice if other kids have birthday parties and she does not. So what do other parents of special needs kids, who also have typical childre,n do to give their typical kids a chance to socialize?\n\n", "outgoing_links": [], "link": "http://spectrumliving.blogspot.com/2012/04/this-is-one-of-those-posts-that-sounds.html", "title": ""}
]