[
{"date": " September 11, 2009", "body": "\nIve seen many definitions and many characterization's about this subject and it seems to me people in the Autistic community parrot what they read about others. And even parents are guilty of perpetuating stereotypes.   I have a hard time boxing myself in or my son in by some of the junk I read. It is as if once you are dxed with a syndrome you now enter into clone territory.Its very frustrating sometimes because people want simple answers to complex issues.   Each person on the Autistic spectrum has a unique set of \"let me say\" \"Quirks\" Each person on the Autistic spectrum has their own set of morals. Each person on the autistic spectrum has their own set of ideas about a range of subjects. Can people on the autistic spectrum talk about more than one limited subject?  Yes and perhaps No and everything in between.   Personally I do not write like I am gifted, I have maybe a 6 year old child's grasp of Math,  I am versed in many things like medicine and some psychology , I am somewhat OCDish,  Things upset me sometimes like dental pain and I get mad and confused and start making snap decisions about what doctor to go to.  I have a hard time trusting people.  I have been abused in my past.   I have been told I try to control people when I didn't know what that meant...  My fear has ruled me,,,, I slept in my Mother's bed until I was about 19, not all the time of course but once in a while cause I was scared of the Dark.   I am not scared of the Dark any more.  I found out what Stars were when I was about 35, before that I thought they were planets,,  now I know they are suns. I know now there isn't a person on the planet that is exactly like me,  in the past I thought maybe some day I would meet someone exactly like me,,,  but I know that to be a Fallacy today.  Oh and I do not spell very well either... Some People think that people with Autism or Aspergers Syndrome all have a Genius in something.   I have found that to be another Fallacy.  We Are Not All Geniuses!Some of us are Very good at somethings >>> Yes sometimes that is true But it is also true that some of us have a very limited set of skills or verbal talent or no verbal talent at all. Some of us Need a Lot of Help in Navagaiting the World and the World doesn't often Understand that.\n\n", "outgoing_links": [], "link": "http://autism-vicky.blogspot.com/2009/09/what-is-autism-or-aspergers-syndrome.html", "title": "\nWhat Is Autism or Aspergers syndrome Really?\n"},
{"date": " September 15, 2009", "body": "\nWell folks I just read Mirror Neurons have made their debut in Addiction medicine.What can this all mean? Hmm,,, Well I don't really understand the Mirror Neuron concept or theory... but I suppose just like Genetics people will start applying it to everything they can think of..... Silly Humans,,, don't they know \"Tricks are for Kids\" Tricks was an American cereal that came out and had commericals on TV with the slogan \"Tricks are for Kids\" with this rabbit\n\n", "outgoing_links": ["http://4.bp.blogspot.com/_3hC1MqUUdbw/Sq_Mxb4JycI/AAAAAAAAAAY/xdUDoLS5mCA/s1600-h/Tricks+are+for+kids.jpg"], "link": "http://autism-vicky.blogspot.com/2009/09/curious-case-of-mirror-neurons.html", "title": "\nThe curious Case of Mirror Neurons\n"},
{"date": " October 7, 2008", "body": "\nOk I have to update everyone to my new blog url thing.. anyway more to come.. and hi out there :0)\n\n", "outgoing_links": [], "link": "http://autism-vicky.blogspot.com/2008/10/new-blog.html", "title": "\na new blog\n"},
{"date": " October 7, 2008", "body": "\nI went to my sons IEP the other day and I really didn't have to do anything or prepare for anything as nothing really has changed even though its his third year review time..  But in true form I seem to say the most fighting words even though I had nothing to fight or justify...  well I felt foolish afterward but I guess that is my lot in life at times...  putting my foot directly in my mouth...  it gets old but still leaves me down on myself for saying the wrong thing at the wrong time...\n\n", "outgoing_links": [], "link": "http://autism-vicky.blogspot.com/2008/10/why-i-dislike-ieps.html", "title": "\nwhy I dislike IEP's\n"},
{"date": " October 31, 2008", "body": "\nWell let me say I didn't set out with a plan to get a flu shot.. But my husband got one with no ill effects... So actually I went to the doctor concerning my cholesterol which is running a bit high. Now really the point is that I am a admitted paranoidiact... is there such a thing?? Yeah.. OCD and all...  Now I was sitting there at the doctors office and the doctor said.. Did you get a flu shot? No I says... cause I have never had one before ever... thing is I kind of doubted they would work but that was about it..  and so anyway in a split second I reasoned that my husband got one with no ill effect so ok yeah I'll give it a whirl..  So I get it... it was painless,,, at least at that moment.... and then later that day my arm got sore at the site of the injection... and that weekend I slept most of the weekend... not really sick though...   But this post is not really about the shot per se or any claims of disasters...  Its more about the odd workings of my mind and the health industry and my fear of it in general... back to the paranoiaic or whatever.. You see it occured to me over 20 years ago that if a doctor gave you a medicine and it just happened to make you sick or perhaps kill you then really hey they don't take responsibility...  or liability...  or really they just don't care and can't care about every patient that walks through their doors or they would be a basket case... so they have to distance themselves from the work they perform....  But anyway whats that all got to do with the flu shot... well this is how it goes...  I get the flu shot and then I am waiting for something to happen,, some adverse effect that can be reported to the vaccine whatevers... but nothing happens ... ha ha... but I must say my arm is still a little sore after 3 weeks... hmm odd but whatever... Well getting back to how this all started... then there is the cholesterol issue...  hmm another plot...  thing is there is a plot.... as this paranoia is something that's genetic and passed through one generation to the next or maybe just to the few lucky saps who can't reason their way out of a paper bag to come up with logical and sound decisions.... Now if I sound critical I am but the joke is on me...  I find that I cannot understand all these medical papers I find or find contradictions and end up with numbers and statistics.... Well being somewhat of a dyslexic as far as numbers and knowing ones left from the right this presents as a major stumbling block to all my online research...  so yeah back to square one....  to be or not to be.. or should I gamble with my health on facts I don't quite understand but have made every effort to do so...  Well the thing with statin drugs is that they can damage muscle tissue and possibly damage your liver and possibly your kidneys.... but yeah folks they have a major campaign to push these statin drugs to a ever widening population...  lets give em to kids too now... statins for everyone...   Ok that sounds strange but dig a little and you will find truth in it.. well I suppose I could rationalize taking them if my cholesterol was hovering around 270 or 300 or more but its not.... and they \" the medical oracles of the day are expanding on their theory's to sell more meds I think...  that is to say that the numbers for cholesterol keep getting lower as a goal......  Hmm,,,, ok I admit I am paranoid,,, but whats a good paranoidiact to do...??   Aye....  take niacin maybe... how bout some fish oil???? OH Wretch.... I can't imagine trying to digest that.... So I wounder what people will be eating in the year 2090.... tasteless colorless something or others with nannites to eat away at the bad whatevers in your stomach and intestines.... think of it as a food and a vacuum all in one ...     well all tounge and cheek aside , its not what you eat but how you play the game... or whatever\n\n", "outgoing_links": [], "link": "http://autism-vicky.blogspot.com/2008/10/how-i-ended-up-with-flu-shot.html", "title": "\nHow I ended up with a Flu shot\n"},
{"date": " August 9, 2009", "body": "\nWe for me it is not being sure always what people are saying. People have to be really direct in their meanings when they talk to me or ask me questions. I am not sure if that is the true definition of mind blindness or if it has something to do with speech and communication.\n\n", "outgoing_links": [], "link": "http://autism-vicky.blogspot.com/2009/08/what-is-mind-blindness.html", "title": "\nwhat is mind blindness?\n"}
]