[
{"date": "November 25, 2009", "body": "Well, I  was  am all excited about my blogging prospects, but DANG if I can find the time to do it.  I have been reading a lot of blogs lately by other autism moms and have run the gamut of emotions as a result.  It really is true.  Those that live it, truly understand it.  Others may be able to sympathize, but true empathy comes from like experience.  This is especially true with the enigma that is autism.  It is so hard to explain to those who have not spent a lot of time around it.  Anyway, while reading all of these blogs authored by some of the smartest and funniest and most introspective ladies I have ever known, I realized that I have been blogging for years.  I just haven’t typed it out or put it down on paper.  But, the self-dialogue that I have constantly running in my head is just a blog waiting to happen.  I hope to organize these thoughts, get them down on cyber-paper….easier said than done, I have already discovered.  I want to become a part of this amazing network of people instead of just reading all about their lives and feeling like a creepy lurker for not actively participating.  I hope that I can occasionally contribute something poignant, funny, generally worth reading.  Love…. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": [], "link": "https://rebekahscot.wordpress.com/2009/11/25/hello-world/", "title": "Congratulations!  It’s a blog!"},
{"date": "April 22, 2010", "body": "For my first installment WMLDNS, I’m not going to go for the obvious.  I’m going to go off the board a bit because I have been thinking about this of late. Yes, Autism sucks.  Autism sucks the biggest, nastiest, most undesirable thing to suck that you can imagine.  Other things suck equally and more.  I would never claim that autism is the worst thing to happen to any person ever.  That would be silly, and yet, some people like to indulge in such arguments, as if everyone’s life experiences are not subjective and relative and defined by each individual.  So, if anyone feels the need to type a statement such as “it could be worse” or “at least it’s not [cancer, cerebral palsy, death by fire, consumption by grizzly bear, etc.]” or “you should appreciate your child’s uniqueness”, please, refrain from comment.  Do me a favor and keep your thoughts to yourself.  I don’t need you judging my pain and suffering.  I don’t need your commentary on my joy and happiness.  I don’t need you. So there.  I didn’t mean to rant, but I kind of like it.  I will leave it. The point that I am trying to get to is that despite the vast suckage that autism is, my kid is pretty damn happy.  He smiles all the time.  He loves school.  He likes to go places.  He loves his family.  He loves to play.   He has the cutest little sense of humor.  He is sneaky and mischievous.  He only seems completely miserable when he is denied something that he wants, and , well, that’s pretty typical. Yes, he does retreat into his stim-world with regularity.  Don’t we all need a break sometimes?  Yes, he does have his frustrations that will only increase as he becomes older and more aware.  But, we will deal with them as they come. Right now, he is pretty happy, and that does not suck. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": [], "link": "https://rebekahscot.wordpress.com/2010/04/22/why-my-life-does-not-suck-volume-1/", "title": "Why my life does not suck: Volume 1"},
{"date": "June 25, 2010", "body": "I have been absent.  From here.  From work.  From life in general.  The only place that I have been consistently present is in my own head surrounded by a cacophony of thoughts and emotions that refuse to be filed away to be dealt with at a later date.  Apparently, the filing cabinet was already full. Well, I am tired of cowering in a dark, dank corner of my psyche.  I’m a social person.  I usually reach out to people.  Seclusion is so not good for me.  So, why my psyche decided to run and hide and cut myself off from those that know and love me is just a mystery to conscious me.  Why haven’t I called?  Written?  Answered with something other than an automatic “I’m fine”?  I don’t know.  For some reason, at that point, my misery did not want company. Anyway, enough of that.  I am going to be present.  And, I’m getting a little help to do that.  I am seeing a therapist.   I have never done therapy before.  I have had one session with her, and I really like her.  I think I may have lucked into the perfect therapist for me, and I am very grateful.  I didn’t want to go down the full list of in-network providers before I found someone I liked. So, I am reentering society.  Someone buy me a white dress and throw me a debutante ball.  Or, let’s all get together for food, margaritas, dancing, laughing and much regret the morning after.  I could so deal with that. Love… \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": [], "link": "https://rebekahscot.wordpress.com/2010/06/25/absenteeism/", "title": "Absenteeism…"},
{"date": "March 15, 2010", "body": "I am a bad, bad blogger.  I assure you that my “Reasons my life does not suck…” post is only delayed due to my being busy/lazy and not because I am searching for the perfect bridge from which to fling myself. In the meantime, I will post music that I like. I just got the new Motion City Soundtrack CD.  I like the previous CD better, but I really like this song. I also got the new release from Benjy Davis Project, whom I truly and deeply adore.  But, none of it is posted on YouTube yet, and I don’t have the skills to do it myself.  Later… \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": [], "link": "https://rebekahscot.wordpress.com/2010/03/15/if-i-stand-too-close/", "title": "If I stand too close…"},
{"date": "May 13, 2010", "body": "This really should have been Volume 1.  Simply stated, my family kicks ass. My parents are amazing people.  They have dealt with some very difficult stuff in their life together.  Child illness…child disability…child illness again…child death.  DLK, January 22, 1981 – August 28, 1989.  (Hank looks remarkably like him.)  How did they make it through and still remain the sparkling examples of humanity that they are?  How did they continue to cultivate such love, faith and humor through such hardship?  They could have easily become so bitter.  But, they didn’t.  Why?  How?  Because they kick ass, that’s why.  Through love, faith, hard work and a strong foundation, that’s how.  My mom never fails me.  My dad is the most rock solid man on earth…and, he knows how to fix just about anything (bonus!). My mom and Dagney playing Jenga, Christmas Day 2009. \n My dad, wearing his patented couch camouflage. I have already written about  my sister .  She used to be a real pain in my ass, always following me around and bugging the crap out of me when I just wanted to be left alone to read my 900-page book in a quiet corner (wow, there is an uncanny Dagney parallel there).  However, when I was 14 and she 11, we became friends (that year would be 1989, notice the parallel with the date above).  We are so different and so alike.  She has her own busy life, but she always has time for me (and I for her). \n My sister and her husband. My husband’s parents are equally amazing.  We literally, really and truly could not survive without them.  I take Hank to their house every morning and he catches the bus to school from there.  They get him off the bus in the afternoons and pick up Dagney from the bus stop.  As if that is not enough, they do so much more.  They are two of the most giving people I have ever met, and I am so very thankful that I can claim them as family. And then, there is my husband.  He is my soul mate.  We compliment each other beautifully.  Neither of us are perfect, but we are perfect for each other.  I really think that he deserves his own post.  I will try to get around to that. \n My family unit, sans me, of course. \n \n \n \n \n \n \n \n \n \n \n \n \n\t\t\t \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t \t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/05/picture-108.jpg", "https://rebekahscot.files.wordpress.com/2010/05/mom-and-jes.jpg", "https://rebekahscot.files.wordpress.com/2010/05/picture-104.jpg", "https://rebekahscot.files.wordpress.com/2010/05/amy-and-earl2.jpg", "https://rebekahscot.files.wordpress.com/2010/05/138-1-1.jpg"], "link": "https://rebekahscot.wordpress.com/2010/05/13/wmldns-volume-2-a-rundown-of-my-crazy-family/", "title": "WMLDNS Volume 2: A Rundown of My Crazy Family"},
{"date": "June 30, 2010", "body": "This is my couch, or a close approximation anyway of how it looked when we purchased it.  It does not look like that anymore.  It has taken a beating.  It has been eroded by time.  I think it may have a case of Hank-induced Post Traumatic Stress Disorder.  It has become resigned to its existence, but I detect some bitterness.  Of course, that may just be from the coffee that Hank poured on it last week. Recently, I can really identify with that couch. The couch is rarely fully put together.  The cushions are removed and slung about, leaving its guts bare to be bounced upon by ungentle feet.  It has springs popping out, coiled and ready to snag unsuspecting victims.  It is covered with stains, some visible, others hidden and ingrained. You see, one of Hank’s favorite activities is to dump all manner of everything onto that couch.  To date, the list of abusive substances includes water, tea, sodas, coffee, five different colors of paint, toothpaste, chicken soup, diaper cream, lotion, whatever is inside a snow globe, rice, noodles and other unmentionables.  I can clean the outside.  The cushion covers have been stripped and washed so many times that one is ripped at the seams and no longer zips.  But the inside, I’m pretty sure that it is permanently scarred. I am that couch. Many nights when Hank falls asleep, oftentimes on that couch, I study him.  His face in perfect repose.  The even rise and fall of his chest.  His eyelashes casting spiky shadows.  And the feelings overwhelm me.  The love, the sadness, the wonder, the determination.  It makes me heavy.  It makes me light. John will carry Hank off to bed, and the couch and I will breath a sigh of relief.  If it’s not too late, John and I will watch some TV, frequently cuddled together on a single couch cushion because the other is getting over its most recent trauma. The couch, plus Hank and minus the cushions, 2008. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/06/blue-couch.jpg", "https://rebekahscot.files.wordpress.com/2010/06/058.jpg"], "link": "https://rebekahscot.wordpress.com/2010/06/30/me-and-my-couch/", "title": "Me and my couch…"},
{"date": "February 3, 2010", "body": "Wow, already I am going weeks without posting on my brand new baby blog.  Really, it’s shameful.  I blame sickness and general malaise.  I’m better now, but I don’t have time to post much of anything at the moment.  So, I’ll just play picture catch-up! These are from Dagney’s dance recital in early December… Isn’t she the prettiest thing?  Yes…yes, she is.  Thank you. Ignore that hole in her tights.  Apparently, she got in a fight with another little girl backstage.  She won, of course.  (I kid.) Watch out.  I can feel you falling for her charms.  You must resist! Wow.  Look at those dimples.  You could store dry goods in there! Here’s a few more from another time… AAAAaaahhhhhhh!!!!…Wow, it is scary how much she looks like me in this picture.  Don’t worry, folks, it’s just a big, squishy purple ball. Yeah, this is just wrong, I know.  It was her idea.  I blame her. More pictures later… \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/02/picture-050.jpg", "https://rebekahscot.files.wordpress.com/2010/02/picture-051.jpg", "https://rebekahscot.files.wordpress.com/2010/02/picture-052.jpg", "https://rebekahscot.files.wordpress.com/2010/02/picture-054.jpg", "https://rebekahscot.files.wordpress.com/2010/02/picture-059.jpg", "https://rebekahscot.files.wordpress.com/2010/02/picture-066.jpg"], "link": "https://rebekahscot.wordpress.com/2010/02/03/picture-pages-picture-pages-time-to-get-your-picture-pages/", "title": "Picture pages, picture pages, time to get your picture pages…"},
{"date": "February 15, 2010", "body": "I got to see my favorite band Saturday night…Sister Hazel.  Amazing lyrics.  Awesome music.  Most fun live show.  Nicest group of guys on the planet.  Seriously. I was moping around Saturday morning because they were in town and I couldn’t see them.  John and I usually go see them together, and we had no babysitter.  John had pity on me and told me to go without him.  It was like he’d handed me a 6-pack of happiness and a funnel and told me to party like it’s Spring Break, 1993.  Woohoo!! Seriously, these guys and their music make me so darn happy that I just cannot stand to miss a show when they are in the area.  So, I spent the afternoon trying to track someone down to go with me, quickly came to the conclusion that I am pathetic and have no friends, and then I finally found somebody.  Yay!!  My husband is a good, good, good, good man. Sister Hazel concerts are really fantastic.  Everyone there is singing every word to the songs, and there is just a great camraderie between the audience and the guys on stage.  This was especially useful Saturday night because Ken Block the lead singer was not there.  Drew Copeland, the awesome back-up guy and occasional lead, had to fill in.  It was funny because he screwed up the lyrics numerous times and the audience backed him up every time.  It was casual and funny, and I had a great time. I want to mention why Ken was called away because I would like y’all to put his family in your prayers.  He had to rush back home that day because his daughter was bitten in the face by a dog.  She required 5+ hours of surgery that day.  Hopefully, her prognosis is good. So, as I was having a great time at a concert, he was dealing with tragedy in his family.  Prayers for the Block family. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/02/sisterhazel1.jpg"], "link": "https://rebekahscot.wordpress.com/2010/02/15/happy-happy-joy-joy/", "title": "Happy, happy, joy, joy…"},
{"date": "December 21, 2009", "body": "This is my favorite version of a Christmas song.  It is done by Crash Test Dummies.  Yes, the guy’s voice is really odd, but listen…and wait for it… Isn’t that wonderful?!!  It makes me teary every time I hear it.  Just gorgeous. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": [], "link": "https://rebekahscot.wordpress.com/2009/12/21/the-first-noel/", "title": "The First Noel"},
{"date": "February 9, 2010", "body": "…at your worst, at your best, at your strongest, at your weakest.  In all your real-ness, without the everything’s-ok-really-it-is!! mask super-glued to your face. This weekend kind of sucked.  I wasn’t feeling so great, tired and victimized by a bit of a stomach bug.  John threw his back out just in time for his birthday.  His parents took us out to eat, and I ended up having to take Hank out of the restaurant because he was throwing food and generally acting up.  Then, he was up half the night with apparent ear pain.  We had already been to the doctor earlier in the week, and Hank had been diagnosed with a double ear infection and croup. So, fearing a relapse of the ear infection and not wanting to wait another day to go to his regular doctor, I decided to take Hank to the urgent care facility to get his ears checked out.  I gave John leave to stay home with Dagney and his aching back, but I didn’t want to go alone.  Hank can sniff out a doctor’s office a mile away, and I was feeling fragile.  I called my sister in for the assist. I knew how this whole thing would go down.  I had that whole emotional-house-of-cards feeling.  I knew that I would end up crying and looking pathetic.  On the way to pick up my sister, I wondered for a moment if I really needed a witness to my breakdown.  Without hesitation, I answered myself with a resounding “YES!”  On that day, I needed a helping hand, an arm for support. So, my sister saw me that day.  In all my teary, coping and not quite coping, a little bit crazy and yet painfully practical glory.  I let it all hang out because I was tired and incapable of holding back.   It was a relief just to let her see my struggle, the thing that I deal with every day, because she is one of those people…one of MY people.  Someone that I can bear all my flaws and fears to and receive only love, support and humor in return.  No judgment…no pity…only the good stuff.  I’m not sure why I held back as long as I did because I never expected anything less from her.  It felt good to be seen. My sister.  She is awesome.  I love her. And, to all of my other awesome people out there.  Here is a song that makes me think of you. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/02/me-and-amy-1.jpg", "https://rebekahscot.files.wordpress.com/2010/02/amy-with-bc2.jpg", "https://rebekahscot.files.wordpress.com/2010/02/me-and-amy-21.jpg"], "link": "https://rebekahscot.wordpress.com/2010/02/09/sometimes-you-just-need-to-people-to-see-you/", "title": "Sometimes you just need to people to see you…"},
{"date": "February 25, 2010", "body": "I have this friend.  Actually, she’s my boss, but I put her strongly in the friend category.  We immediately hit it off when she was hired.  We’re on the same wavelength.  She gets my dry twisted humor, I get her obscure cultural and literary references (most of them anyway).  We have laughed a lot in the past couple of years. She came into my life right at the beginning of the “is it autism?” process, so she has been a first hand witness to all the subsequent very low lows and very high highs that are an inevitable part of the whole parenting a kid with autism experience.  She told me later on that she never knew what to expect when I came in to work. Me:  Was I that bad? Her:  Yep. Me:  Yeah, I guess I was.  Thanks for dealing with that. Her:  No problem. I still am that bad every now and then.  I don’t really let her see it any more though, if I can help it.  I seem to have reached a point where talking about it with her is counterproductive.  This happened in two parts. Part 1: I was sharing some of Hank’s lab test results with her.  I pointed out some really impressive metal pulls on a stool analysis. Her:  Hmmm.  You are spending a lot of money on these treatments, are you getting results?  Is he getting any better?  ** she directs a look of sincere concern with a mix of pity at me** Me:  …ummm…uhh…* stammer…stutter…mumble something…get the hell out of her office as quickly as I can* I am raging pissed.  I have shared a lot with her about Hank’s treatment protocol.  She is open-minded about alternative therapies and such, and I shared with her in good faith that I had found a supportive ear.  Doesn’t she know that I have  my own  doubts?  It’s not like there is an established treatment regimen for autism.  There is no  How to Reverse Autism for Dummies  do-it-yourself manual that you can pick up at B&N.  I have researched.  I have chosen a path.  I have put my faith in a process.  As well-intentioned as her question may be, HOW DARE SHE compound my doubt?!  HOW DARE SHE question MY decisions about MY child?!  I don’t need a fucking intervention, and how in hell she thought it was an appropriate thing to bring up is beyond my comprehension. I’m not sure my anger is entirely rational, but it is mine and I OWN it.  I mentally strike a big, black, permanent line (with an asterisked side notation of  HELL, NO! ) through her name  on the short list of people who I confide in about Hank’s treatment. (The list pre-edit.) Part 2: Hank’s antics have been many and far-reaching of late.  I share some of his most egregious exploits with her.  Some of them are actually quite funny. Her:  My God!  That would drive me insane…yada, yada…I don’t know how you do it every day…yada, yada…Your situation is so difficult…yada, yada… Me:  Well, it’s not that bad… Her:  No, it’s really hard.  I admire you for being able to do it. Me:  Ok.  Thanks.   *Inwardly, I wonder why I am mentally cataloging the best ways to kill myself.  Do I go for scandalous drama with autoerotic asphyxiation?  Or do I go with the understated but always classy Vicodin overdose?  Jumping off of buildings and bridges is so overdone.  Where’s the originality?  Maybe I should go with something more covert like slowly atrophying my brain into a vegetable state by watching marathons of Rock of Love and I Love New York… Me:   Hey!  Wait a damn minute.   My life does not suck!  Quit acting like it does! I don’t say that out loud though.  I’m back at my desk staring blankly at my computer by the time I realize exactly why that whole conversation made me feel so icky.  It turns out that there is a fine line between acknowledging the difficulty of someone’s situation and giving them directions to the nearest bridge to jump off of, and she is precariously straddling that line in every conversation I have with her about my dear, sweet son.  I mentally revise the list of subjects that I should just avoid with her. \n Next post…Reasons why my life does not suck… \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/02/aj1enqklqs.png", "https://rebekahscot.files.wordpress.com/2010/02/xxfjbsmndb1.png", "https://rebekahscot.files.wordpress.com/2010/02/zmnklan3fx.png"], "link": "https://rebekahscot.wordpress.com/2010/02/25/my-life-does-not-suck-quit-acting-like-it-does/", "title": "My life does not suck! Quit acting like it does."},
{"date": "December 16, 2009", "body": "I have been thinking further on the expectations game.  As noted, I have decided to unfetter myself of the crazy high expectations and just go with the flow.  Now, this does not change our approach in any way.  Do not label us laissez-faire.  We will be working, striving, figuring out how to circumvent the many brick walls that we will run into, all on Hank’s behalf.  Never doubt it.  This is more a move toward acceptance and practicality.  A change in viewpoint, backing off just a bit to observe and process. So, we were at church Sunday night.  We don’t attend as regularly as we should.  We often keep Hank at home because having him in the church service is an impossibility and I hate to leave him in the nursery all the time.  But, we all went this night because Dagney was in the kids Christmas musical.  I watched the dress rehearsal because I was expecting to have to chase Hank through the halls or stay in the nursery with him during the actual performance.  However, he was perfectly content in the nursery, so I gave the workers my cell number with instructions to text me if needed and to keep him away from the animal crackers.  It was very nice (weird, actually) to be able to sit with my husband and watch our oldest perform. Afterward, there was a church social.  To put it in perspective, the last event of this type that we attended was a Thanksgiving dinner a few weeks previous.  We had to put Hank in a highchair to contain him, and once he could no longer be peacefully contained, the adults took shifts following him around and keeping his hands out of the myriad of food dishes that were on display, our version of gluten/casein keep-away involving lots of quick side-to-side shuffling to block his path to the pigs in blankets (pigs-in-blankets?…pig-in-blankets?…surely all those little wieners don’t add up to more than one pig).  Quick sum up, he ran all over the place squealing like a pig (possibly in a blanket), and I broke out in a sweat….and hives.  I was glad to leave. But, on this peaceful night, it was different.  He was different.  Possibly still enjoying the afterglow effects of sitting in church with my husband, I was different.  I got a plate for myself and Hank and sat down.  I didn’t get the highchair, which is from the ’70s and makes me consider a tetanus booster just looking at it.  When John returned from the bathroom with Hank in tow, I put him in a regular chair.  Heck, why not! Maybe he will stay.  I was feeling adventurous. Well, the kid stayed…for quite a while, relatively speaking.  He tried to scam food off my plate and didn’t complain when I shut those efforts down.  I relented and gave him some Sprite instead of the supplement-laden drink that I had been pushing for much of the day.  After a bit, he got out of the chair with a sly look in my direction.  He didn’t run, didn’t even get beyond three feet from the chair.  I gave him a sly smile right back and patted the chair with an instruction to sit back down.  He did.  (He did!!)  We did this a few more times.  He responded quickly and appropriately every time with lots of eye contact (and obvious scheming going on behind those baby blues). We continued the game for a bit, with him sitting at the table for the majority of the time.  We all got to eat in peace.  The chase-after-Hank rotation was not necessary.  I wasn’t suddenly breaking out and itching in places that are inappropriate to scratch in the middle of a church fellowship hall.  It was awesome!  He did start testing the limits after a while.  I knew that he would soon be on the move when he started laying down on his back on the floor, dry humping the air and laughing like a hyena.  But, he was still playing the game with me during all that, he was still close to the chair, he was still looking me in the eye and waiting for some response from me.  Dry hump away, little buddy!!  I was so happy about his behavior that I didn’t care that he was crossing over into goofy land.  Heck, I decided to go with him.  I gave him a good tickling and gave him leave to run.  Someone followed him, and the rest of us remaining at the table marveled at how well he had done.   I left smiling and not scratching. I was tumbling this whole experience around in my mind last night while laying in bed, and I realized that there was a whole other expectations game to consider.  The game of low expectations.  Not giving my kid enough credit.  Not allowing him the chance to shine.  On a whim, I plopped his happy ass in a regular chair.  I didn’t confine him.  And, he made me proud.  I have to remember to give him a little more credit a little more often. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2009/12/high-chair3.jpg"], "link": "https://rebekahscot.wordpress.com/2009/12/16/further-on-the-subject-of-expectations/", "title": "A little credit, please…."},
{"date": "December 22, 2009", "body": "Christmas shopping for Hank was pretty depressing.  John and I found ourselves standing in the middle of Target with very puzzled looks on our faces, totally at a loss for what to get him.  I feel like the toys we buy for him are getting simpler and simpler every year.  It sucks to shop for my 4-year-old in the toddler aisle. We very briefly considered finding a huge cardboard box and filling it with hangers.  Then we discussed how someone really should come up with a hanger with flashing lights on it or one that played music. You see, about the only thing that Hank has been playing with for a while now is plastic coat hangers.  He freaking loves them.  He stacks them neatly.  He throws them around to form chaotic patterns.  He jumps up and down while holding them to his face so that they click against each other and hit against his belly.  He plays with them in the bathtub.  He sorts them by color on occasion.  Every now and then he will walk around carrying about 25 of them looped on his arms.  It’s bizarrely cute. The only other toys that interest him right now are super-stimtastic things that sing, dance or light up.  Being the holiday season, these things have come out of the woodwork.  Dancing Christmas trees,  singing snowmen, a reindeer in a rocking chair that plays “Grandma got run over by a reindeer”.  Ironically, it’s his grandma that has that last one. So, there we stood in Target, the emotional quagmire threatening to pull us under.  We took a moment to acknowledge how much the situation sucked and we moved on, determined to find something that would make our special kiddo happy.  And we did.  We hope.  Here’s what we got. A blow-up ball tent shaped like a car, a big fire truck with all sorts of buttons for noises and lights, a toy with gears that turn and…a singing Christmas tree.  Yes, it will be Christmas all year round in the Galt house!  At least until one of us cracks and buries the singing tree in the backyard or runs over it with the car. Joel would probably have been overjoyed to open a huge box of hangers, but we just couldn’t do that. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2009/12/singing-tree.gif", "https://rebekahscot.files.wordpress.com/2009/12/plastic_clothes_hangers.jpg"], "link": "https://rebekahscot.wordpress.com/2009/12/22/i-love-to-shop-but/", "title": "I love to shop, but…"},
{"date": "December 15, 2009", "body": "We all have expectations for how our lives will unfold, what our stories will be.  I am a smart person.  I graduated high school valedictorian and skated through college with relative ease.  I married a really smart guy with a sharp wit to match my own.  Naturally, I expected we would eventually hear the pitter patter of little genius feet…possibly the next Einstein or Salk.  Well, maybe not, but I expected some smart little rugrats. Now, I did have my fears.  My younger brother had leukemia at the age of 2 and was debilitated by a rare brain damaging side effect of his treatment.  He went into remission, but he was left developmentally and physically disabled.  Then at the age of 8, he developed a brain tumor and died despite several surgical interventions.  How did my parents deal with such grief and still maintain their marriage, their family, their faith?  THIS, I  did  fear.  This was real to me. What was entirely out of my reality? Of all the things that could happen to one of my children, what was the most far afield?  Out of sight.  Out of mind.  Didn’t even exist for me. AUTISM. Our daughter is everything that we expected.  Our son is something entirely different.  He is a mystery wrapped in an enigma.  He doesn’t conform to expectations.  He has autism. So, expectations change, right?  We roll with the punches.  We set new goals.  We develop a plan.  We will implement this diet, this protocol, these services.  Surely, everything will work out.  Surely, our son will be just fine, some semblance of normal, in a year or two.  Surely, he will be talking soon.  Maybe he will even lose the label.  These were our new expectations. Well, we were just a tad unrealistic.  Not that it doesn’t happen.  Some kids respond significantly, improve rapidly, find the elusive “WOW” factor.  However, it hasn’t happened for our beautiful boy.  There has been improvement, but it has been slow and plodding.  He is a tortoise in this race.  We can only hope for the same winning outcome. So, within the confines of our original expectations, birthdays only served to put a spotlight on our epic failure, increase our sense of doom.  The small progressive steps and gains couldn’t be fully appreciated because they didn’t measure up.  The tick, tick, tick of the passage of time became the soundtrack for our lives because he should be doing THIS by THIS age.  So said our expectations anyway. It’s damn depressing, this expectations paradigm.  This box so many parents close themselves up in.  It’s hard to avoid it, but it is soul crushing if you allow yourself to be trapped in it. For that reason (because I value my soul), I am DONE.  No more expectations for me….at least no more of those short-term, time-sensitive, soul-sucking black holes falsely labeled as hope.  We will continue to improve the life and health of our baby.  We will address his gut issues, his methylation deficiencies, his viral and bacterial load.  Inevitably, he will improve, it’s just not likely to be on any predetermined timeline.  I am determined to enjoy every incremental improvement, whether large or small, whether quickly gained or laboriously attained. We will maintain our hope for his future.  We will have faith in our efforts and the decisions we make.  We believe that he will talk.  That he will be happy and healthy.  That he will be okay.  These are my long-term expectations.  I am not putting a timeline on them, and these expectations are bound to be redefined and molded by the progress that he makes. Whatever happens, we love and treasure him, and we will love the person that he becomes.  That is an expectation that I don’t mind having. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2009/12/calendar.jpg"], "link": "https://rebekahscot.wordpress.com/2009/12/15/expectations/", "title": "Expectations"},
{"date": "December 30, 2009", "body": "I have pictures, but I can’t find the cord to connect the camera to the computer.  I will have to post them later. Christmas was nice…very nice. Hank loved his Christmas tree and the singing/hoof stomping horse that John found at the dollar store.  The bop bag was also a big hit.  He likes to lay on it, and he finds it pretty entertaining when other people hit it.  The gear toy is a bust.  He keeps taking the gears off and spreading them around the house.  He got Spongebob bedding from my mom and my sister, and his new Bobbed out bed got a big smile out of him. Dagney made out like a bandit.  Lots of art stuff (Grandmama put one heck of an art box together), clothes, games and a Wii.  John and I are also very much enjoying the Wii. (John and I had a very funny discussion on what a Wii Porn game would be like.  That was good for big laughs.) Hank has been entirely off his supplement regimen for the holiday.  By his own choice, not ours.  I can’t get a thing down him other than the supplements in liquid form.  He has actually been fairly calm as a result of not getting all those detox provoking supps.  He’s done some pretty interesting things as well.  I feel like I’m at a crossroads in a way with his treatment, but not really because I don’t feel like stopping the protocol is  a viable choice.  Possibly a bit of a slow down…possibly full speed ahead…a lot of it depends on him really.  We will see. Dagney has also been doing some interesting things.  It seems that she has decided to take more of an interest in being a big sister.  Dagney has complained about Hank a lot.  He breaks her stuff, makes messes in her room, generally gets in the way a lot, steals our attentions away from her.  I get it, but it hurts my heart to hear her say some things (even though much of it could fall under the category of normal brother/sister stuff, I suppose).  So, it has done my heart good to see her trying to interact with him more in the past week, following him around, playing in his room. She actually tried to get him in bed the other night.  John and I watched on the other side of the closed door as the light flicked on, then off, then back on.  We heard Hank laughing and Dagney trying to coax him to bed.  We peaked through the cracked door to see Dagney lightly body slamming Hank into his bed and then trudging back to turn the light off with an audible sigh.  It made my outside laugh and my inside hurt just a bit at the same time.  We praised her highly for the game effort then we all went back to playing Super Mario on the Wii. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2009/12/bob-bedding.jpg"], "link": "https://rebekahscot.wordpress.com/2009/12/30/holiday-this-n-that/", "title": "Holiday this-n-that…."},
{"date": "December 31, 2009", "body": "Do you ever wish your gift from God had come with a gift receipt? Discuss. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": [], "link": "https://rebekahscot.wordpress.com/2009/12/31/random-pondering/", "title": "Random pondering…"},
{"date": "January 6, 2010", "body": "One week ago… That’s how I feel.  Adrift.  Or, suspended in time.  My little family and myself, stuck in a bubble, in a state of suspended animation.  The world outside is flying by, or maybe it’s not.  Perhaps, the entire world has come to a screeching halt, and we are holding everything up.  Everyone is waiting for someone to make a decision…me, me and John, Dagney, Hank, the whole of us. More likely, it is only my small world that is in slow motion, caught in a looping pattern of indecision.  It would be infinitely helpful if I knew what in the hell I’m supposed to be deciding.  I feel restless.  I feel like I am on the cusp of…something…wonderful?…horrible?…a bounty of pleasure untold?…an infinite abyss from which I will never escape?…WHAT?? (I cast my vote for the 3rd one.  The bounty of pleasure untold.  Yeah, that would be nice.) Now… I started this post last week.  I still feel the same way, but the sharp restlessness has eased a bit.  There’s nothing like the holidays with the total lack of routine and schedule, the “It’s a New Year” phenomenon, and total inability to get away from your kids to knock you for a good loop-de-loop. In this instance, it has made me introspective.  I like and even love a lot of what I see at first inward glance.  Other aspects of myself, I actively dislike.  The singling out of the distasteful qualities doesn’t bother me.  It’s good to see them, slap a name tag on them, and recognize them for what they are.  What does bother me?  Ambivalence.  Looking at myself and not having any strong feelings one way or the other.  It leads to a chilling feeling of emptiness.  The feeling of being at a fork in the road of your life, but the paths are nondescript and devoid of road signs.  There is no single path more or less traveled, no spooky hollow, no light at the end of a dark road.  Just choices.  So, you pick one and trudge forward whilst doing your best Eeyore impersonation,  “Sigh… whatever…it doesn’t matter anyway.”  You eenie-meenie-miney-moe it because it’s that or just keep standing there.  No investment.  No passion.  Ambivalence. I don’t like it.  I don’t like it at all.  Feeling ambivalent about your life is like not living at all.  Like part of you is muted, the volume only on 3 when it should be cranked to 11.  So,  have I ever really lived?  Oh, yeah.  I’ve lived.  But, what I’m doing right now doesn’t feel like living, not wholly anyway.  I need to fix some things.  Improve myself.  Invest myself more.  But, should I do MORE?  Or, should I take what I’m doing now and do it BETTER?  I think I will start with the latter and aspire to the former. There.  I chose a path.  Feels good.  Hope I stick to it. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2009/12/adrift.jpg", "https://rebekahscot.files.wordpress.com/2010/01/eeyore1.jpg", "https://rebekahscot.files.wordpress.com/2010/01/adrift-again.jpg", "https://rebekahscot.files.wordpress.com/2010/01/eeyore11.jpg", "https://rebekahscot.files.wordpress.com/2010/01/two-paths.jpg"], "link": "https://rebekahscot.wordpress.com/2010/01/06/adrift/", "title": "Adrift…"},
{"date": "July 12, 2010", "body": "This little nugget of wisdomly wisdom came lilting from the backseat of my car one day. Me:   But, Dagney, you don’t even like pickles… Dagney:   **smiles in a way that conveys that I am somehow missing something**  Me:   Hmmm… w ell, I do like pickles.  And, you’re right, life’s definitely not all pickles and rainbows. This followed a conversation we had about Hank, autism, being different.  It made me wonder if she already realizes, just a little bit, how much Hank’s autism is bound to effect her life…how much it already has. I know that she loves her brother.  There have been times that I have wondered about her true feelings.  In my most pathetic moments, I have come right out and asked her, “You love your brother, right?”  She always answers in the affirmative.  However, it’s the unsolicited statements of love that are more convincing.  I got out of the shower one morning to find “I love Hank!” written in the steam on the mirror.  Other times, she will just blurt it out along with “I love mama!” and “I love daddy!”  She gets excited when Hank gives her a hug, which doesn’t happen very often.  It makes me sad and happy at the same time.  It’s an emotional limbo that I have become resigned to, if not comfortable in. I know that she longs for a normal sibling.  She wants another brother or sister.  One that will play with her.  I long for that for her, but it’s just not practical.  I only ever wanted two children.  But now…if I was a bit younger…if we were more financially set…if we had a bigger house…if, if, if…I would do my best to give her that normal sibling experience.  A little while back, I thought I was pregnant.  It turned out that I was not, and I mourned that little life that blipped in and out of existence, if only in my mind.  I mourned the loss of that chance for Dagney to have normal sibling interaction.  I regretted the loss of that chance for it to not all be on her small shoulders one day. She loves him.  Despite the fact that he raids her closet for her clothes hangers.  Despite the fact that he blows through her room like a miniature tornado.  Despite the fact that we don’t always get to go and do things that many families do with ease.  Despite the fact that she has to explain him to her friends.  Hopefully, her sibling experience will teach her so many of the good lessons in life…tolerance, understanding, hope, patience, humor, love.  I see all of these attributes blooming in her already.  Some of them more than others.  Hopefully, we can avoid the thorns and pitfalls…bitterness, jealousy, hate. “Life’s not all pickles and rainbows.” Maybe Hank is the pickle.  Maybe autism is the pickle.  Maybe it’s one of those sweet pickles, so that if you have to eat a pickle, it’s the best possible pickle.  Maybe I am giving her too much credit, and she was just talking nonsense to mess with me. Maybe I will have a turkey sandwich for lunch.  With pickles.  The sweet ones. \n \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/07/rainbow-too.jpg", "https://rebekahscot.files.wordpress.com/2010/07/pickles.jpg", "https://rebekahscot.files.wordpress.com/2010/07/rainbow-too.jpg"], "link": "https://rebekahscot.wordpress.com/2010/07/12/lifes-not-all-pickles-and-rainbows/", "title": "Life’s not all pickles and rainbows…"},
{"date": "July 12, 2010", "body": "I am changing all the names on here to make this sucker anonymous. Dagney is now the daughter.  Hank is the son.  John is the husband.  I shall remain myself since my name is in the URL. Big prizes to whomever comes up with the origin of the names…wanton sexual favors, 5000 points toward your biggest goal in life, whatever your wee heart desires… \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/07/istock_bag_over_head-63113356.jpg"], "link": "https://rebekahscot.wordpress.com/2010/07/12/its-all-about-the-mystery/", "title": "It’s all about the mystery…"},
{"date": "December 1, 2010", "body": "I have been doing a little bit if writing elsewhere. This is one of a few pieces that I contributed to a book that is being released in April 2010.  This is the unedited version…over 1000 words!!  I received a request from a lovely young lady to trim it down to 250 for the final submission to the publisher.  I managed to get it down to 399.  Yay me!! Dealing with autism is just plain hard, regardless of where your kid falls on the spectrum. The problems and needs vary according to each child, but it all boils down to one simple concept. Your kid is different. Describe them however you like: quirky, unique, special, extra-normal, hard-headed, beautiful, frustrating, wonderful. Describe autism however you like: a disease, a disorder, a genetic condition, a blessing, a curse, just a normal part of everyday life. Approach the treatment of autism however you like: Biomed, special diets, Applied Behavioral Analysis, occupational therapy, medications, no treatment at all. Despite the many ways that we as parents of autistic kids can differ, there is one way in which we will always be the same. Our kids are different, and that is just hard. The reality of our kids’ struggles is something that we face every single day, and it certainly takes a toll on the mind, heart and body. I have had some bad days, and, no doubt, I will have more. However, while I am certainly not reticent to air my emotional laundry, I do not want to do that right now or in this section of the book. I would rather write about a few important conclusions that I have come to as a result of my bad days…and my good days…and the space in between. Feel It Life’s many difficulties are bound to stir up all sorts of emotions, but I have found having a child with autism to be particularly emotionally confounding. There are so many instances in which you simultaneously feel completely opposing emotions. Joy and grief. Acceptance and anger. Guilt and absolution. Other times, one emotion, usually a bad one, is so all encompassing that you can physically feel it pressing in on you. During the good times, you can feel a high that no drug can induce. One thing that I know for certain, whatever you are feeling, it is completely normal. In my experience, it is best to let yourself feel all of them. Recognize them and sort them out into neat, little categories if you want to. My preferred labels are “totally awesome – enjoy it while it lasts” and “really sucky, but it’s just how I feel right now” and “totally counterproductive – stop right now.” Just feel it, whatever it is. If you try to ignore or shave the blunt edges off of anger, guilt, grief, it may retreat only to return later stronger and meaner for not having been recognized and dealt with in the first place. If you try to tamp down your joy because you think it will hurt that much more when a downward spiral hits, you are depriving yourself of the best moments in life. Ride the emotional roller coaster. If you are not constantly trying to get off the ride, you might find that the highs are more enjoyable and the lows are more tolerable. Share It All those feelings that you have? You don’t own the exclusive rights to them. Others are being knocked over by that very same emotional tsunami. Others share the same joys and heartaches. You may feel totally alone and cut off from the world, but, honestly, that is some pretty self-centered thinking. You’re not living in a vacuum in which you are the only one effected by your child’s diagnosis. Your spouse or partner, the person sleeping in the same bed with you every night, is struggling too. You need to share your feelings, communicate, confess your fears and bad thoughts to each other. Do not assume that he is doing just fine. Do not assume that you baring your soul will bring him down or increase his burden. There is no good reason for you to both seperately carry around the same weight. If you share it, it will lighten the load on both of you. Neither of you have to feel alone. I used the example of a spouse, but the “share it” rule applies to other family and friends. There are other people out there feeling the same way that you do. Find them and build a community for yourself in which you feel safe, in which you can share without being judged, in which you can give and receive support. The autism experience strips you of all pretense. You need to surround yourself with people who don’t mind you streaking around emotionally naked, the kind of honest folks who will likely strip down and run around with you. Those are the people that know, because they feel it too. Tell It There is a whole other sub-set of people in your life that you might not want to share it with, but you just might want to tell it to. The co-worker set, the lady at the bakery that knows your name because you come in too many mornings to tank up on coffee and donuts set, the Judgey McJudgerson in the grocery store set. I do not feel that it is my duty to inform the masses about autism, and I don’t necessarily work the big “A” into every casual conversation that I have. However, I find a certain comfort in talking about it. Some times, it is an effort to educate in general. Other times, it springs from a desire for people to know me and to know my child. I tell it in the hope that the next time that I am having a crap day, that person might just understand and give me a supportive smile…or that the next time Judgey McJudgerson sees a child acting oddly or tantruming in a store, she doesn’t turn up her haughty nose or scowl or say something demeaning to that parent because just maybe she understands that she can’t possibly know what that child and that parent are dealing with…or when my co-worker sees a child in her family that has issues, she recalls our conversation and gets earlier intervention for that child. I like to tell it, but that’s just me. Not everyone does, and that is just fine too. Screw It Some days just suck, for any variety of reasons. I won’t bother to give examples; you have already experienced them. Sometimes you just have to say screw it. Screw autism. Screw this day. Do whatever you have to do to release all the negative emotions. Cry it out. Break plates. Punch a pillow. Go outside and scream at the heavens. After that…screw it. You can’t let one bad day bleed into the next. If you let that happen, your life can turn into an endless succession of bad days, and you’re very likely to miss out on some of the good things. You have to let tomorrow be a new day with a clean slate. Confess It Here is where I confess something to you. I frequently really suck at following my own advice. There are many days in which positive, healthy coping just doesn’t happen. There are days when I want to hide and not face the world. There are days when I insist on keeping it all inside, even when I know that it is in there growing all sorts of nasty cooties and possibly tentacles. But, I have my box full of coping tools, and more often than not and in my own time, I manage to dig through it and find the tool that I need. ﻿ \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/12/wordy.jpg"], "link": "https://rebekahscot.wordpress.com/2010/12/01/while-i-havent-been-writing-here/", "title": "While I haven’t been writing here…"},
{"date": "July 22, 2010", "body": "pictures now…words later… \n \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/07/dsc04292.jpg", "https://rebekahscot.files.wordpress.com/2010/07/dsc04292.jpg", "https://rebekahscot.files.wordpress.com/2010/07/dsc04210.jpg", "https://rebekahscot.files.wordpress.com/2010/07/dsc04268.jpg", "https://rebekahscot.files.wordpress.com/2010/07/dsc04240.jpg", "https://rebekahscot.files.wordpress.com/2010/07/dsc04264.jpg", "https://rebekahscot.files.wordpress.com/2010/07/dsc04284.jpg", "https://rebekahscot.files.wordpress.com/2010/07/j-and-pirahnas.jpg", "https://rebekahscot.files.wordpress.com/2010/07/dsc04208.jpg", "https://rebekahscot.files.wordpress.com/2010/07/j2-touching-fish.jpg", "https://rebekahscot.files.wordpress.com/2010/07/j1-fish-background.jpg", "https://rebekahscot.files.wordpress.com/2010/07/dsc04289.jpg", "https://rebekahscot.files.wordpress.com/2010/07/j2-toward-ocean.jpg", "https://rebekahscot.files.wordpress.com/2010/07/dsc04277.jpg"], "link": "https://rebekahscot.wordpress.com/2010/07/22/vacation/", "title": "Vacation…"},
{"date": "July 29, 2010", "body": "If not for autism’s worrisome presence in my life, I’m pretty sure that I wouldn’t have one of these.  Sure, I might be occasionally stressed or worried, as a mom with two young kids, a full time job and a tight budget is wont to be.  But, I’m fairly certain that this little nuisance, my panic button, would not be my ever present companion. Some days, I forget that it’s even there.  It’s not as if life is perfect on those days.  Life just happens, and I deal with it, good or bad.  Shit might happen, but I’m able to shrug my shoulders and move on.  Or even better, shit might not happen, and all is good. Then there are the other days, the days when just dealing is not my forte.  The worst are the days that masquerade as the good, level, calm days, but then it hits the fan.  On those days, for whatever reason, I am vulnerable, and I don’t even realize it.  I get blindsided.  It can go something like this… I’m standing in the checkout line at the grocery store.  The 3-year-old in the cart in front of me is chattering away.  Geez, she’s practically reciting her doctoral thesis, and mom isn’t even paying attention.  I’m seeing the future of America here, folks, lucky freaking me!  Hank is almost 5, and he doesn’t say a single recognizable word.  Will he ever tell me he loves me?  Does he even understand when I say it to him?  I get a lump in my throat, a hollow ache in my chest.  I feel something under my foot, and I look down.  I’ve stepped on a panic button…damn it. \n Or… I read a Facebook status posted by a friend with an autistic child the same age as Hank.  Wow!  He is doing really great.  I am so happy for them!  Fully potty trained!  That is fantastic!  Yeah, that…is…great.  Will Hank ever be potty trained?  Will we still be changing his diapers when he is 14?  I push away from the computer, but it’s too late.  I have already hit the big, red panic key that I swear wasn’t on my keyboard just a few minutes ago.  That’s how it often goes.  My panic button is a stealthy little bastard.  I step on it.  I sit on it.  Sometimes a dirty look will set it off.  Some days it patiently follows me around until I acknowledge it’s presence, no subterfuge necessary.  Some days it’s almost comforting.  I will sit at my desk and tap-tap-tap a rhythm on it while all the awful doubts and scary questions scroll through my head like the opening credits of a Star Wars movie. Just a few days ago, I had a panic moment.  I’m not even sure what set me off, but I was reduced to a soggy, blubbering mess.  When I got home from work, John and Hank were out in the yard.  I watched as John gave Hank some directions.  They were the opposite of what Hank wanted to do, but he did it anyway.  Later, Hank wanted cookies that he thought were on top of the fridge.  I showed him a box mix for gluten-free cookies as a substitute, and he smiled and pushed the box to me in his way of saying, “Yes, I would like some cookies, please.  Thank you.”  He then waited patiently for the cookies to bake, although he did want to peak in the oven a couple of times.  He quit asking for the cookies on the fridge.  Later, we shared cookies.  In a moment when I wasn’t paying attention, he went to the kitchen and returned with two big handfuls of cookies.  He had a huge grin on his face because he knew he had gotten something past me.  He looked me right in the eye, and I could see the mischievous twinkle and the innate intelligence that resides there.    Then we played his new favorite game.  It involves him stealing something from right under my nose (which he is extremely good at) and then running away while laughing riotously and glancing back to see if I am giving chase, which I always am.  Much tickling ensues. That night, I was lying in bed enveloped in a rare sense of calm.  I imagined my panic button sitting on my bedside table, placed carefully behind the alarm clock so that I wouldn’t accidentally hit it instead of the snooze button.  I thought about my evening.  It had been so lovely.  I had seen something that had not been visible to me for the last six months.  I imagine that it was there all along in some degree, but I was incapable of seeing it. I saw progress.  Hank has made progress.  He is understanding so much more.  He is following directions.  He is looking us in the eye more often.  He is playing games with us.  He is interacting in more meaningful ways.  He is as cute and joyful as he has always been, and more so.  I saw what I needed to see that night.  And trust me, I really needed to see it.  It was like food for my soul. So, my kid has autism.  I have a panic button.  It is what it is.  It is my beautiful life. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/07/panic-button.jpg"], "link": "https://rebekahscot.wordpress.com/2010/07/29/panic-button/", "title": "Panic button…"},
{"date": "December 6, 2010", "body": "If only we were dealing with just one bad apple. If only… I’m noticing a trend.  One doesn’t have to be highly enlightened or even have above average observation skills to see it either.  It’s appallingly obvious. We autism parents deal with an inordinately high number of bad apples. Bad apples that do not listen, do not understand, do not empathize, do not sympathize, do not care, do not do their jobs well, do not have any manners, do not show any respect,  do not mean what they say, do not say what they mean, do not do what they say, do not say what they do.  Bad apples of all shapes and sizes.  Bad apples in abundance. It would be really nice if the bad apples could simply be plucked from the group and tossed to the side like so much garbage, allowed to decay out of sight and out of mind, leaving an open slot for a potentially good apple. Our current most egregious bad apple is the Special Education Coordinator for Hank’s school.  I call her Spitch.  I’m sure y’all are smart enough to guess the origins of that moniker.  She attends all of Hank’s IEP meetings, four so far this year.  She puts a big smile on her face and tells us how much she cares about Hank’s education.  I don’t believe a single word that spills out her bad-apple-piehole.  We asked for a very specific educational service at the beginning of the year, a service that everyone but her agrees is reasonable and necessary.  She has offered several alternative solutions that really are not solutions at all. I am tired of this game.  An entire half of a school year has passed already.  Too much time has been wasted, and I’m beginning to think that this was Spitch’s plan all along.  Stall, stall, stall…then the year will be over, and she will not have had to imperil her precious budget.  I totally fell into her trap, but I’m disentangling myself from her snares. I have to figure out a way around, over, through this bad apple.  I’m enjoying the visual of picking her up and tossing her aside, most likely into heavy traffic where her mealy apple bits get splattered far and wide…or, just dropping her to the bottom of an empty garbage can where she can rot all alone.  Can apples cry?  Okay, enough with my furtive imagination. I’m thinking and plotting.  This bad apple is going down, one way or another. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/12/bad-apples1.jpg", "https://rebekahscot.files.wordpress.com/2010/12/apple.jpg", "https://rebekahscot.files.wordpress.com/2010/12/bad-apples11.jpg"], "link": "https://rebekahscot.wordpress.com/2010/12/06/it-only-takes-one-bad-apple/", "title": "It only takes one bad apple…"},
{"date": "July 30, 2010", "body": "Me & John Dagney, Hank, a yellow pumpkin & a giant tadpole \n Our best family portrait ever \n My Dagney, she is a true artist. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/07/e-family-and-pumpkin.jpg", "https://rebekahscot.files.wordpress.com/2010/07/e-clay-mom-and-dad2.jpg", "https://rebekahscot.files.wordpress.com/2010/07/e-clay-mom-and-dad1.jpg", "https://rebekahscot.files.wordpress.com/2010/07/e-clay-jesse-and-joel.jpg", "https://rebekahscot.files.wordpress.com/2010/07/e-clay-family-2.jpg"], "link": "https://rebekahscot.wordpress.com/2010/07/30/us-in-clay/", "title": "Us, in clay…"},
{"date": "August 10, 2010", "body": "Click me legible cuteness. Courtesy of  Whiteboard Unicorns .  Go there.  Be entertained. \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/08/unicornsorting.jpg", "http://whiteboardunicorns.com/"], "link": "https://rebekahscot.wordpress.com/2010/08/10/other-things-to-entertain-you-on-the-internet/", "title": "Other things to entertain you on the internet…"},
{"date": "January 8, 2010", "body": "I love this. Brandi Carlile.   If there was no you . \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": [], "link": "https://rebekahscot.wordpress.com/2010/01/08/if-there-was-no-you/", "title": "If there was no you…"},
{"date": "January 14, 2010", "body": "\n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/01/picture-005.jpg", "https://rebekahscot.files.wordpress.com/2010/01/picture-004.jpg", "https://rebekahscot.files.wordpress.com/2010/01/picture-006.jpg"], "link": "https://rebekahscot.wordpress.com/2010/01/14/cutest-ever/", "title": "Cutest ever…"},
{"date": "January 11, 2010", "body": "Dagney:  Mom? Me: Yeah, sweetie. Dagney:  If Hank and I were both falling off of something high, who would you save? Me:  I would try to save you both. Dagney:  What if you couldn’t get both of us? Me:  I would grab the one closest to me.  The one I would be most likely able to save. Dagney:  What if we were the same distance from you? Me:  Then I could grab you both.  I have two arms! Dagney:  What if one of your arms disappeared? Me:  Then I would grab the one on the side I have an arm. Dagney:  What if we were both on that side?  laughing… Me:  Oh, good grief.  Go away.   smiling at my clever, although twisted, little offspring… \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/01/questions.jpg"], "link": "https://rebekahscot.wordpress.com/2010/01/11/questions/", "title": "Questions…"},
{"date": "January 13, 2010", "body": "No, not the legendary rock band that should have been long ago ensconced in the Rock and Roll Hall of Fame. A kiss…a sweet, innocent, oh-so-longed-for little smooch from my precious little boy. That is what I got last night.  It isn’t the first time Hank has kissed me.  He actually gives them rather freely upon request.  If he doesn’t offer full lips, he will offer an upturned cheek for me to smack.  For about a month a while back, I also got lots of tongue.  I didn’t request that, he just gave it.  He will also purse his lips and offer them up unsolicited when (a) he has done something wrong and been scolded and (b) he wants something that I have. But last night, I received the first ever not-a-bribe, not-a-beg-for-forgiveness, not-asked-for, not-initiated-by-me KISS.  Oh, yes.  It was the sweetest thing ever. Here’s how it happened. He was really tired.  I had gone outside, and I returned to find Hank wandering the house in search of me, big crocodile tears running down his cheeks.  His sad face is the best…many a young girl will fall prey to that face in the future.  He led me to Dagney’s bed and asked (in his way) me to lay down with him to watch Spongebob.  I laid on my side and he sat leaning against my stomach.  After a few calming moments filled with intermittent sniffles, he turned to me and leaned in for a smooch.  Just because he loves me. The funny thing is that I have longed for this exact thing the last week or so…sweet, unsolicited, simple affection.  When I lay in bed with him at night, I put my hand in a spot for him to conveniently hold it…just in case he decides he wants to.  Do you remember doing that on first dates?  Placing your hand just so to make it easily accessible?  It’s like that. *Dreamy sigh* He held my hand last night too. *insert smitten teenage girl giggle here* \n\t\t\tdiv.wpmrec2x{max-width:610px;}\n\t\t\tdiv.wpmrec2x div.u > div{float:left;margin-right:10px;}\n\t\t\tdiv.wpmrec2x div.u > div:nth-child(3n){margin-right:0px;}\n\t\t\t ", "outgoing_links": ["https://rebekahscot.files.wordpress.com/2010/01/kiss_concertlive.jpg"], "link": "https://rebekahscot.wordpress.com/2010/01/13/kiss/", "title": "Kiss…"}
]