[
{"date": "Saturday, November 9, 2013", "body": "\n \n \" When I was 5 years old,  \n \n my mother always told me that happiness  \n \n was the \nkey to life.  \n \n When I went to school,  \n \n they asked me what I wanted to be \nwhen I grew up.  \n \n I wrote down ‘happy’.  \n \n They told me I didn’t understand \nthe assignment,  \n \n and I told them they didn’t understand life.”\n   \n \n  ―\n     John Lennon \n \n \n \nI always said that when I had children that I wanted them to be happy. I didn't care if they were trash collectors as long as they at the end of the day they could honestly say they were happy. By no means does this mean I do not or will not encourage them to reach their full potential. I will not, however, force them to do things just because they look good to other people.  Forcing kids to do something because you feel it makes you look like a good parent, to me, is kind of the opposite of a good parent. I'm not talking about making them eat vegetables or go to sleep early, the daily nitty gritty of parenting. I am not talking about making a commitment and then walking away when they change their mind. I'm referring to letting a child find out who they really are without undue pressure to be daddy's football player or mommy's ballerina.  Sometimes, a child's interest is very different than a parent's dream of what their child would be like when they were born. And sometimes you have a child who is not a child you ever imagined when you decided to become a parent. \n \n \n \n6 years ago today, Boy Wonder was diagnosed with severe autism. It was devastating and life changing. I felt then, and sometimes still do, feel ill equipped and vastly under qualified to parent  a child with a disability. But BW has taught me so much. He turned the world right side up. He made me more patient (mostly), far far less judgemental and he showed me that proving people wrong is really really fun.  \n \n \n \nI may doubt my ability to make the right choices for him when he can't tell me what he wants or why he is upset but I do know for the most part that my boy is a happy kid. So while we may have a bunch of IEP goals unmet and life skills we have been working on for years at home, I do know that my biggest goal for my son is met daily, he is HAPPY and in the end that's all I ever really want for him and his sisters.   \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://www.goodreads.com/author/show/19968.John_Lennon", "http://4.bp.blogspot.com/-3lSOqVcPM20/Un5TMuYO0vI/AAAAAAAAAgg/h2c9QsoYB5Q/s1600/photo-68.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2013/11/the-goal-is-happy.html", "title": "\nThe Goal is Happy\n"},
{"date": "Friday, October 4, 2013", "body": "\n \nEight years of \n \n \n \nlove and joy \n \n \n \nsmiles and giggles \n \n \n \ntears and struggles \n \n \n \nlate nights and early mornings \n \n \n \nlearning and growing \n \n \n \nturning nevers and can'ts into yes he can \n \n \n \ninspiring and silly \n \n \n \nmiracles so very many miracles  \n \n \n \nand a whispery deep little voice that says, \n \n \n \n\"I love you to you\" \n \n \n \nHappy 8th Birthday to the Guy who stole my heart! \n \n \n \nYou are love personified. \n \n \n \n \n \n  \n \n \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-EOxBNsT3zt8/Uk7JVqZYvNI/AAAAAAAAAgA/XM9-RkUbHt8/s1600/IMG_3849.PNG"], "link": "http://theadventuresofboywonder.blogspot.com/2013/10/eight-years.html", "title": "\nEight Years\n"},
{"date": "Wednesday, February 5, 2014", "body": "\nIn October of 2010, I wrote about autism being the  invisible disability .  I wrote about how our children have no physical markers that signal to the world the way their brains are just wired differently. While autism awareness is more widespread today (since I wrote the original post the statistics for autism have shockingly gone from 1 in 110 to 1 in 50), the supports and services our children need are still hard fought for and sometimes denied. Services vary greatly from school district to school district and state to state. Some of us desperately need these supports for our children. It is the only way they can thrive and reach their full potential. Sometimes, it's the only way to keep them and other family members safe. We would like our children to be in the news for positive things. Not because they wandered away like  Avonte Oquendo , where the school personnel failed to keep him safe.  Or the parents who murder their children because they see no other way out after being denied help and services time and time again. ( I absolutely do not condone murdering your child which is why there are no links to media stories. )  \n \nSo we as the parents are invisible until something horrific happens to one of our children.  Then the media and the public pay attention.  Then there is judgment, public outcries for justice and finger pointing. How much suffering and how many tragedies could be avoided if the people and system who are designed to help children like ours actually worked? What if, instead of judging us after the tragedy, you put your hand out and helped to prevent the tragedy. Society is reciprocal. At some point all of us will need help from one another.  No one's life is free from difficulties. \n \nIf you are the friend of someone with a special needs child, you offering to watch the child for an hour, bringing a meal, calling with a funny joke or just being a shoulder to cry on could make a big difference. I am fortunate that I have a strong support system in place. Some friends with typical kids and a wonderful network of special needs moms and dads who will come if I call and say for today I can not face this alone. I, in turn, have the same offer on stand by for them as well. \n \nThe tragedies need to stop. They can be stopped with support, love and compassion.  The autism rate has soared in the 6 years since Boy Wonder's diagnosis.  Autism crosses every race, religion and socioeconomic barrier. It does not and will not discriminate. We could be you some day and we will be here for you. \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://www.nytimes.com/2014/01/26/nyregion/an-outpouring-of-support-as-avonte-oquendo-is-laid-to-rest.html", "http://4.bp.blogspot.com/-cRTo4GZlWhY/UvKGNlkS_NI/AAAAAAAAAhQ/N4lexUTLgUg/s1600/1891207_10151913583262555_1878512126_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2014/02/invisible-again.html", "title": "\nInvisible Again\n"},
{"date": "Friday, January 31, 2014", "body": "\nI always talk about how we waited for Boy Wonder to talk. Getting him to talk was difficult and mostly him just repeating back what was said to him.  His progress over the last two years regarding speech has been phenomenal. The little boy we were told would never communicate can talk . Is it conversational? Well no but he can tell us what he wants. He can say hi to people. In fact, it's one of his favorite things to do. \n \nEvery morning, I hear him fling his bedroom door open and he comes running down the hall. He bursts into my room and jumps in my bed with me. He presses his forehead against mine and says, \"Hi!\" and that is the very best way to start my day. Now if I could just get him to bring me coffee in bed. A girl can dream, can't she? \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-kXsfkILO5fw/UuumNDfiP1I/AAAAAAAAAhA/26but4Ow0Xk/s1600/1619469_10151902593507555_960912009_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2014/01/hi.html", "title": "\nHi\n"},
{"date": "Tuesday, August 6, 2013", "body": "\nWhen Boy Wonder was diagnosed with Classic Autism just under 4 years ago, the rate was 1 in 150 kids had autism. Then it was 1 in 110 kids. The current rate is believed to be anywhere between 1 in 88 or 1 in 50 kids have some type of Autism Spectrum Disorder.  We are your \"But for the Grace of God\" story.   \n \nWe hear what you say about our kids. We hear what you say when we aren't there to listen when you speak about our kids. And it always eventually gets back to us what you say when we aren't there. To your kids, \" Be nice to Johnny. He has special needs\" in your Florence Nightingale voice yet then you complain that your kids were placed in the inclusive classroom with our kids. \n \nYou complain about what it costs to educate our kids out of one side of your mouth while looking at us with eyes full of pity while rubbing our arm and asking in your most sorrowful voice,\"How's Sally doing?\".  Then you stand up at a Board of Education meeting and ask if (insert extracurricular activity of your choice here) was cut because of what it costs to educate those special needs kids and furthermore, that our kids are holding your kids back academically. \n \nWe hear you and we see you. More importantly, your kids see you. They see your hypocrisy and your double standards. \n \nI'll let you in on a little secret. I'm no saint. I didn't chose to adopt a special needs child. Most of those who have kids with special needs didn't chose this path. It was thrust upon us by some random act of God, genetics or luck of the draw. I know I checked off the smart and perfect child who will never give me a moment's worry. He or she would grow up, go to college,  and have a happy, successful and independent life.  \n \nLet me ask you a question. How would you feel if I said well since my kid can't participate in (insert extracurricular activity of your choice here) I'd like it removed from the school. It's not fair to have (insert extracurricular activity of your choice here) since my kid can't and most likely will never participate. That's not fair now is it? \n \nFederal Law protects Boy Wonder. It mandates that he is given a Free Appropriate Public Education. Your child is also entitled to a Free Appropriate Public Education. \n \nSo what does your child really learn by having children like ours in their classrooms? Hopefully, they are learning empathy, compassion and an appreciation for other people's differences. They are learning tolerance and acceptance. Aren't these all things that will serve your kids well when they are adults? Yet you want to take that away from them. I bet you think you are all these things but you're not. Your words and deeds have proved otherwise, yet it's not too late for you to change and be a positive example for your kids. Autism and other developmental and learning disabilities are NOT contagious but bigotry, ignorance and intolerance are very contagious.  \n \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-f9y2BjeOxGI/UgF7s3hnSPI/AAAAAAAAAfc/6ygGiIq7kJo/s1600/photo-67.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2013/08/but-for-grace-of-god.html", "title": "\nBut for the Grace of God\n"},
{"date": "Wednesday, March 20, 2013", "body": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nMy oh my how we have changed over the last 5 years. From helpless baby to a strong, independent, funny, smart, loving, compassionate, so gorgeous you take my breath away girl. You are.........  \n \n \n Glittering  \n \n \n \n \n \n \n            Glowing \n \n \n \n \n \n \n \n \n \n \n \nGregarious \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nGorgeous \n \n \n \n \n \n \n \n \n \n \n \nFive \n \n \n \n \n \n \n \n \n \n \n \n \nHappy Fifth Birthday Diva!  \n \nMay you always be as happy as you are today! \n \nWe love you!! \n \n So here's to a child \n who is joyful and clever. \n \n Happy Day. Happy Year. \n  Happy Always and Ever. \n \n ~Happy Birthday Little Pookie \n Sandra Boynton    \n \n \n \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-fk6LpOsYfdI/UUjPURfZgkI/AAAAAAAAAdM/OnSLbXn9N-Y/s1600/photo-5.PNG", "http://3.bp.blogspot.com/-Eoi7CB3qVo0/UUjPTkjh50I/AAAAAAAAAdE/I8ni66ebFOY/s1600/309_21305262554_6894_n.jpg", "http://3.bp.blogspot.com/-sb98zmJsD3Q/UUjPTrCmSBI/AAAAAAAAAdI/QAnPxY2xguk/s1600/3096_68911237554_2420994_n.jpg", "http://3.bp.blogspot.com/-RJeVLrdH-NA/UUjPTXZdtMI/AAAAAAAAAdQ/tzAr-nXwu8M/s1600/201909_10150149114862555_2522628_o.jpg", "http://1.bp.blogspot.com/-rT07yacRLL4/UUmpWEBD9pI/AAAAAAAAAeI/rGZkfKTpJww/s1600/IMG_4216.JPG", "http://4.bp.blogspot.com/-W3Xk-09kjVQ/UUjbRgL_5XI/AAAAAAAAAd4/w1Qr5nymT8s/s1600/photo-6.PNG"], "link": "http://theadventuresofboywonder.blogspot.com/2013/03/glittering-glowing-gregarious-gorgeous.html", "title": "\nGlittering Glowing Gregarious Gorgeous Five\n"},
{"date": "Tuesday, August 20, 2013", "body": "\n \n \n \n \n \nYes I am running again this year with  Team Up with Autism Speaks  in the  Allstate Boston Half .  I've been asked when I'll stop running but I don't plan on stopping. Boy Wonder will always have autism. His sisters will always have a brother with autism.  I don't run for a cure. We are long past the stage where I use words like cure or recovery. Boy Wonder has autism. He is profoundly needs life time care autistic. \n \nSo why do I keep running? Why do I stand up at Board of Ed meetings and say no this isn't right? Because my little boy's life still has potential, meaning and value. He has taught me what unconditional love for your child means. He taught me the joy is in the small moments of achievements. That the nots and the nevers aren't necessarily true. \n \nI run because more children will be diagnosed this year with autism than with any other type of lifelong disability. When Boy Wonder was diagnosed 6 long/short, all mixed together years ago, the rate was 1 in 150. The rate now is closer to 1 in 50. I wonder what it will be if I/We don't do something now when Diva and Sweet Baby Girl are thinking about having children. \n \nI run for the special educators who love our kids, for the services Boy Wonder will need when he ages out of the education system because the waiting lists for those services are endless, I run to know why my boy has autism so his sisters can make their choices with more knowledge than I did. I run for his sisters (and all the other siblings) who love their brother and know how to make him laugh and smile despite being only three and five years of age.  \n \nI run because I can because there's nothing I wouldn't do for my three babies.  \n \n \n Cause we are \n We are shining stars\n We are invincible\n We are who we are\n On our darkest day\n When we're miles away\n So we'll come\n We will find our way home\n If you're lost and alone\n \n Or you're sinking like a stone\n Carry on\n May your past be the sound\n Of your feet upon the ground\n Carry on  \n \n \n \n Carry on by Fun  \n \n \n \n Ed's Note: You can click the Team Up with Autism Speaks to donate or you can click the Allstate Boston Half to register to run.  \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-LHO5ChP_EQ8/UhO4R9Ll1oI/AAAAAAAAAfs/JjDWnmt4Umw/s1600/1094964_10151560164117555_792346585_n.jpg", "http://events.autismspeaks.org/faf/donorReg/donorPledge.asp?ievent=1055963&lis=1&kntae1055963=1299FD584410414593CBD86179025662&supId=377201028", "http://www.131marathon.com/boston/"], "link": "http://theadventuresofboywonder.blogspot.com/2013/08/run-run-and-run-on.html", "title": "\nRun, Run, and Run On\n"},
{"date": "Wednesday, December 26, 2012", "body": "\n \n \nBecause sometimes the unexpected gifts are the things you never planned on but love the most. \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2012/12/unexpected-gift.html", "title": "\nUnexpected Gift\n"},
{"date": "Wednesday, January 22, 2014", "body": "\nYay There's No School (Xanax Time) \n \nNo You Can't Wear Shorts with Your Snow Boots (Put On Your Damn Snow Pants) \n \nI've Got My Snow Pants On! (Mommy I Have To Pee) \n \nSnow Boots On the Wrong Feet (Accident Waiting to Happen) \n \n30 Minutes to Get Dressed (5 Minutes Outside) \n \nDelayed Opening Would Have Worked (Superintendent's A Moron)  \n \nWe Only Throw Snowballs at Daddy (Mommy Will Kick Your Butt) \n \nMake Us Hot Chocolate (So We Can Dump It In the Garbage) \n \nMommy's Our Short Order Cook (Look At Our Maid Cook) \n \nI Need Dora's Map (Looking for My Sanity) \n \nI Saw Mommy Kissing the Bus Driver (Day after Snow Day) \n \n4  PM is the New Bedtime (Benadryl Darts) \n \nI Love My Kids (Especially When They Are At School) \n \nHumor is the only way to stay sane when you've had way more time with your kids than you should have had since mid-December. Now if you'll excuse me I'm going to go make a drink. It's 5 o'clock somewhere. \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-xNNmzarPHSM/UuAF20BCkHI/AAAAAAAAAgw/8GfRjj9xT3c/s1600/image.jpeg"], "link": "http://theadventuresofboywonder.blogspot.com/2014/01/snow-day-playlist-where-is-summer.html", "title": "\nSnow Day Playlist (Where is Summer?)\n"},
{"date": "Monday, March 25, 2013", "body": "\nWe don't often get to do things without a schedule or taking into consideration what Boy Wonder likes or will tolerate. The girlies are far too often asked to put what they want aside for their brother. Is it fair? Well no but there's a difference between fair and right. Sometimes they aren't necessarily the same thing. Last week I took the girls for their birthday pictures. Yes one of them was three months late but that's how we roll. So after the pictures, we headed to the mall to see the Easter Bunny. We've been trying to talk Sweet Baby Girl into her first haircut for months. She had up until that day that she \"no needed my hair cut you silly Mommy. Haircuts are for boys.\" Well she said in the car, \"I want my hair cut. Just a little. Like Diva gets.\" So I decided I'd let the housework and all the other things on the agenda for that day slide. They rarely get to pick how the day goes so off we went. First we rode the elevator (a few times cause hey we could) instead of BW's beloved escalator. Then someone was ready to be a big girl with Bunndee peeking out from under the cape for moral support. \n \n \n \n \n \n \n \n \nThen they decide it was time for the Easter Bunny. He never knew what hit him. \n \n \n \n \n \n \n \nThen we may or may not have have a Crumbs Cake Push Pop for lunch by the fountain. \n \n \n \n \n \n \n \nOh and in case you were wondering, Diva doesn't live here any longer but Cheddar the Bunny now lives here. \n \n \n \n \n \n \n \n \nAnd then they were ready to go home. They had fun. As I tucked them into bed that night, Diva whispered in my ear,\"Funnest Day EVER!!!\" And it was for them and for me.  \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-d_5Cwnal9mA/UVBF5P1XT7I/AAAAAAAAAeY/V-LKskzK_qw/s1600/photo-65.JPG", "http://4.bp.blogspot.com/-aS5VA-nI_k4/UVBGAtgRppI/AAAAAAAAAew/W-5s7QM7-Js/s1600/photo-63.JPG", "http://4.bp.blogspot.com/-0PEo99GwBLM/UVBGAbMDkrI/AAAAAAAAAes/TD7wRAMjkFc/s1600/photo-62.JPG", "http://3.bp.blogspot.com/-z8cAc6He8jU/UVBGArY4-jI/AAAAAAAAAe0/EfPrRPUp09A/s1600/photo-64.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2013/03/the-typical-not-so-typical-day.html", "title": "\nThe Typical Not So Typical Day\n"},
{"date": "Monday, July 15, 2013", "body": "\n \nI wouldn't want this for you..... \n \n \n \nthe sleepless nights \n \n \n \nthe endless toilet training  \n \n \n \nor  \n \n \n \nthe Code Brown that goes along with it \n \n \n \nthe physical, emotional and financial toll it painfully exacts daily \n \n \n \nthe worry of what happens when we are gone \n \n \n \nthe worry of what someone may do to him without us knowing  \n \n \n \nthe effect on his sisters \n \n \n \nthe epic crying tantrums \n \n \n \nand the guessing why that goes along with those tantrums \n \n \n \nthe hours of endless screaming vocal stimming   \n \n \n \nthe stares and the judgments that go along with those stares. \n \n \n \nthe battles with the school districts. \n \n \n \nI will unselfishly keep all these to myself. \n \n \n \nI would want  for you..... \n \n \n \nthe wonder of small miracles \n \n \n \nthe belief that he can do so much more than we are told \n \n \n \nand  \n \n \n \nthat he is in there with so much to offer \n \n \n \nthe big belly laughs  \n \n \n \nthe whispered halting I love yous and pick me ups \n \n \n \nthe unexpected oven mitt to the head informing the world his pizza is ready \n \n \n \nhis forehead pressed to mine and saying hi  \n \n \n \nthe absolutely adorable way he chews gum \n \n \n \nhis sweet sleeping face when I find him all wrapped up like a mummy in his sheets \n \n \n \nThose I will so selfishly keep for myself. \n \n \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-2PcoLYActhU/UeQ-gLqhdhI/AAAAAAAAAfM/-TSH2aH17nk/s1600/photo-66.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2013/07/i-wouldnt-want-this-for-you.html", "title": "\nI Wouldn't Want  This For You\n"},
{"date": "Friday, December 7, 2012", "body": "\n \nYou would like your daughter(s) to be: \n \n \n \nfinancially independent \n \n \n \nand better yet, \n \n \n \nemotionally independent. \n \n \n \nCaring. \n \n \n \nCompassionate. \n \n \n \nLoving.  \n \n \n \nSelf accepting of their flaws AND \n \n \n \ntheir beauty. \n \n \n \nTry new things. \n \n \n \nFail or succeed but \n \nalways get back up.  \n \n \n \nShine brightly. \n \n \n \nBe proud of your differences \n \n \n \nand \n \n \n \naccepting of others' differences.  \n \n \n \nLook for the humor in life. \n \n \n \nDon't hold a grudge. \n \n \n \nForgive. \n \n \n \nApologize when you are wrong.   \n \n \n \nKnow when to fight  \n \n \n \nAnd when to walk away.  \n \n \n \nSpeak up for those who can not do so for themselves.  \n \n \n \nLet go of the past. \n \n \n \nEnjoy the present. \n \n \n \nLook forward to the future. \n \n \n \nKnow that things change  \n \n \n \nslowly \n \n \n \nand/or \n \n \n \ninstantly. \n \n \n \nSet the example for the woman you would like your daughters to be and your sons to marry. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-aXxfKxFbsK4/UMI7eT13bUI/AAAAAAAAAao/3Mqv-hayzNM/s1600/photo-55.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/12/be-woman.html", "title": "\nBe The Woman......\n"},
{"date": "Thursday, December 13, 2012", "body": "\n I had to bring Boy Wonder with me when I took the girls to school this morning. As we were walking out of Diva's class, another mom was walking her little girl inside. She had a Dunkin' Donuts bag in her hand. Boy Wonder loves him some munchkins. It was one of his first words. Mr. Eagle Eye can spot a bag or box of munchkins quicker than I don't know what.  Boy Wonder spied the Dunkin' Donuts bag in her hand and tried to take it out of her hand and then I said,\" I'm sorry. He has autism.\" and it sounded to me like I was apologizing for his autism.  \n \n I can't and won't apologize for his autism.  I correct his bad behavior just as I do his sisters' bad behavior but he is who he is. His autism is so deeply embedded in him that there is no separation. There is no line to see who he'd be without his autism. I can not apologize for who Boy Wonder is and then expect people to accept him for who he is.  \n \n Because Boy Wonder is a smart, funny, joyful, happy loving brown eyed snuggly boy who happens to have autism. No apologies necessary.   \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-Gy8e558TGHU/UMo4ietP_8I/AAAAAAAAAbA/N8jh4liEXZA/s1600/60535_10151134684027555_273370585_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/12/no-more-apologies.html", "title": "\nNo More Apologies\n"},
{"date": "Wednesday, March 28, 2012", "body": "\nCue smarmy informercial voice........ \n \nHave whiny kids???? Teenagers that talk back?  A spouse that talks to hear themselves talk and says random stupid offensive crap???? A friend who is all me me me all the time???  In laws who don't think you're raising your kids right? A boss that talks over you in meetings and takes credit for your work??? A Special Education Director that violates FAPE every time they open their mouth??? That know-it-all elderly person who tells you should give your kid a good smack???? Ever wish you could just tape their mouth shut well now you can!!!!..... Introducing STFU tape.... \n \n For just $9.95 plus shipping & handling and you'll never have to listen to whining or stupidity again. Simply peel off the appropriate length of STFU TAPE  and place it over the morons mouth and PRESTO. Silence!!!  I'm from Jersey so I'm not stupid enough to double this offer. But I do have a celebrity endorser. \n \n \nCall 888-STFU-NOW to place your order. Enjoy your moron free day!!!\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-oB5jpxjjOtA/T3MTTA7QUNI/AAAAAAAAAL8/VBzD3QJfLU0/s1600/photo-1.jpg", "http://2.bp.blogspot.com/-V2CDvu6VOik/T3MUPkEnMfI/AAAAAAAAAME/TKFvUP_kEIk/s1600/photo-2.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/03/stfu-tape-jersey-informercial.html", "title": "\nSTFU TAPE a  Jersey Informercial\n"},
{"date": "Friday, December 21, 2012", "body": "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nThe misconceptions this week have been horrifying.   \n \nAutism does not equal evil.   \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-EYZDFwmORUQ/UNUbgRrekzI/AAAAAAAAAbo/U5KrEREojxo/s1600/Slide1.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/12/thisisautism.html", "title": "\n#ThisisAutism\n"},
{"date": "Sunday, March 3, 2013", "body": "\n \n \n \n \n \n \n \n \nAnd 5 years ago when Boy Wonder was just two years old we started on the never ending toilet training road. We stumbled. We learned how to clean things. Boy Wonder learned that we knew he could do it so if he messed up, he'd be cleaning it up.  Consequences, praise, incentives, positive practice, regression and progress we've been through it all.  We decided this would be the one fight we'd never give up on. So much of his independence depends on this one life skill. And just when we were thinking when will this skill be attained, it clicked and Boy Wonder started taking himself without prompting on a consistent and regular basis. \n \nSo good things come to those who persevere. The wait and the hard work were worth it. Sometimes the long and meandering road is hard and lonely but in the end if it gets you were you need to be and you know that all your patience, hard work and love has paid off. And knowing that makes you more patient and willing to wait for the good things that come from those you love. \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-SM7Rgh5qNzI/UTQWc8EYQpI/AAAAAAAAAcM/olXGVvmOf_c/s1600/photo-4.PNG"], "link": "http://theadventuresofboywonder.blogspot.com/2013/03/patience.html", "title": "\nPatience\n"},
{"date": "Tuesday, March 27, 2012", "body": "\nMaybe we will never dance together at his wedding, \n \nBut every morning, Boy Wonder comes up to me in the kitchen \n \nAnd says in his halting soft spoken way, \n \n\"Mommy.... I.... want.....dance.....please.\"  \n \nAnd so I spin my sweet boy until he's had enough.  \n \nAnd he squeezes me tight and runs away giggling. \n \n I will take that sweet moment with my boy everyday.  \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-yoxmCrX2xjY/T3HAUfSATsI/AAAAAAAAAL0/53S9Wquoz6A/s1600/photo.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/03/dancing.html", "title": "\nDancing\n"},
{"date": "Saturday, March 9, 2013", "body": "\nHow was your day? You ask your kids, your spouse or significant other (if you have one). You ask a friend or a loved one who you know has something either wonderful or difficult going on.  \n \nIf you have typical kids, you know the details don't come all at once. The highs and lows, the nitty gritty details come out over the course of dinner, bath time and bed time. They let the little things and big things out.  We learned a new song, Mommy.  I have a new friend. George has a new baby brother. I cried because someone was mean to me. I got a time out for not listening. I didn't like my lunch.  And so on and so forth. The details come out, so you get to know what they did and how they were while not being with you .  \n \nI have never hid the fact that we swim in the murky deep end of the autism pool. Boy Wonder is not able to tell me how his day was, good or bad, what he did or what he learned. I can only know from what I observe of his mood, his behaviors and what ever it is he chooses to show me he has learned because the language and ability to communicate at that level is simply not there at this time. For the boy, we were told would never be able to talk; not even able to communicate the want of drink or food or to ask to use the bathroom who can now do all of these things, I do believe it is wholly possible that some day he will be able to tell me about his day. \n \nSo that's why when the yellow bus doors swing open every afternoon and I see my gorgeous boy's big smiling face I ask him, \"How was your day, handsome? \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-_jLWJ9uaO-E/UTv9sTVfoEI/AAAAAAAAAcg/2JZ037roefk/s1600/IMG_5029.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2013/03/how-was-your-day.html", "title": "\nHow Was Your Day?\n"},
{"date": "Saturday, October 1, 2011", "body": "\nThe DIVA asks............ \n \n \nMommy, why does he yell AAAHHHHHHHHHHHH? \n \nMommy, why won't he use his words? \n \nMommy, why does he bite his hand? \n \nMommy, why does he cry so hard? \n \nMommy, why does he rip up your books? \n \nMommy, why does he run in circles? \n \nMommy, why won't he play with me? \n \nMommy, why is he scared of the worm on the Wonder Pets?  \n \nMommy, why won't he keep his clothes on? \n \nBoy Wonder has Autism, DIVA. He can't help it. He's trying really hard. \n \nMommy, why does he have that? \n \nI don't know, DIVA. He just does.   \n \nMommy, why don't you make him better? \n \nI'm trying, DIVA. \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/10/why-mommy.html", "title": "\nWhy Mommy?\n"},
{"date": "Tuesday, September 27, 2011", "body": "\n It's not the load that breaks you down, it's the way you carry it.  ~Lena Horne \n I sit and watch THE DIVA figure things out. She wants to do everything herself. She gets mad if she can't figure it out. She gets mad if she can't something to do exactly what she wants. She gets fiercely mad. (I wonder where she gets that from?? Shut up) And she is so proud of herself when it all works out to her DIVA satisfaction.  But the one thing she, 9 times out of 10, will refuse to say is, \"Can you help me?\"   I know exactly whom she gets that lovely trait from. I'm a do it myself girl. I hate hate asking for help. Relying on other people? No thanks.  \n Oh but the Boy Wonder has taught me, I must ask for help. I can not do this alone. It has gotten easier not quite 4 years in to ask for help for him.  \n And now almost 4 years in, I am learning to ask for help for me.  From the Mamas . From a few other very special people. \n If you're just starting out on this road, ask for help. Take help that's offered. If not for you, do it for your kids. In watching THE DIVA struggle and refusing to ask for help, I've learned I need to ask so she can learn to ask for help.  \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-LJHZPgN6jHU/ToHNy_nnJzI/AAAAAAAAAE0/5aT-RAbdfSc/s1600/barbiediva.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/09/four-hardest-words.html", "title": "\nThe Four Hardest Words\n"},
{"date": "Tuesday, September 13, 2011", "body": "\n So D, the BFF, invites me and two other chickies over on Saturday night. I always forget about Dirty Dirty Dander Cat, hereafter known as DDDC. I show up around 7:30. So we are chatting (discussing kids), laughing (mocking husbands) giggling, (mocking each other) and my eye starts to itch. Me thinking its my contact goes in the bathroom and fools around with it. I then remember DDDC. Idiot me is sitting on the couch that DDDC loves to lounge on. We are all now umm tipsy and laughing at me. M. and C. decide it's time for pretty pretty picture time, which how  I wound up with this picture. \n \n \n \n \nSo I decide to go home and scare the crap out of Big Daddy because hey I think it's funny and I know it will be gone by morning. So he's all like \"EEEWWWW WTF?? Did you get in a fight?\" and I'm like, \"yes we had jello wrestling and I got an elbow to the eye! NOT the DDDC got me!\"  Except my eye isn't any better so off to the ER. In which, once I'm assured I don't have a scratched cornea, I start laughing and texting D., C., and M. that I'm in the ER and that  DDDC is going to get the chicken.   Meanwhile I'm sure the good doctor is thinking of calling for a psych eval and I'm thinking if I go all Britney on him it'll be like a vacation!!! \n \nBut he didn't so I went home and sent this to D., C. and M. and especially DDDC just so they'd know I meant business. \n \n \nMy eye is fine. Eyedrops and glasses for a few days and good as new. So umm if you don't want me to come over D. can rent you, DDDC for a nominal fee. \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-F5XmXe0dhQk/Tm-fXn4T1sI/AAAAAAAAAEk/epsOVIcqLfc/s1600/cateye.jpg", "http://thebloggess.com/2011/07/knock-knock-motherfucker-giant-metal-chickens-revisited/", "http://4.bp.blogspot.com/-PbaCxKykDgk/Tm-jIOcZ2EI/AAAAAAAAAEo/MmE5MZXjh3g/s1600/peckyoureyeout.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/09/girls-night-in-or-beware-dirty-dirty.html", "title": "\nGirl's Night In Or Beware Dirty Dirty Dander Cat or It's Not All Autism All the Time\n"},
{"date": "Wednesday, September 14, 2011", "body": "\n Ed Note: This was originally posted elsewhere back in July 2010. I had a request to put it out here on our new home. I've only updated the picture.  \n \n I can’t. \n I can. \n He’ll always need care and supervision. \n He’ll outgrow his diagnosis. \n I knows what’s best. \n I have no clue. \n We’ll have a conversation. \n We won’t have a conversation. \n I’ll know what he’s feeling. \n I’ll never know what he’s feeling. \n I’m not cut out for this life. \n I’m his mother for a reason and I will do it. \n His sisters will resent him. \n His sisters will protect him. \n People will reject him. \n People will accept him. \n A lifetime sentence. \n The gift of a lifetime. \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-V94tiegH0UE/TnDXVc31GJI/AAAAAAAAAEs/lqbcq3b46Ks/s1600/devsmiles.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/09/back-and-forth.html", "title": "\nBack and Forth\n"},
{"date": "Monday, December 5, 2011", "body": "\n   The best thing you can give your children,  next to good habits,  are good memories. ~Sydney J. Harris \nWe were off. Just THE DIVA and I to Super Cuzzy's Wedding. You can read about Super Cuzzy  here  and  here . \n A little one on one time for the little girl who struggles with being the middle child. \n \n You want chicken nuggets at 10 am. Well sure. \n She was so well behaved on the flight out that people were surprised to see her get off the plane.  She watched TV, colored in her book and told her doll to be good. Not sure if she was reminding herself but I took it.  \n Then the next day we were off for a get pretty day with the rest of the bridal party. \n Waiting to get her nails done!!! \n  The finished product. This poor kid has my feet. \n Then we were off for a bit of accessory shopping.  She was so well behaved that she got pretty much everything she asked for.  The other bridesmaids would now like me to take them all on vacation.  I don't think that will go over to well with Big Daddy. \n Once we were done shopping, some frozen yogurt was in order. \n Stirring it to make a smoothie.  \n Then it was time to get ready for the rehearsal  and dinner.  She was well behaved the entire time.   She was her usually silly, girly, never stops talking self but no screaming or carrying on. \n Then it was Wedding Day and we were super excited. Time to get her hair done. She could hardly wait. \n \n Oh the hard life of a flower girl. \n We are almost ready. \n  Me and the BRIDE aka Super Cuzzy. \n \n Then off to the restaurant with Super Cuzzy and Super Cuzzy #2    \n THE DIVA stayed behind with her new Partner In Crime aka Aunt J.  \n We didn't do nuffin faces.  \n The World's Most Gorgeous Flower Girl \n \n And during the wedding I was reminded again just what a wonderful person Super Cuzzy is because her favor was awesome.     Instead of favors, they donated to the  Fisher House Foundation and Autism Speaks.  \n THE DIVA had a great time. She walked down the aisle nicely. She danced, was taught how to fist pump, ate, ran around like a maniac and laughed like a loon. But at 10 pm she asked to go to sleep. \n Wedding 1 THE DIVA 0 The next morning we packed up and headed back to the airport. I hope that she remembers this trip. I hope that she knows while she rarely gets one on one time at home that I always look for a way to make her feel special and loved.  Because she is a special, beautiful, funny, smart, much loved little girl and I need her to know that now and always.   Future Flight Attendant.  She takes your safety seriously. \n \n \n \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-1NnhFENi15w/TtzUHx8TcRI/AAAAAAAAAI8/SCog4NpWQ5M/s1600/302114_10150389754157555_722327554_8409253_141522879_n.jpg", "http://1.bp.blogspot.com/-1YdZNY9pOg4/TtzUMXc-vXI/AAAAAAAAAKM/opu3oMCTC2g/s1600/388910_10150401383467555_722327554_8446243_1461245693_n.jpg", "http://1.bp.blogspot.com/-NELuk-yvlkg/TtzUblnygfI/AAAAAAAAAKg/FlCwibaFdi8/s1600/383641_10150401390947555_722327554_8446253_798356456_n.jpg", "http://4.bp.blogspot.com/-HNDY9XUinek/TtzUL00-gII/AAAAAAAAAKE/U7d8TPtNPhQ/s1600/388154_10150401381697555_722327554_8446241_2001644674_n.jpg", "http://3.bp.blogspot.com/-_7kq8TiEjQQ/TtzULtT9sMI/AAAAAAAAAJ8/qh-TtXNGETo/s1600/386071_10150401379432555_722327554_8446236_83233057_n.jpg", "http://3.bp.blogspot.com/-wRrr7fNnf50/TtzUIlaXaZI/AAAAAAAAAJM/6Y1PTYnHjcc/s1600/383783_10150396574372555_722327554_8429485_379432954_n.jpg", "http://2.bp.blogspot.com/-zKfAHmrHoDI/TtzUJGActEI/AAAAAAAAAJU/7lowjQEnbOg/s1600/385417_10150396574762555_722327554_8429486_1067292624_n.jpg", "http://4.bp.blogspot.com/-k2fImf6WGIk/TtzUJ3WjeoI/AAAAAAAAAJc/DUrAUSm1GBI/s1600/381414_10150396576127555_722327554_8429487_1396725130_n.jpg", "http://4.bp.blogspot.com/-od9Kcvs0ZvE/TtzUKTGiS7I/AAAAAAAAAJk/hU3m5O7YZQM/s1600/388582_10150396578252555_722327554_8429491_1099905946_n.jpg", "http://3.bp.blogspot.com/-Z8S5nvD9_j4/TtzUK5QFWGI/AAAAAAAAAJs/ad3XNmQRA28/s1600/392653_10150396578637555_722327554_8429492_623369432_n.jpg", "http://1.bp.blogspot.com/-1U61ZqCQQRI/TtzbPEISKtI/AAAAAAAAAKo/ulPzslqlRxI/s1600/388773_10150401417772555_722327554_8446328_864445212_n.jpg", "http://3.bp.blogspot.com/-31Kn5dzPVxE/TtzULTTnNOI/AAAAAAAAAJ0/Eis6M2Z-wyI/s1600/388474_10150396581382555_722327554_8429501_1047680537_n.jpg", "http://3.bp.blogspot.com/-YI8-HpERZuQ/TtzUIbT_kdI/AAAAAAAAAJE/cjAFu3oM2zE/s1600/392943_10150395959722555_722327554_8428122_1335269799_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/12/little-time-with-my-diva.html", "title": "\nA Little Time With My DIVA\n"},
{"date": "Friday, September 23, 2011", "body": "\n Recipe for Guilt \n 1 cup of comparison 1/2 cup of looking back  1 cup of self judgement 2 tablespoons of regret   Stir, wallow, self-pity  \n Best if kept to yourself.       Recipe for Hope \n 1 cup of appreciating uniqueness    1/2 cup of looking forward 1 cup of compassion 2 tablespoons of joy   Stir, celebrate, enjoy.   Best if shared with  the village.   Ed. Note. Blogger is messing with the fonts. I have no idea why they don't match.    \n       \n \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/09/recipes.html", "title": "\nRecipes\n"},
{"date": "Monday, August 8, 2011", "body": "\n Where do we go from here? This isn't where we intended to be.   ~You Must Love Me~ \n Who do we ask when we don't know which way to go? The Map!!!!   ~Dora the Explorer~ \n Do you keep waiting for it to get easier? I do.  I keep thinking tomorrow, next week, next month it will all get easier. In the rare quiet moments, I mourn the things I've never done with Boy Wonder. At not quite 6, there are so many things I thought about when I heard, \"it's a boy\" that we would do. By now, he would have been participating in a sport. We are still watching Little Einsteins and Dora instead of Phineas and Ferb and Sponge Bob.  I've never had an eye roll or an Ugh Mom don't kiss me. This would have been the summer he learned to ride without training wheels. But the training wheels are on the bicycle for this whole ride.  \n I work through it most days but lately it's been a tough haul. We made the decision to try medication. We are sitting here on pins and needles. Watching Boy Wonder intently for effectiveness and possible side effects. Hoping that the vocal stimming and hand biting will calm down, that it will give him the focus he lacks.  \n So where do we go from here? One foot in front of the other. No looking back just forward towards hopefully what will be an easier time.  \n \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-A5RHAf7p--I/TkCUHi_rLII/AAAAAAAAAEA/DiecMsXtYOo/s1600/handsomeboy.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/08/howd-we-get-here.html", "title": "\nWhich Way?\n"},
{"date": "Monday, July 11, 2011", "body": "\nHi Jim, \n \nHow's your summer? Any vacation plans? So I thought I'd give you an update about Boy Wonder and his chicken eating adventures. Especially as the girls in your customer relations department were super and sent me some awesome coupons. \n \nWell, we tried and tried every product you offered and BW turned his nose up at all of them.  We finally had our Speech Pathologist, the wondrous K start a feeding therapy program with him.  He would eat chicken for her but not for us. Until one day when Big Daddy accidentally overcooked this chicken. \n \nAnd then Boy Wonder proceeded to stuff his face with chicken. \n \n \n \n \n \n \nSo Jim, it looks like we can continue our relationship. I'm off to Shop-rite to stock up. \n \nFondly, \n \n \nJ \nCOO of Boy Wonder, Inc.\n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-FEtq6t5U_RY/ThsNKlX0nqI/AAAAAAAAADw/vQUB_fX1SHA/s1600/photo-17.JPG", "http://1.bp.blogspot.com/-srqVTshRTeI/ThsN3YlA4XI/AAAAAAAAAD0/GRriS0tR9zM/s1600/photo-18.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/07/oh-jim-perdue-part-deux.html", "title": "\nOh Jim Perdue, Part Deux\n"},
{"date": "Wednesday, September 21, 2011", "body": "\n \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/09/i-never-run-alone.html", "title": "\nI Never Run Alone\n"},
{"date": "Tuesday, July 5, 2011", "body": "\n \n \n \n \n \n \nSummer Olympics 2020? Anything is possible.\n \n ", "outgoing_links": ["rtsp://v5.cache6.googlevideo.com/ChoLENy73wIaEQmjRjUlinohOBMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://theadventuresofboywonder.blogspot.com/2011/07/michael-phelps-who.html", "title": "\nMichael Phelps Who?\n"},
{"date": "Tuesday, May 10, 2011", "body": "\nDear Mr. Perdue, \n \nMay I call you Jim? I feel like we're close like that since my son has eaten your Perdue Baked Chicken Breast Tenderloins for lunch and dinner. It's the only protein he gets some days. \n \nYou see, Jim, Boy Wonder has Autism. He is a very selective eater. Your chicken tenderloins made it past his extensive screening process. So imagine my dismay, when I have been unable to find them in the 4 local food stores that I  stalk  look for your product in. I'm a resourceful kind of girl so I went and checked your website and found the product is no longer listed there. \n \n \nWell Jim, Boy Wonder hasn't eaten any chicken in 3 days. I tried your other products and he will have nothing to do with them.  I am currently contemplating cheating on you. I may have to go to Whole Paycheck and buy the only other brand I know he will eat. \n \nBut ya know what Jim? Life's tough enough for us. I'm sure I'm not the only Autism Mama who has a kid who would only eat those chicken tenderloins.  Could you please please bring them back? Please? I've attached a picture below just so you know exactly which product Boy Wonder enjoys. \n \n \nI hope we can continue our relationship, Jim. \n \n \nThanks, \n \nJ \nBoy Wonder's Mom\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-ICkm-WD21d0/TcldYBd8QrI/AAAAAAAAADA/m7wsT44YXZI/s1600/chicken.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/05/oh-jim-perdue.html", "title": "\nOh Jim Perdue\n"},
{"date": "Tuesday, June 7, 2011", "body": "\n True progress quietly and persistently moves along without notice. ~St. Frances De Sales   Without struggle, there can be no progress. ~Frederick Douglas \n     We attended D's little girls 3rd Birthday Party on Saturday. (Happy Birthday A!!!) Now usually Boy Wonder just hangs by the chips and wanders about not really interacting with the other kids but then this happened spontaneously and unprompted. Ready???? \n \n \n \n \n \n \n \n \n Spontaneous unprompted appropriate play with other kids. He looked at them and laughed along. Thanks for the wake up call Boy Wonder. Mommy's watching.  \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-hoqz7xUwJVs/Te51_cvUvWI/AAAAAAAAADM/oG3QXDlmqbk/s1600/photo-14.JPG", "http://3.bp.blogspot.com/-Q3CDEvycIp0/Te52Byf5aaI/AAAAAAAAADQ/gDajfxEwcqc/s1600/photo-8.JPG", "http://4.bp.blogspot.com/-sJghwRLJmBg/Te52EYx8_aI/AAAAAAAAADU/8b3DxivFFL4/s1600/photo-9.JPG", "http://2.bp.blogspot.com/-zTAw7N8IDWA/Te52GtBW95I/AAAAAAAAADY/4u2pZI5FM48/s1600/photo-10.JPG", "http://1.bp.blogspot.com/-ulkU3T2MAH0/Te52I_wiJpI/AAAAAAAAADc/__aT7klRZmQ/s1600/photo-11.JPG", "http://1.bp.blogspot.com/-DmhofXW3bqI/Te52KU-BUHI/AAAAAAAAADg/_zIar5Axbz8/s1600/photo-12.JPG", "http://4.bp.blogspot.com/-CtJJGlD1oCk/Te52Mwhy3DI/AAAAAAAAADk/4ewxfT0_T2s/s1600/photo-13.JPG", "http://3.bp.blogspot.com/-LwbA6eNeGrc/Te52Oy5X-ZI/AAAAAAAAADo/wwHzCn35_yA/s1600/photo-6.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/06/joyful-progress-in-pictures.html", "title": "\nJoyful Progress in Pictures\n"},
{"date": "Tuesday, June 21, 2011", "body": "\nAs Boy Wonder grows older his Autism grows more visible.  No longer is it  invisible  to people who don't know what Autism is. As my firstborn, there's so many firsts that I haven't experienced with him. He has made  more progress  then I was told by that doctor he would ever make.  \n \nI often only see BW in relation to the DIVA and Sweet Baby Girl so while I notice the differences, it's my normal. Between school and his therapies we don't often get to do things with large groups of kids his own age. But yesterday was BW's preschool picnic. This included the inclusive preschool as well as the preschool with disabilities class. As they had all of the kids line up in the front of the room, my heart sank. I knew what was coming. The music therapist started to play his guitar and all the typical kids and some of BW's classmates started to sing. Not my Boy Wonder though.  He cried and stimmed and bit his hand. And the thrill of his  joyful progress  just two weeks ago evaporated.  \n \nI know next year when I go to the preschool picnic for the DIVA, I'll get my typical moment.  But I also know, I'll see all the kids from BW's former class and I'll remember yesterday. The double edged sword of raising typical kids and a special needs kid. \n \n \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-Gof6b8g-YgY/TgC9iMmt0OI/AAAAAAAAADs/Muwot-o7nRg/s1600/preschoolpicnic.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/06/visible-or-double-edged-sword.html", "title": "\nVisible or The Double Edged Sword\n"},
{"date": "Thursday, July 7, 2011", "body": "\n   \"I'm never going to survive this summer\" A message sent to a select group of friends on Facebook yesterday Which began a discussion of true yet hilarious scenarios which inspired this post. \n There once was a woman who had several children. But yet.... Her house was neat. Her clothes were immaculate. Her makeup and hair sublime. She got to eat meals while they were hot. Her coffee was cold only if she ordered it iced. She got to use the bathroom alone. She also got to shower daily.  \n Her husband was a big help and he cleaned and cooked and noticed things left on the stairs and took them up on his way. He even folded laundry and put it away.  \n  Her children never fought or whined. They didn't do spit art on the windows or draw on her walls. They slept THE WHOLE NIGHT THROUGH!! They ate their meals quietly and nicely.  \n And then she heard screaming on the baby monitor and woke up. \n \n The End  \n WHAAAAAATTT???? I told you it was a Fairy Tale. And yes Big Daddy does help around here so no smart remarks when you get home honey. mmmmKay? \n \n \n \n \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/07/fairy-tale-for-my-friends.html", "title": "\nA Fairy Tale For My Friends\n"},
{"date": "Friday, April 1, 2011", "body": "\nIt's funny how four little words can change your life. Will you marry me? I want a divorce. You have a son. Your son has autism. I've had all of those things said to me. The last two are the only ones that really changed me. The very last one changed me irrevocably.  \n \nFour words that change your perception of what you thought the future would hold forever.  Gone forever the blissful ignorance of those kinds of things happen to other people and never ever to you. You become more aware of other kids development. \n \nYou learn acronyms, like PRISE, IEP, IDEA, and ABLLS. You learn about DAN Doctors, Bio Med, Floortime, ABA, VBA, ST, OT and PT. You try the  GFCF diet. \n \nYou are forever changed. Drastically and radically changed. You stop staying the \"R\" word. You judge others less. You find compassion and tolerance. Your patience and empathy grows.  \n \nYou find out who will step up and be a real friend. You find out who will step away.  You'll make new friends who are on the same path. \n \nBut I can say this with utter certainty, you now have a choice.  You can choose to be bitter over what you think you've lost or you pick yourself and move forward.  Your child standing in front of you. S/He needs you to dig deep and be more adult then you ever have been in your life.   \n \nI promise progress will come sometimes painstakingly slowly and sometimes surprisingly quickly.  \n \nNow I have four words for you. You CAN do it.  And that's a promise. \n \n \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-uMPMFuK1W9I/TZWno1Rv1SI/AAAAAAAAACs/WVL4vWzeMDw/s1600/Dev+in+a+hat.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/04/four-words-for-world-autism-awareness.html", "title": "\nFour Words For World Autism Awareness Day 2011\n"},
{"date": "Sunday, April 17, 2011", "body": "\nDo you know my fabulous friend  Jess over at A Diary of a Mom ? Please go read  this post  of hers before you proceed. I'll wait. Cue Jeopardy Music.  \n \nDone? Ok good. Let's get started then. \n \nWe swim in the deep end of the autism pool. Maybe not the deepest murkiest part but we are in pretty deep. Yes Boy Wonder is not very verbal. His social skills and play skills fairly non existent. He struggles to express his most basic wants and needs while we struggle to understand him. \n \nBut our struggles are just that. OUR struggles not your struggles. While your struggles are in the shallower end pool, they are no less challenging just different. \n \nI've never once wished that Boy Wonder was less autistic, had HFA or Asperger's.  I've wished he didn't have autism at all. I wish no parent ever had to hear,\"Your child has autism.\"  \n \nI empathize with your struggles and I celebrate your child's victories. But never once have I thought that your child has it easier then mine. I just think their challenges are different. \n \nI don't want more company down in the deep end of the pool. It's crowded enough down here.\n \n ", "outgoing_links": ["http://adiaryofamom.wordpress.com/", "http://adiaryofamom.wordpress.com/2011/04/11/guilt-gratitude-responsibility/"], "link": "http://theadventuresofboywonder.blogspot.com/2011/04/deep-end-of-pool.html", "title": "\nThe Deep End of the Pool\n"},
{"date": "Thursday, April 21, 2011", "body": "\n \n \n \n \n \n \n \n ", "outgoing_links": ["rtsp://v5.cache1.googlevideo.com/ChoLENy73wIaEQk6DHulKKS0mhMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://theadventuresofboywonder.blogspot.com/2011/04/umm-beyonce-diva-is-after-your-job.html", "title": "\nUmm Beyonce??? The DIVA is after your job.\n"},
{"date": "Friday, March 25, 2011", "body": "\n “Individually, we are one drop. Together, we are an ocean.”   Ryunosuke Satoro Strict ABA Program  Floortime  Gluten Free Caesein Free Special Carborhydrate Diet Whatever he/she will eat today Diet  DAN Doctor  No DAN Doctor Biomedical Intervention Lucky if they take a multivitamin intervention  A known genetic cause Vaccine injured Genetic factors with environmental triggers No clue why my baby has it Team Curebie Team Neurodiversity Praying for a miracle Praying to get through the day Just diagnosed Years since diagnosis  Our children are part of the fastest growing diagnosis in the world. They have autism.  Yet we fight amongst ourselves. We judge each other's choices. We call names. We are steadfast in our beliefs that our way is best.  We preach acceptance yet don't practice acceptance.  But what would happen if we all banded together? If we worked together, despite our differences? We all have one common goal. We want happy healthy children who grow in to valued productive members of society. Who will be happy and  safe long after we are gone. I don't know how we can possibly get our children where we want them to be if we can't band together now.    Don't you think it's time we all worked together?  \n \n   \n \n \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/03/you-say-tomato-i-say-tomatoe.html", "title": "\nYou Say Tomato I Say Tomatoe\n"},
{"date": "Saturday, March 26, 2011", "body": "\n \n \n \n \n \n \n \n ", "outgoing_links": ["rtsp://v3.cache2.googlevideo.com/ChoLENy73wIaEQkaZMTuaXfwLhMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://theadventuresofboywonder.blogspot.com/2011/03/diva-promise-or-all-lies.html", "title": "\nA Diva Promise or All Lies\n"},
{"date": "Saturday, February 19, 2011", "body": "\n United we stand; divided we fall. Aesop   In the end we are all separate: our stories, no matter how similar, come  to a fork and diverge. We are drawn to each other because of our  similarities, but it is our differences we must learn to respect.” \nUnknown   \n   \n   I watched Dr. Oz's show the other day. I don't normally watch his show but a fellow autism mama told me the topic was going to be on the causes of autism. I know this is a hot topic within the autism community. I know and understand that we can't prevent it, if we don't know what causes autism. I, also, do not think it's one thing causing autism.  \n \nIt was a very divisive hour. I, for one, do not get all the infighting among the autism community. I think we all have a common goal for our loved ones with autism. We want them happy, healthy and whole. We want them to have a life of purpose. We want them to love and be loved. Whether you choose the GFCF diet, you see a Dan doctor, you believe in ABA, Floortime, RDI, or biomed, we want our loved one to no longer suffer from whatever particular demons autism visits on them.   \nWe can not move forward if we continue to fight amongst ourselves. Our children needs services now and most of them will need supports through out adulthood. We are all entitled to our own choices and opinions regarding our own children.  We know our own child(ren) best. What works for Boy Wonder may not work for your child and vice-versa. No two children with autism are exactly alike nor should their treatments, therapies or education be exactly alike. Autism is not cookie cutter. \n \nTime is marching on for our kids. For their sakes, shouldn't we all make an effort to respect each other's differences of opinions? Isn't that what we are constantly asking of other people? To respect our children's differences? What kind of example are we setting if we can't respect each other's different choices?  \n \nIt's time to stop fighting amongst ourselves and to start fighting for the reason we are here in the first place. Our kids. Are you willing to try?  \n \n \n \n \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-Kn3BgcjHRKQ/TV9DYuD6UlI/AAAAAAAAACY/SqVUSwW4sJI/s1600/DSC01078.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/02/uniteddivided.html", "title": "\nUnited/Divided\n"},
{"date": "Tuesday, March 15, 2011", "body": "\n   \n So the  marathon training  is going well.  I'm getting really quick on the flats but hills ugh. I am not a fan of running hills. They are a necessary evil. \n A necessary evil.  Boy Wonder has so many of them in his life. OT, ABA, ST, PT. Making him speak if he wants anything. Interruption of stimming and self injurious behaviors.  \n When he was being taught to go up a flight of stairs foot over foot, I kept saying, \"Come on Baby! You can do it! One foot in front of the other!\" So as I run my necessary evils, I keep telling myself, \"one foot in front of the other.\" I'll get myself up  those hills just like Boy Wonder.  \n \n \n \n ", "outgoing_links": ["https://lh6.googleusercontent.com/-Ilou32N3FzQ/TX-abLWCNKI/AAAAAAAAACc/2xE9gh_zDk0/s1600/woman_running_up_hill_600-00029470.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/03/run-hill.html", "title": "\nRun The Hill\n"},
{"date": "Sunday, December 26, 2010", "body": "\n D.J.:  Was I an accident? Roseanne:   No, D.J., you were a surprise.  D.J.:  Oh. What's the difference?  Roseanne:    Well, an accident is something that you wouldn't do over again if you  had the chance. A surprise is something you didn't even know you wanted  until you got it. \n Happy 1st Birthday, Sweet Baby Girl!! My BEST Surprise EVER!!!! \n \n \n   \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_Ipkxj8ZVmoQ/TRFUsYzcYAI/AAAAAAAAACI/0dBV0QoHoR0/s1600/hayden.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2010/12/surprise.html", "title": "\nSurprise\n"},
{"date": "Friday, March 18, 2011", "body": "\n \n \n \nApril 2, 2011 is World Autism Awareness Day. My wonderful friend,  Jess ,  wrote  this letter to President Obama  asking him to Light the White House Blue in order to raise awareness for our children with Autism. If you are so inclined, please drop by and ask Mr. President to participate. \n \nOur children can't have acceptance till the world is aware of them. Awareness is only the first step down this yellow brick road. \n \nLeave a comment for my boy and all the other boys AND girls like him. \n \nC'mon Mr. President. I'll even say please.\n \n ", "outgoing_links": ["https://lh6.googleusercontent.com/-vlIPh_ggj7c/TYM_lXSRCHI/AAAAAAAAACk/Rcfi1kloFHg/s1600/liub_fblogo3_rp1.jpg", "http://adiaryofamom.wordpress.com/2011/03/16/dear-mr-president/", "http://lightthewhitehouseblue.wordpress.com/2011/03/16/this-is-my-autism/#comments"], "link": "http://theadventuresofboywonder.blogspot.com/2011/03/light-it-up-blue.html", "title": "\nLight It Up Blue\n"},
{"date": "Friday, February 11, 2011", "body": "\n26.2 miles for Boy Wonder. \n \nFor all boys AND girls challenged by Autism. \n \nIn honor of the parents who blazed the trail. \n \nFor those whose biggest heartbreak is yet to come. \n \nIn honor of  my friend  who flies all over the country to get health insurance reform passed for our kids. \n \nAnd  my friend  whose words offer me comfort and hope that I'm not alone. \n \nAnd  her husband  who tells me I can run it.  \n \nAnd  my friend  whose faith is inspiring.  \n \nAnd  my friend  who gave me a glimpse into the possibilities of the future. \n \nAnd  their siblings  who grow up quicker but wiser and with more compassion then the average bear.  \n    \nAnd all my fellow mama bloggers to the right and the rest of  my village  who don't blog but I think of everyday and fool around on Facebook with on a  regular   daily  hourly basis.  \n \nA 26.2 mile run in the 2011 NYC Marathon for Autism Speaks Team Up in honor of our quirky brilliant beautiful children. \n \nLegs don't fail me now.  \n \n If you'd like to support my effort, please email me at BoyWondersMom1004@yahoo dot com for the link to my donation page. \n \n ", "outgoing_links": ["http://autismville.blogspot.com/", "http://adiaryofamom.wordpress.com/", "http://runluaurun.com/", "http://rhemashope.wordpress.com/", "http://teenautism.com/", "http://adiaryofamom.wordpress.com/2011/02/01/a-gift-given-twice/", "http://4.bp.blogspot.com/-GlGqVBTytno/TVXw4Y-tAbI/AAAAAAAAACU/3kJ0T11Wjd8/s1600/DSC01070.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/02/262.html", "title": "\n26.2\n"},
{"date": "Wednesday, November 17, 2010", "body": "\nHe'll never talk said the doctor. \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["rtsp://v8.cache3.googlevideo.com/ChoLENy73wIaEQnhLnbbKAmnvhMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://theadventuresofboywonder.blogspot.com/2010/11/never-say-never.html", "title": "\nNever Say Never\n"},
{"date": "Tuesday, March 29, 2011", "body": "\nI think I am understanding lately  how Boy Wonder may feel. I have so much to say but I can't say it. I keep getting in my own way. Post ideas listed everywhere. Half written posts in my head but when I sit down to write nothing comes. I feel blocked and jittery. \n \nIs it because of what's going on with the school district? This waiting game of who pays for what if anything? The Boy's placement for next year has me on edge and jumping out of my skin. Snappish and no patience for little girls whining.  \n \nI could tell you that I'm running faster but it's fueled by fear and anger. That the forced rest days built into the schedule I'm tempted to ignore because physical pain dulls the fear and anger. \n \nSleep is elusive for me and Boy Wonder. He's been getting up at 3 am.  \n \nI could tell you that I feel that there's been no meaningful progress for Boy Wonder for months and that it makes me angry.  Angry because I thought we'd be farther along by now. Or I try to remember that he seems happy and that's what matters most.   \n \nI could tell you that Sweet Baby Girl is developing beautifully and typically. She is my happiest, sweetest, most smiley baby. At 15 months, she has a few words and is into everything. \n \nOr that the Diva is living up to her name. In all her 3 year old glory, she thinks that screaming in my face will change a no to a yes. Or that potty training is optional. But she is so smart and can be so sweet. Lots of questions and I can do it myself. Or that I find her fashion sense outrageously wonderful.   \n \nI could tell you other things but I'm searching for my words just like my Boy Wonder. \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-rSG8_shcdkw/TZIV5iC0CvI/AAAAAAAAACo/oHCyhVGIHJk/s1600/photo-3.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/03/when-words-wont-come.html", "title": "\nWhen the Words Won't Come\n"},
{"date": "Tuesday, December 21, 2010", "body": "\nMay the coming year be filled with  hope  and  progress  and  love . May you weather your  storms .  \n \n \n \n ", "outgoing_links": ["http://teenautism.com/2010/12/19/hope-on-a-river/", "http://adiaryofamom.wordpress.com/2010/12/21/all-along/", "http://rhemashope.wordpress.com/2010/10/19/midnight-plane-to-georgia/", "http://rhemashope.wordpress.com/2010/11/28/when-the-storms-dont-cease/", "http://1.bp.blogspot.com/_Ipkxj8ZVmoQ/TRFS1Nty3NI/AAAAAAAAACE/z8JITg2Cp9c/s1600/CardFront_CB-1.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2010/12/from-our-home-to-your-home.html", "title": "\nFrom Our Home to Your Home\n"},
{"date": "Friday, June 3, 2011", "body": "\n  In this world, there is a kind of painful progress.  Longing for what we've left behind, and dreaming ahead.\"       \n—         Tony Kushner \n \nWe had Boy Wonder's Annual IEP review.  His placement has changed from Preschool with a Disability to Autism. He will be  in a self contained classroom next year for \"Kindergarteners and First Graders.\" \n \n \nWhile I'm glad he has made enough progress to move ahead, the lack of development grows all the more apparent. Sweet Baby Girl is surpassing him weekly. The DIVA is a runaway freight train so far down the track ahead of him. I know it does me no good to compare my kids. It's not a luxury I often allow myself. But for a few minutes I'll wallow in it.  I thought we'd be farther along by now but we aren't. \n \nThe school year is almost over.  BW will be attending Extended School Year. But I'm dreading the fall already. Why? Our town hands out lawn signs for all the kids starting Kindergarten. It says \"School # 2 welcomes you to Kindergarten.\" This is not a Kindergarten I ever imagined.  \n \nBut I'm not alone. Alot of us are feeling this way after IEP season.  It's disappointment and heartbreak for now but the hope and joy will come back around. \n \n \n \n ", "outgoing_links": ["http://www.goodreads.com/author/quotes/35822.Tony_Kushner", "http://2.bp.blogspot.com/-Xat_0EYuLhk/TejgPLJQSuI/AAAAAAAAADE/08REGaxuCcM/s1600/sensorydev.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/06/painful-progress.html", "title": "\nPainful Progress\n"},
{"date": "Monday, December 20, 2010", "body": "\nMy darling delightful girly girls, \n \nOh how I love the two of you.  I love everything about each of you from the top of your heads to the tips of your toes. Watching you play together, the silly giggling, the let's splash each other in the tub and the snuggling each other. You two are delicious. \n \nI want you to know that I love all of you equally. Boy Wonder takes up an enormous amount of time because of his Autism but it does not mean I love him more or either of you are less important then Boy Wonder.  \n \nAll you ever have to say is Mommy I need you and I will make the time. Maybe not right that instant but I will do whatever you need as soon as I can. \n \nWe are all working so hard right now to get Boy Wonder where he needs to be so you my Diva and Sweet Baby Girl can have a brother who talks and shares and expresses himself. \n \nYou my darling girls have been so important in bringing Boy Wonder out of his world and into our world. If it wasn't for the two of you, I think he'd be even further behind. You two push him, engage him, aggravate him and make him laugh. \n \nSo my beautiful girls know that I love you both so much more then I can ever say.  \n \nMommy\n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2010/12/for-my-girls-when-they-are-little-older.html", "title": "\nFor My Girls When They Are A Little Older\n"},
{"date": "Friday, January 7, 2011", "body": "\nWe received our independent evaluation from the BCBA and one line still has the power to steal my breath away and bring tears to my eyes. Do you know what it is? I think you do but I'll tell you anyway. \n \n\"Boy Wonder is a very handsome little boy with  significant needs and delays .\" \n \nIt's  a stab in the heart every time. Why? Because I no longer focus on what he can't do. Do we work on his deficits well of course. But I concentrate on how far he's come. He can go upstairs foot over foot. He can speak in a  whole sentence . He can brush his own teeth. He's on his way to being potty trained. He's beginning to, however, clumsily and inappropriately begin social interactions. He has joint attention. There's many many more things. \n \nBut significant needs and delays in black and white will sucker punch me every time.\n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/01/so-anyway.html", "title": "\nSo Anyway\n"},
{"date": "Wednesday, September 8, 2010", "body": "\n3 years ago Boy Wonder was diagnosed with Autism. 2 years ago, I put him on the bus to go special needs preschool. Today, I think of all the other parents who put their \"special\" babies on the bus for the first time. I want you to know it will be ok. You'll do it because you know it's what your baby needs. So put them on the bus, go inside have a good cry  and they'll be home before you know it. \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/_Ipkxj8ZVmoQ/TIeOGN034dI/AAAAAAAAAAw/hVbie40-yC4/s1600/DSC00992.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2010/09/first-day-of-school.html", "title": "\nThe First Day of School\n"},
{"date": "Thursday, September 16, 2010", "body": "\n \n \nFree and Appropriate Public Education right??? \n \nSo when Boy Wonder was about to turn 3, we engaged a Child Advocate to help us through our first IEP meeting. \n \nAt that time, the school district was not willing to pay for any home hours. The Special Education Director's personal belief is that a kid should be a kid.  We had 10 hours of ABA and Speech Therapy in home at the time in addition to the minimal services we were getting through Early Intervention. The Child Advocate advised us to stop all private therapy so that when Boy Wonder's progress wasn't satisfactory we could then  attempt  to get the district to pay for it. Big Daddy and I decided that this would not be in Boy Wonder's best interest.  We continued paying for home hours ourselves and added on additional hours.  \n \n Boy Wonder currently has 11 hours of ABA and 6 hours of Speech Therapy at home. The district pays for 2 hours of ABA.  He would be not have made the progress he has made without all of the private therapy. We are about to retain an attorney. We are going to request an independent evaluation of Boy Wonder's current program and ask that the district pay for the in home therapy.  \n \nHe's come soooo far. I know his progress is nothing short of miraculous but I think he can do better.  I am not sure if where he is now will get him where he needs to be. \n \nTime to stand up for my kid. Put your seatbelt on.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_Ipkxj8ZVmoQ/TJKE1zLajhI/AAAAAAAAABA/Z2EHoa6cvAE/s1600/fape504.gif"], "link": "http://theadventuresofboywonder.blogspot.com/2010/09/fape-dilemma.html", "title": "\nThe FAPE Dilemma\n"},
{"date": "Thursday, December 9, 2010", "body": "\nWell Boy Wonder had his independent evaluation. It went well.  We were told his school is great and that he works hard all day long. That you don't often seen this type of program in a public school. The BCBA also agreed that Boy Wonder has made the progress he has made because of school and his 15 hours a week of home programming. He will recommend in his report that the district should be paying for his home hours. Hopefully this will all go smoothly. \n \nThe BCBA asked if we had any questions. What does the future hold?   Is it not enough all that what we do? As hard as we push him? I'm thinking we are working Boy Wonder every minute of every hour of every day and although his progress is miraculous I thought we'd be somewhere else by now. More typical, less therapies, more freedom, less worry. So yes I secretly hoped that possibly his school wasn't the best fit for him but it turns out it is. It is a bitter pill to swallow that my Boy Wonder is more profoundly autistic then I was willing to acknowledge. \n \nSo now we'll keep pushing him on, cheering him on, making sure he has all the therapy he needs to continue his miraculous progress while Mommy gets her head out of the clouds.\n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2010/12/lightbulb-moment.html", "title": "\nLightbulb Moment\n"},
{"date": "Wednesday, September 22, 2010", "body": "\nIt's interesting how we all handle our kids challenges. We all want what's best for our kids. We push them. We fight for them. We won't give them what we know they want unless they specifically ask for it. Some of us know already that we are in for lifetime care as the physical and/or mental needs are so great. That our babies will always need a high level of care. For others, there still is the hope that they will have independent lives.  \n \nSo you ask, J, just where are you going with this?? While in the grocery store recently I ran into a mom whose son is in Boy Wonder's class.  She admired Sweet Baby Girl. We chatted for a bit. She then told me she was resigned to her son being a baby for the rest of her life. I had not much of a repsonse for that statement. I've met her son. He reminds me of Boy Wonder. The difference is her son is not getting all the after school therapy that Boy Wonder is getting. Her district won't pay for it and she can not afford it. The boys are not quite 5 and to hear her say she's resigned herself already saddens me. I wonder where her son would be if her school district would step up and do what's right and quite frankly APPROPRIATE.   \n \nI'm not resigned. Not just yet. There is still hope, possibilites. Maybe even a miracle or two. But resigned? Not even close!\n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2010/09/resigned.html", "title": "\nResigned\n"},
{"date": "Wednesday, September 29, 2010", "body": "\nWe've all been a bully or been bullied by someone at some point in our childhood. Whether we were part of a herd mentality or it's something we saw at home, we have all been affected by it at some point.  \n \nBut the bullying in the news is over the top. To bully someone to death for  suspecting they are gay ,  to break someone's arm for being a male cheerleader ,  or when an adult bullies a child with autism. \n \nIt begs the question, what example are we as parents setting at home? Are we bullying our spouse, our children, other family members? Are we standing by idly while one of our children bullies their brother or sister in front of us? \n \nAre you teaching your children tolerance and respect for others? Or are you sending your children a message that anyone who is \"different\" deserves contempt?   \n \nAre you teaching your children to think for themselves when their friends are being mean? That it's ok to stand up and say hey you're being mean and knock it off. \n \nI understand peer pressure and I get that for the most parts our kids want everyone to like them. But there are some kids who are different, who embrace their differences, who aren't afraid of a choice that may make them a target and shouldn't we celebrate those kids who are not afraid to be different? \n \nWhat is to be gained by standing by while a child who has special needs is picked on by their classmates? Are you teaching your children it's ok to pick on someone with special needs? To use the word \"retard\" as a joke? That autism is something made up because there are parents who can't control their kids? That it's ok to THINK you are making yourself look better to pick on and abuse someone who can't defend themselves or doesn't understand you really aren't their friend? \n \nPlease please teach your children that no two people are exactly the same. That differences are wonderful. The classmate you mock and belittle today may be the one to save your life one day. Not everyone has to be friends but everyone should be treated with respect.  \n \nYou are your child's most important example. Make damn sure you are a good one.\n \n ", "outgoing_links": ["http://westorlandonews.com/2010/09/29/gay-teen-kills-himself-because-of-bullying-parents-say/", "http://www.fox8.com/news/wjw-male-cheerleader-beat-up-txt,0,3171274.story", "http://www.huffingtonpost.com/kim-stagliano/post_701_b_685954.html"], "link": "http://theadventuresofboywonder.blogspot.com/2010/09/bullying.html", "title": "\nBullying\n"},
{"date": "Monday, October 4, 2010", "body": "\nBecause I can't say it any better I will be stealing song lyrics today. Forgive me. \n \n When I see your face  There's not a thing that I would change 'Cause you're amazing Just the way you are \n And when you smile The whole world stop and stares for awhile Cause MY BOY, you're amazing  JUST THE WAY YOU ARE! \n Happy 5th Birthday Boy Wonder!  \n You have come so far this year. Keep the progress coming!  Love, Mommy, Daddy, THE DIVA and Sweet Baby Girl \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/_Ipkxj8ZVmoQ/TKkUGm2oxNI/AAAAAAAAABo/jP47mwg3mOQ/s1600/DSC01065.JPG", "http://1.bp.blogspot.com/_Ipkxj8ZVmoQ/TKkUjQn5_ZI/AAAAAAAAABs/DcoaHFPRo6c/s1600/DSC00983.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2010/10/five.html", "title": "\nFive\n"},
{"date": "Saturday, January 22, 2011", "body": "\nBoy Wonder loves to swing. It calms him and helps him self regulate. Its also teaching him to take turns.  \n \n \n \n \n \n \n   \n The DIVA loves that her big brother is playing with her.  The only problem is Sweet Baby Girl thinks she's big enough to get in on the action. We'll just keep letting her try even though she's too little. Why? Because all of my kids playing and laughing together was not something I was sure I'd ever see.   \n What's the best item you've bought for your child?  \n \n ", "outgoing_links": ["rtsp://v6.cache5.googlevideo.com/ChoLENy73wIaEQkvFW2zw_4zJhMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://theadventuresofboywonder.blogspot.com/2011/01/best-100-we-ever-spent.html", "title": "\nThe Best $100 We Ever Spent\n"},
{"date": "Thursday, September 9, 2010", "body": "\nTHE DIVA can not stop talking. It is all non stop chatter around these parts. Whether she's asking questions, talking back to the tv or bossing Sweet Baby Girl and Boy Wonder around. \n \nShe was chattering non stop while we were out in the public the other day. A woman said to me, \"I bet you can wait for her to be quiet.\" I just smiled and shook my head. \n \nBecause all you other mamas of non verbal/pre verbal children know when you have a child that talks and talks you know what a gift it is. They can chatter day and night and you'll never tell them to be quiet. I might ask her to lower the volume but never do I tell her to be silent. That sweet little voice is a balm to my heart even when it's shrieking at me to get her more grapes now MOMMMY!!! \n \nSo I don't care if she talks all day and night just so long as she does.\n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2010/09/verbal-vomit.html", "title": "\nVerbal Vomit\n"},
{"date": "Wednesday, February 2, 2011", "body": "\nHillary Clinton said it takes a village to raise a child. That's even more true when you have a special needs child.  We have a case manager, a teacher, paraprofessionals, occupational therapists, physical therapists and speech pathologists to name a few. \n \nBut what about us Mamas? Its been hard for me to connect with anyone here in the heavily populated 'burb where I reside. I tried the  whinebitchcomplain  support group at Boy Wonder's school. It wasn't a good fit. I found my village online. I've been fortunate to have met a few of them in person. This weekend I met even more of them. \n \nIt is wonderful to NOT have to explain. To speak in the shorthand of  special needs mama. A sigh, a sentence that doesn't have to be finished because your thoughts and feelings are understood. Compassion without judgment or pity. \n \nWe drank and ate. We laughed like lunatics. We shared our stories. We cried and then laughed some more.  \n \nIf your village is not in your hometown, look online. Read blogs. Comment. Write your own blog. We're here. To laugh with you, to cry with you, to have some tequila with you, to catch you when it's all too much and we are here to celebrate when your child hits one out of the park. \n \nCome find us. We're waiting. \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/02/village.html", "title": "\nA Village\n"},
{"date": "Sunday, March 20, 2011", "body": "\n \"Divas are not made, they are born.\" ~Fiona Apple \nThree??? How did that happen??? She is a walking, dancing, talking, laughing screamy screamer of a girly girl. She is her own person.  Stubborn, strong willed, hilarious, compassion starting to show.  Developing typically and effortlessly much to my relief. \n \n Happy 3rd Birthday to our Diva!! Look out world she's three now!!! \n \n \n \n ", "outgoing_links": ["https://lh3.googleusercontent.com/-Cvq6LZdUyD8/TYF0twOWG-I/AAAAAAAAACg/IC9fbadRRZQ/s1600/Diva.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/03/three-what.html", "title": "\nThree??? What????\n"},
{"date": "Wednesday, October 27, 2010", "body": "\nThey call Autism the Invisible Disability. There's no outward physical markers. When most of our kids sit quietly, you'd never know they have a disability. But our kids, for the most part, don't sit quietly. There is vocal and physical stimming.  There's scripting, echolalia and rigid routines. \n \nAnd then they do it in public and you get unsolicited advice and remarks.  Or as Pixie Mama says people think of it as bad parenting.  \n \nBecause when you see our kids with Autism all you see is their outward beauty. You don't see their brains misfiring, getting stuck on one word or script, or that even the softest clothes annoy them or loud sounds scare them.  That for some the world appears to be through thick glass and for others its like being at a rock concert all day long in front of the world's biggest speaker or so bright it's like living on the surface of the sun. \n \nI know you can't \"see\" their Autism. I know it because when I look at the picture below I can't see it either but it's there. \n \n \nI wonder if you could see it would you treat our children more kindly? Would you show them tolerance and compassion? Would you keep your mouth shut and not offer unsolicited advice? Would you keep your remarks to yourself? \n \nBut in all reality, if you look you can see it. You can see it in their behaviors, their way of speaking and lack of eye contact.  \n \nAt a current rate of 1 in 110 children living with Autism we are surrounded by it. Autism not really so invisible after all, is it? \n \n \n ", "outgoing_links": ["http://imapixiemama.blogspot.com/2010/10/i-used-to-be-superhero.html", "http://1.bp.blogspot.com/_Ipkxj8ZVmoQ/TMhZjNsnfBI/AAAAAAAAACA/GVBhbbkj-BM/s1600/MrHandsome_CBP.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2010/10/invisible.html", "title": "\nInvisible\n"},
{"date": "Wednesday, March 23, 2011", "body": "\nI recently receive my April issue of Parents Magazine.  As I flipped through the magazine, I noticed that despite April being Autism Awareness Month there was not one article on Autism. I was shocked and dismayed. Not even on article on the  early warning signs of Autism ? Are these people for real?  \n \nI wrote about it on Facebook. I liked Parents Magazines fan page and called them out on it.  I received a condescending reply.  I got the other Autism Mamas on board.  We've received no real response. \n \nWe will be canceling our subscription. \n \nParents Magazine just so you know our children with Autism in all of it various forms are deserving of so much more then your dismissive attitude.  Maybe next year you'll do a better job. Hope springs eternal.\n \n ", "outgoing_links": ["http://www.autismweb.com/signs.htm"], "link": "http://theadventuresofboywonder.blogspot.com/2011/03/1-in-110-do-count.html", "title": "\n1 in 110 DO COUNT!\n"},
{"date": "Sunday, May 8, 2011", "body": "\n Editor's Note: I wrote this post last Mother's Day. It's still relevant. I've only updated the pictures. \n For the one who is proving the doctors wrong. \n \n \n For the one who makes me laugh till I have tears streaming down my face. \n \n \n \n \n For the one who was a total utter surprise but is a joyous smiley baby. \n \n \n \n For making me a better person because really you have shown me what matters. For teaching me what love is really all about. For the smiles, giggles and utter silliness. For sleepy hugs. For I love yous. For a reason to get up in the morning. For showing me what real determination  is to each of you. For the everyday gift of being your Mommy. I love each and everyone one of you for exactly who you are at this very moment. Happy Mother’s Day! \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-JmoMnwmMeG8/Tcaqf_pNopI/AAAAAAAAAC0/eddjlnMB6P8/s1600/Devin5.JPG", "http://3.bp.blogspot.com/-T9_aRK4Ehgg/Tcaqog3BpuI/AAAAAAAAAC4/9Ix7AuWLHr8/s1600/beelila.JPG", "http://3.bp.blogspot.com/-90Rltk9yCLs/Tcaq1ILUWQI/AAAAAAAAAC8/BvZ3MGctCi8/s1600/hayden2.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/05/for-my-kids-on-mothers-day.html", "title": "\nFor My Kids on Mother's Day\n"},
{"date": "Friday, July 15, 2011", "body": "\n   Rejoice in the things that are present; all else is beyond thee. Montaigne \n Take your eyes off what you lost. Daniel @blindpoet \n \nI often feel as if I have been absent from Boy Wonder's toddler years and preschool years. He's my oldest child yet he's the one I've spent the least amount of time with since his birth. I went back to work when he was 10 months old. At 17 months, he entered Early Intervention and I found myself unexpectedly pregnant with THE DIVA.  At 2 years, 1 month and 5 days he was diagnosed as having severe autism and we threw him headlong in to therapies, day in and day out. At 3 years old, he boarded the school bus for the first time, came home got off the school bus and I had a therapist here waiting for him. Right after the THE DIVA'S 1st birthday, I found myself unexpectedly pregnant with Sweet Baby Girl. (Yes I see the pattern here. No it will not be happening again.)  \n \nSo since Boy Wonder's been 17 months old, he's been in therapy and I've been popping out babies like tic-tacs. The little girlies are always here and always making their presence known. I feel as if I don't often to get to just be  his  Mommy. I'm always his advocate, therapist, coordinator, etc. but just Mommy doesn't happen often. \n \nYesterday, when the bus dropped him off, THE DIVA was off at camp and Sweet Baby Girl was napping. Boy Wonder wandered over to the front steps and sat down. Instead of rushing him inside like I normally would, I sat down next to him. He put his head on my shoulder and smiled. And I sat and just enjoyed the feeling of his still small body pressed up against me and just enjoyed being his Mommy.  \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-Czb-PAKWFF0/TiA6dbBMPEI/AAAAAAAAAD8/HhGdDSTSi8Q/s1600/photo-19.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/07/in-moment.html", "title": "\nIn The Moment\n"},
{"date": "Monday, May 2, 2011", "body": "\n \nI took this picture yesterday afternoon as my kids enjoyed their new swingset after weeks of rain and mud. They are all laughing and having a grand time. \n \nWhen my girls are older, I want them to look at this picture and celebrate their brother's differences. He may not always go in the direction we want him to go in but he gets where he needs to be in his own sweet time.  \n \nAnd wouldn't the world be a boring boring place if we were all exactly the same?\n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-hkjZ3Q-74uE/Tb63Tx18KtI/AAAAAAAAACw/fbm2gUFAGVQ/s1600/swing.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2011/05/swinging-to-his-own-beat.html", "title": "\nSwinging To His Own Beat\n"},
{"date": "Thursday, February 3, 2011", "body": "\n \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/02/this-would-be-funny-if-it-werent-so.html", "title": "\nThis Would Be Funny If It Weren't So Damn True\n"},
{"date": "Friday, May 6, 2011", "body": "\nlet you limit his future. \n \nlet you fail to help him realize his full potential. \n \nlet you warehouse him till he ages out. \n \never stop fighting for him. \n \never stop loving him. \n \nstop fighting for his right to be himself. \n \nI won't stop ever EVER. \n \n \n Well I won't back down \nNo I won't back down \nYou can stand me up at the gates of hell \nBut I won't back down  No I'll stand my ground, won't be turned around \nAnd I'll keep this world from draggin me down \ngonna stand my ground \n... and I won't back down \n \nTom Petty and the Heartbreakers  \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/05/i-will-not.html", "title": "\nI Will NOT\n"},
{"date": "Tuesday, July 12, 2011", "body": "\nJess over at A Diary of a Mom wrote a  beautiful post about Brooke showing Katie empathy . Yes go read it. I'll wait. \n \n \nBack? Ok good. So I remember the doctor saying the Boy Wonder would never really connect with people or show love and affection. I have found that statement to be untrue.  I have a cousin who from here on out shall be referred to as SuperCuzzy. Boy Wonder loves her. LOVES HER. They have a special connection. He cries when she leaves.  She is an AHHHHHHMMAAZZZINNNGG person. She worked as a respite worker for a family with several kids on the spectrum during college. When she visits, there's no explanations and no judgements. She just sees, helps, gets it. So when she walked in the door Friday afternoon, she was immediately jumped on and loved by Boy Wonder. \n \n \n \nSo he'll never show love and affection? Yeah sure whatever. Tell that to SuperCuzzy. She'll tell you different.\n \n ", "outgoing_links": ["http://adiaryofamom.wordpress.com/2011/07/11/autistic-people-lack-empathy-except-not/", "http://2.bp.blogspot.com/-BJDU7HYkcik/ThxEqRVp4cI/AAAAAAAAAD4/25OzECYbkFk/s1600/cuzzy+love.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/07/love-autism-style.html", "title": "\nLove: Autism Style\n"},
{"date": "Thursday, September 1, 2011", "body": "\n If it ain't broke, don't fix it. Anonymous   On the day Boy Wonder was diagnosed, the doctor said alot of things in his accented voice. Most of it rushed past me. I couldn't even comprehend that this man had told me my baby had autism. He gave no hope. Said,\"there's no cure.\" He made a few suggestions. He said based on the way BW was walking he should have shoes with high tops and orthopedic inserts. He told us to go to a shoe store near the hospital that specialized in these kinds of shoes. My first thought was, \" Oh good, I can fix something for my boy.\" 30 minutes after he was diagnosed we walked into the shoe store and bought him boots with inserts. \n We recently took Boy Wonder to an orthopedist at the suggestion of his new neurologist.  It was recommended that again we go with high top shoes and orthopedic inserts. So we went and bought new shoes with inserts. Can't hurt. Might help.  \n  If tomorrow I could take away all his struggles  I so would. I'd give anything for Boy Wonder to  break out of his autism.  But here's the thing, he doesn't need to be fixed. He is who is he. I want things for him. To be happy, to have a purpose in life, to have friends but he does not need to be fixed. He needs to make his own progress.  \n And I figured that out while wearing these.  \n \n  \"The perfect shoes can change your life.\" Cinderella \n Or at least your perspective.  \n   \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-T2kc712foUY/Tl-xVjE1eqI/AAAAAAAAAEU/W96ggomuxMs/s1600/booties3.jpg", "http://1.bp.blogspot.com/-kOk-dRRYvqg/Tl_GgWAdjJI/AAAAAAAAAEY/G4LFYL-CkAc/s1600/mizuno-running-shoes-4.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/09/shoes.html", "title": "\nShoes\n"},
{"date": "Tuesday, September 6, 2011", "body": "\n Hope arouses, as nothing else arouses, a passion for the possible. ~William Sloan Coffin \n   My hopes for the following school year in no particular order.  \n  For Boy Wonder to express what he's feeling. \n A smooth transition. \n A year of teamwork. \n An IEP followed to the letter and in spirit. \n Progress in small ways and big ways. \n Open honest communication.  Less bullshit cause I'm tired of bullshit. \n Educators who want my Boy Wonder to succeed in life. A bus that shows up on time. \n A friend for Boy Wonder. (I'd say friends but I don't want to be greedy.) \n Here comes kindergarten. Not the kindergarten I imagined but still it's kindergarten. \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-M8RQlto8MZY/TmbOqq0Y7jI/AAAAAAAAAEc/p4G37gyrL-w/s1600/kindergarten.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/09/hopes.html", "title": "\nHopes\n"},
{"date": "Tuesday, September 20, 2011", "body": "\n Children have to be educated,  but they have also to be left to educate themselves.   ~Abbé Dimnet,   Art of Thinking , 1928 \n Ahhh one of the first things you learn when you have a child with autism is that they don't just pick things up. The professionals call it incidental learning. We don't see much of incident learningl from Boy Wonder.  However, every once in a while he likes to shock us with just how much he observes. \n Recently, I was refereeing the girlies and his pizza was done. He heard the beep, went in kitchen, got the potholder, put the potholder on his hand and came out into the living room and said, \" I want pizza!!!\" Alone, no instruction, no prompt, NO NOTHING. Completely and utterly independently.  \n Then, Friday night, we took the 3 kids to Target since THE DIVA'S epic love of all things Disney has yet killed another blu-ray player. Boy Wonder does not get to go to Target often.  As Boy Wonder and I stood on line, he kept letting go of the cart and going to look at the  crack  soda cooler. I kept telling him, \"No soda. Hands on the cart, please.\" I finish paying and I hear this crinkling noise. I look and he's smacking a bag of chips on the conveyor belt. I apologize to the woman behind me  for the chip smashing. She says,\"Oh he put those on the belt.\"  I started to laugh. He is standing there all smiles saying, \"Chips please\". Usually he would hand me the bag and say, \"Open chips\" but he put them on the belt. You can't tell me he didn't know we had to pay for them. I know he knew.  \n So maybe he doesn't \"incidentally\" learn as fast as most kids but he does learn and so does Mommy. Even in Target. \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-1FO7JVC9Q8k/TnlQP00c7sI/AAAAAAAAAEw/BysdGXVB-V0/s1600/pizzaboy.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/09/incidentally-x-2.html", "title": "\nIncidentally x 2\n"},
{"date": "Friday, August 12, 2011", "body": "\n We are not only our brother's keeper;  in countless large and small ways,  we are our brother's maker. \n ~Bonaro Overstreet \n They are the two best things that have ever happened to Boy Wonder. They pull him out when he hides. Aggravate him just enough to keep life interesting. Engage him in silly play. To them, just for now, before they are old enough to realize he's different, he is just their brother and playmate.  And I do hope that they realize that he is the best thing that ever happened to them.  They will learn things from him they can not and would not learn any other way.  \n \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-JaEXcNFEo5w/TkVyr0ZUm0I/AAAAAAAAAEE/0YVK2GLBDjA/s1600/girlies"], "link": "http://theadventuresofboywonder.blogspot.com/2011/08/two-best-things-that-ever-happened-to.html", "title": "\nThe Two Best Things That Ever Happened to Boy Wonder\n"},
{"date": "Saturday, October 8, 2011", "body": "\n Editor's note: This was originally published elsewhere in April of 2010.  I'm reposting it here for my mamas who are just getting back into a healthy lifestyle. I'm proud of you.    \n *Inspired in part by  Luau.  Go see  him!   4:07 a.m. Alarm 4:15 a.m. the whir of the elliptical trainer begins and the angry rock music starts blaring from the iPod. 5 minutes in the sweating starts and the demons start to loosen their death grip. 10 minutes in faster I go. Hopelessness just lost his grip. 15 minutes in the sweat starts to pour as I turn up the resistance and raise the incline. Rage falls away. 2o minutes in breathing hard letting go as Sadness gets crunched in the fly wheel. 25 to 5o minutes in the zone. No thoughts other then pushing on and through the fire as my legs burn. 50 to 55 minutes I begin to slow down as   the sky begins to lighten and I hear one or another of my little tribe  of hooligans begin to stir. Why you ask? For my sanity and health so I  can be here for them because who will care for Boy Wonder when I’m gone? I need to be here as long as possible. So I can walk the  walk of a Special Needs Mommy. So I can breathe deeply and calmly when  chaos seems to rule the day. To set an example for my girls that a  strong woman is a beautiful thing and that weak and helpless isn’t cute.  So I push on each and every day for myself but mostly for them.   \n \n ", "outgoing_links": ["http://runluaurun.com/2010/03/08/band-of-runners/", "http://runluaurun.com/"], "link": "http://theadventuresofboywonder.blogspot.com/2011/10/pushing-on.html", "title": "\nPushing On\n"},
{"date": "Wednesday, August 31, 2011", "body": "\n I'm going down, \nFollow if you want, I won't just hang around, \nLike you'll show me where to go, \nI'm already out of foolproof ideas, so don't ask me how \nTo get started, it's all uncharted... \n Uncharted  Sara Bareilles \n What to expect from the upcoming school year? I have no idea but I do know it will be what we make it for the two of them.  Two of them?? Yes THE DIVA is going to preschool. \n The I ain't nothing but trouble grins. \n Cut it out Mom. I'm a cool kindergartner now. Jeesh!  \n  But I'll still be home to entertain Mommy!!! \n Come on September 7th!! We are ready!! (I think) \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-B3wqLrbwKsg/Tl5nYJUMZBI/AAAAAAAAAEI/PGpNpSy9gdQ/s1600/divazoo.jpg", "http://3.bp.blogspot.com/-IAGFyf_enSY/Tl5nmg66g6I/AAAAAAAAAEM/fgD7Vg2FsxY/s1600/bwzoo.jpg", "http://2.bp.blogspot.com/-UQVUif5gVVo/Tl5o94JLPFI/AAAAAAAAAEQ/Gd50ZVWXsCg/s1600/Crazybabygirl.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/08/uncharted.html", "title": "\nUncharted\n"},
{"date": "Friday, October 14, 2011", "body": "\n It's the friends you can call up at 4 a.m. that matter. ~Marlene Dietrich   This time last year I hadn't even met her. No clue she existed. We'd both been invited to an  autism mama gathering . The host let us know we'd both be on the same train and introduced us. We exchanged a   few  lots of hilarious texts. I got on the train in Newark Penn. She was waiting in New York Penn. She keeps telling me I'm going to miss the train. I say I'm on the train. She gets on the train and we act like silly teenagers. Comparing notes and stories. Laughing like lunatics.  \nMy phone rings. It's Big Daddy. He says,\"Sweet Baby Girl ate rock salt.\" I say,\"Um yeah?\" She says,\"Why is he calling you? Tell him to call Poison Control.\" He hangs up and calls back a few minutes later. Poison Control said no big deal. \n Big Daddy then made a fatal mistake which sealed her and I together forever.  Big Daddy says, \"I tasted it. It was really salty.\" Me,\"You tasted what?\" Him,\"the rock salt.\" Me,\" You tasted the rock salt!!!! WTF!! Why?\" C says,\"Your husband ate rock salt!!! WTF!!!\" Cue hysterical laughter.  \n C., you are a smart, amazing, funny, beautiful, talented, loving and compassionate person. I'll be the Ethel to your Lucy anytime. Aunt Jersey to your kids and a thorn in your husband's side.  I've got tarp, a shovel and a chicken. I've got your back like you've had mine.  \n And Dude, MY HUSBAND EATS ROCK SALT!!! \n \n \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-VM4DB6_Fcd4/TpgrJWgArgI/AAAAAAAAAFc/NKKgM0PpKKI/s1600/jerseyqueens.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/10/my-guuuurrrrlllllll.html", "title": "\nMy Guuuurrrrlllllll\n"},
{"date": "Tuesday, October 18, 2011", "body": "\n Words of encouragement give lift to a heavy heart \n I've been forcing myself out the door to run lately. I've been hitting the snooze button. Shaving off a mile here or there. I've been uninspired to run and I've run angry and fearful. That is not the kind of running that I love to do.  I had forgotten  why I started training for this marathon in the first place .  \n But then on Saturday, I was off to visit  the village .  I got off to a late start because of a scary incident with Boy Wonder and finally was off to get  my guuurll, C.  and drive off Thelma and Louise style. (Sorry Brad Pitt does not make an appearance.) And on the Merritt Parkway, I lost it, at 80 mph, because once in a while the enormity of what has become my life can still sneak up and overwhelm me when I least expect it.  And C. keeps her cool and talks me off the ledge because she gets what I'm saying and more importantly, what I'm not saying.  \n C. and I arrive and everyone else begins to show up too. There's hugs and so good to see yous before we all settle in to chat, laugh, cry, coin new catchphrases  (that's a celery flower, bitch) , cheer each other up and umm maybe there was some singing. And but most importantly we talk about our kids triumphs and what they're doing and I'm reminded again who I'm running for because it's not about me. And my friends tell they are proud of me for running for our kids and for me it' so small compared to what they've done for me.  \n  And this morning, I ran inspired on happy feet. Inspired by women, who snort, honk, cluck and moo and who just get it.  And who sent me on my way Sunday morning with a remembrance of what friendship and a giant metal chicken can do. \n \n \n \n \n \n ", "outgoing_links": ["http://stimcity.org/2011/10/17/the-sleepover/", "http://1.bp.blogspot.com/-xzFpmohTlO4/Tp252WSd2II/AAAAAAAAAFk/vqG9Wa48b8Y/s1600/solange.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/10/uninspiredinspired.html", "title": "\nUninspired/Inspired\n"},
{"date": "Monday, November 7, 2011", "body": "\n     View from the Verrazano Bridge \n \nI ran for my hero yesterday. I ran when I wanted to quit because I never let him quit. I ran because I had such a  cheering section going for me on Twitter  that I couldn't let them down. I ran on because  Luau  was waiting to run me in at mile 23 when he'd already finished hours ahead of me. \n \n \n \n At mile 18 I hit the wall . I started saying the names on my jersey over and over again in my head to keep myself going. I had to walk the better part of the next 3 miles. I then saw a shirt that said,  \"Honey Badger Takes What She Wants\"  and I took it as  sign from  the village  to get my butt moving. I ran on because  My Gurl  was waiting at mile 26. \n \n \n \nI ran on because  Super Cuzzy  drove up from DC to support me and take care of my kids. \n \n \nI ran on for all 3 of my little darlings and Big Daddy who haven't seen much of Mommy on Sundays in months. \n \n \n \nand for my best friend D. who loves me and supports me no matter what mess I get myself into on a regular basis.   \n \n \n \n \nBut my biggest reason for never quitting was my hero, Boy Wonder. He is my inspiration for doing all that I do every day. Him and his sisters. \n \n \n \nThank you again to everyone that supported me yesterday. You were all with me at the finish line. I swear. Look here's your medal. \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-Pt9MKv6Mnu8/TrgaGKFTFCI/AAAAAAAAAF8/K9ad63FaZRY/s1600/startline.jpg", "http://mamabegood.blogspot.com/2011/11/cheering-them-on.html", "http://runluaurun.com/2011/11/05/nerves/", "http://3.bp.blogspot.com/-ly7WWtcdZNs/Trgduh9w0XI/AAAAAAAAAGE/4Oh-H21vcMY/s1600/luauandme.jpg", "http://adiaryofamom.wordpress.com/2011/11/07/she-did-it/", "http://www.youtube.com/watch?v=4r7wHMg5Yjg", "http://3.bp.blogspot.com/-62DIlYkyEF4/TrgeRfl3oXI/AAAAAAAAAGM/fCmzhTv59Yk/s1600/sillygurl.jpg", "http://3.bp.blogspot.com/-kTj6FjbiQAI/TrgezJlgxLI/AAAAAAAAAGU/QvmY7A1RhKs/s1600/supercuzzy.jpg", "http://4.bp.blogspot.com/-Iw_exo6YjfU/TrggaDmA3rI/AAAAAAAAAGc/gYgBZ4R56YY/s1600/handsign.jpg", "http://3.bp.blogspot.com/-vbNHL_M3kK0/TrgjKT-F9iI/AAAAAAAAAGk/YcrD_bhPCOA/s1600/jd.jpg", "http://4.bp.blogspot.com/-h7fDwMLwNY0/TrgjhI9sUUI/AAAAAAAAAGs/64ghte9B9g8/s1600/superboy.jpg", "http://2.bp.blogspot.com/-0rt_n-SD9t4/Trgkl28pS5I/AAAAAAAAAG0/kOYqTN0BCKg/s1600/medal.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/11/my-hero.html", "title": "\nMy Hero\n"},
{"date": "Tuesday, October 4, 2011", "body": "\n It..... happened.....  in....  the......  blink..... of.....  an.... eye!!!!! Six!!!! \n Happy 6th Birthday to our Amazing Boy Wonder!  We Love You!! Mommy, Daddy, THE DIVA and Sweet Baby Girl  \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-hoIkirrzcVk/TokC4O5XK6I/AAAAAAAAAE4/Zhh6b2N5IDk/s1600/Devin+Birth+Day.jpeg", "http://1.bp.blogspot.com/-UdzFvAXSlys/TokC91BWvMI/AAAAAAAAAE8/S97xgjdYURQ/s1600/Devin+First+Bath.jpeg", "http://2.bp.blogspot.com/-AbdA6woPQ-M/TokDAl8VTJI/AAAAAAAAAFA/W-RDhUdXwC4/s1600/Devin+Age+1.jpeg", "http://2.bp.blogspot.com/-S5t36cUsNXQ/TokDDcEcvxI/AAAAAAAAAFE/nKWZZxs7mtg/s1600/Devin+Age+2.jpeg", "http://1.bp.blogspot.com/-jnyj_r1O_7I/TokDFgbb6hI/AAAAAAAAAFI/GmZcWZ6dZSs/s1600/Devin+Age+3.jpeg", "http://4.bp.blogspot.com/-OWZWRQddsF8/TokDIiEMfII/AAAAAAAAAFM/O0YkMHDxcAQ/s1600/Devin+Age+4.jpeg", "http://4.bp.blogspot.com/-EdiTwI-psi8/TokHkveGEZI/AAAAAAAAAFQ/mKNWkggbn2g/s1600/5thbday-1.JPG", "http://3.bp.blogspot.com/-YYdKn25X_Vg/TokJKDiGXYI/AAAAAAAAAFU/cpPcKjJsq2Q/s1600/295912_10150309871337555_722327554_8026161_310791354_n.jpg", "http://2.bp.blogspot.com/-b7iqKY_Evpk/TokJMCFV-4I/AAAAAAAAAFY/-Lhmo4-QLow/s1600/340036_10150308578307555_722327554_8015621_1632420302_o.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/10/six.html", "title": "\nSix\n"},
{"date": "Wednesday, November 16, 2011", "body": "\n Ed. Note. This post originally appeared elsewhere back in January  2009. I am re-posting it as a reminder that while I may struggle  and  I have struggled more then usual lately, that Boy Wonder is happy 98% of the time.  This is way more then can be said of most of us.   His happiness is all the matters. My selfish expectations do not matter as much as his happiness.  \n             \n     Autism Autism Autism Autism Autism Autism Autism Autism \n \nThat  awful word that beats in my head all day long from the moment I wake up  till I go to sleep, if I sleep at all. It's always here sometimes louder  then others, sometimes barely a whisper but always with me.  \n \nI  am never distracted by other things enough to ever forget it. Autism.  While I'm watching a movie. Autism. While I am in a meeting at work.  Autism. While I am out with friends for a drink. Some days, it fills me  with despair. Other days, it fills me with a rage that scares me.  \n \nIt  affects every aspect of my life. It has changed me in a way, that  divorce, death of a family member and other hard knocks have never been  able to change me.  \n \nIt has shaken me every day over and over for  the past year. The well meaning things people say make me want to scream  some days. He'll be okay. He'll come out of it. Oh really, may I see  your crystal ball?  \n \nBut just when I am at my most wretched and  worst, Boy Wonder will give me a gift. He looked at me this morning with a  huge smile on his face and said \"Happy!!! I HAPPY!\" \n \nYes, you are my most darling little boy! That's what I need to remember that in spite of Autism you are a happy boy!  \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/11/happy-revisited.html", "title": "\nHappy Revisited\n"},
{"date": "Tuesday, November 15, 2011", "body": "\n \n \nYou go to the hospital or maybe the adoption agency and you go up up up in the elevator. Several hours or days later you come down and they let you leave with this brand new little person and you yourself are a different person. You aren't just you anymore but Mommy. You  think,\"What the Hell? They're letting me leave? I don't know what I'm doing.\" There's no instruction manual. But you figure it out and you make good choices and bad choices. The good choices you keep. The bad choices are easily fixed. You adjust. \n \nAnd then a few years later, you go to a different hospital.  You go up up up in the elevator. You fill out forms asking all sorts of questions about your baby's development. Your perfect precious baby. You go into see the doctor. Your perfect precious baby is so profoundly disabled that the doctor doesn't even need to finish the test. You go down down down in the elevator. You aren't just Mommy anymore but a Special Needs Mommy. You were just brutally hazed in to  the club. \n \nAnd again, you think,\" What the Hell? They're letting me leave? I don't know what the fuck I'm doing.\" There's no instruction manual. Now you doubt all your choices. Any decision is agony.  You worry about making bad choices because now you know the bad choice could make it so he's never independent. Or the choice between a group home or an institution when he's older. Or whether he'll speak or never speak. Or interact or rock in the corner. Or be sweet and loving or aggressive and violent. He can't tell you if he's cold, hurt, sick or if someone  did something unspeakable.   \n \nAnd you ride the elevator every day. Some days it goes up and some days it goes down. You just hope you're getting off on the right floor.\n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-18uut4Q-P1A/TsKHnOzTfFI/AAAAAAAAAIk/eiKGmAnmfG8/s1600/elevator.jpg", "http://adiaryofamom.wordpress.com/2009/05/01/welcome-to-the-club/", "http://downersgrove.patch.com/articles/sexual-abuse-and-the-developmentally-disabled"], "link": "http://theadventuresofboywonder.blogspot.com/2011/11/elevator.html", "title": "\nThe Elevator\n"},
{"date": "Thursday, November 3, 2011", "body": "\nI ran my last 4 miles this morning until the 26.2 mile run on Sunday. I was asked last night if I really planned on finishing last night. The answer to that question is YES. I will finish because I'm running for: \n \n The mamas who gave up their careers when the diagnosis hit. \n The mamas who had to work harder at their careers to provide for their child(ren) with autism. \n The mamas who would never speak up and now roar like lions when someone messes with their child. \n The siblings who get so much less of our time and attention because of autism. \n The naysayers who tell us all the things our kid  will never do  and yet  our kids prove them wrong . \n The ones who believe our kids can do most things if given the opportunity and tools. \n My friends in  the rabbit hole.  (Stop hogging the tequila.) \n For the  Daddy that dyed his hair blue .  \n For those  who are mad at God . \n For those  whose faith in God  carries them through the tough times.  \n For those  who send their solider off to war  and  fight the battle at home alone .  \n For those who have paved the way in getting laws passed to provide for our kids. (Thank you Judith!) \n But I am running mostly for hope. For  my own hope for the future  and  for my fellow mamas hopes for the future. \nI do know that  I am never alone  and I also know that autism is no longer  an invisible disability.   \n \nTo all my family and friends and friends I consider family, thank you for your support and for believing in me and my son. I love each and everyone of you.  See you at the finish line.\n \n ", "outgoing_links": ["http://adiaryofamom.wordpress.com/2011/11/03/the-rabbit-hole-2/", "http://runluaurun.com/2011/10/17/elevator-pitch/", "http://runluaurun.com/2011/10/21/fail/", "http://rhemashope.wordpress.com/2011/10/31/in-the-cave/", "http://stimcity.org/2011/03/26/retirementfree2/", "http://rhemashope.wordpress.com/2010/08/27/one-year-later-a-father-and-his-girls/", "http://4.bp.blogspot.com/-m7w2TgnjuBA/TrLPlLxZ_-I/AAAAAAAAAF0/Umo4brq7I5c/s1600/jersey2.jpg", "http://2.bp.blogspot.com/-CC73Uv9OWdU/TrLPkNw_7cI/AAAAAAAAAFs/awBEiUmg0aA/s1600/jersey1jpg.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/11/finish.html", "title": "\nFinish\n"},
{"date": "Wednesday, October 26, 2011", "body": "\n initiate  -  to cause or facilitate the beginning of :  set going play - a recreational activity especially: the spontaneous activity of children \n   Mommy  Mommy I want to play Ring Around the Rosie,  Ashles Ashles  (DIVA speak,  not a typo) we all fall down is the DIVA's new favorite game. She wants  to play with everyone. No one is spared a turn. Not even Boy Wonder.  \n In  3 days, she taught him how to play Ring Around the Rosie. He laughs and  holds hands and turns in a circle. He loves it. He loves it so much  that when the DIVA decided she was done playing the other day, he walked  up to Big Daddy and said, \"I want to play, please.\"  \n Late by 4 years, he has hit his developmental milestone of initiating play. Better late then never. \n \n \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["rtsp://v8.cache1.googlevideo.com/ChoLENy73wIaEQm43oZ1PL7MTBMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://theadventuresofboywonder.blogspot.com/2011/10/initiate-play.html", "title": "\nInitiate Play\n"},
{"date": "Monday, November 21, 2011", "body": "\nSo today's my birthday. Yes yes thank you. I was going to write about how I am so ready for a change. That it's rarely too late to chase your dreams. To make a change, defy people's expectations of you, how I can't believe how much change has gone on and that I'm registering for college classes for the first time ever next Monday.  But then my friend, A. from over at  Try Defying Gravity  (Go read her blog) posted this on my Facebook page. \n \n \nSo my unexpected gifts always go back to the incredible friendships that I would have never ever had. It's taught me to really see people. Not what they just might be showing but what's underneath the surface.  I'm grateful for all for my autism mama friends, the ones close to home and the ones spread out across the country. We are a diverse group but we all get one another and appreciate each other's differences. I would choose for our kids to never struggle the way that they do but I  am so proud, grateful and blessed to call each and everyone of you my  friend.  \n \n Ed. Note: A. would like you to know that she really doesn't want to hit me but she would however like to  smell my eyeballs.   Hey to each their own.  \n \n ", "outgoing_links": ["http://trydefyinggravity.wordpress.com/", "http://3.bp.blogspot.com/-eC8kVRsL1cM/TspSo04wutI/AAAAAAAAAIs/IbmuppXB7IE/s1600/birthday.jpg", "http://thebloggess.com/2011/09/it-kind-of-feels-like-a-hollow-victory/"], "link": "http://theadventuresofboywonder.blogspot.com/2011/11/unexpected-gifts.html", "title": "\nUnexpected Gifts\n"},
{"date": "Monday, December 19, 2011", "body": "\nIt's been building since the  4 year anniversary of Boy Wonder's diagnosis . The demon chases me daily. I tried to outrun it. I tried to excessively clean the house to tame it. I tried disappearing. But it followed me relentlessly. It waited patiently for my defenses to be decimated by the unexpected death of a childhood friend, the sinking realization that Boy Wonder outgrowing his diagnosis is gone and the loss of a support person I'd come to rely on. \n \nI started to cry Friday night and I couldn't stop. Saturday and Sunday brought more of the same. This morning at spin class, I started to cry, got off the bike in the middle of class and texted Big Daddy that I needed help. I needed to go to the emergency room. The wheels had come off the wagon. I waved the white flag. \n \nThe ER doctors were not helpful. Someone who is crying, shaking, hasn't slept or eaten in over 3 days and clearly not an addict needs help. Because I wasn't willing to kill myself anytime soon, they sent me off with an appointment with a therapist in two weeks. Not helpful especially when  you are not a ask for help kind of girl . So off to the GP, where I got to sit in the waiting room while Big Daddy sheltered me from those staring as I cried on and off for 3 hours.  So for now, I have a contingency plan to get me through the next two weeks.   \n \nI will get better. For myself because I'm a survivor. For my family because they need me. For those who are coming up fast and furious behind me as the rate of autism continues it's astronomical rise. Because I do have faith that the things and people I've lost will turn up again someday.  \n \nThank you to my village for all the love today. You always show me the light at the end of the tunnel. \n \nAnd D., my ever loving loves me as I am friend, you're my rock.  \n \nIf you feel like you can't go on or you're alone. You aren't. I promise. Ask for help. I did and I'm glad even if I had to jump through hoops to get it. \n \nAnd yes the hospital administrator will be getting a letter when I am my old fresh self again.\n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/12/waving-white-flag.html", "title": "\nWaving the White Flag\n"},
{"date": "Monday, December 12, 2011", "body": "\nagainst windows of opportunity closing. \n \nagainst a progress report that makes no sense. \n \nwith a map that makes no sense because there is no direct route from point A to point B with autism. \n \nagainst discrimination. \n \nagainst underestimating Boy Wonder. \n \nagainst self-doubt and self-blame. \n \nagainst those who are opposed to children and adults with autism getting the services they need. \n \nOR  \n \nto be ready for windows of opportunity. \n \nfor real progress. \n \nfor a concrete plan of action that will get us from point A to point B. \n \nfor acceptance. \n \nfor helping Boy Wonder reach his full potential. \n \nfor hope and belief in the future. \n \nfor advocating endlessly to get children and adults with autism the services they need. \n \nI needed a reframe after a miserable progress report and a miserable trip to Toys R Us trying to figure out what to get Boy Wonder for Christmas.   Some days it all comes together and some days it all falls apart.\n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/12/race-art-of-reframe.html", "title": "\nThe Race (The Art of the Reframe)\n"},
{"date": "Wednesday, December 21, 2011", "body": "\n \n \nI wish you all a wonderful Holiday Season. My wish for all is that you find the courage, strength and faith to pursue the things that will make you happy and bring you peace.\n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-LHCpPZdb9ac/TvHZAKCuIHI/AAAAAAAAAKw/JkyGxEZJ7Jc/s1600/holiday2011.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/12/happy-holidays.html", "title": "\nHappy Holidays\n"},
{"date": "Wednesday, November 9, 2011", "body": "\n4 years ago today, at 2 years 1 month and 5 days old, Boy Wonder was diagnosed with autism. When we left for the doctor's office that day, we weren't expecting to hear those words. It was the first time I ever felt real fear and sorrow. I remember crying hysterically and the doctor telling Big Daddy,\" She needs to get herself under control before she hurts herself and the baby she's carrying.\"   These are the things I wish I knew the first year. \n \n The first year sucks but you'll find  Jess ,  Judith ,  Jeneil ,  Pixie  and  Tanya . They get you through it.  \n Some people disappear. Some come back but many do not. You make  new friends  though.  \n D. sticks by you. She gets Boy Wonder. She remembers this day every year and makes sure to call you.   \n That there's always room in  the rabbit hole  for just one more and there's always a hand to pull you out.  \n Big Daddy goes to every meeting concerning Boy Wonder. EVERY MEETING. You never face the firing squad alone. \n When the doctor said BW would never talk,  HE WAS WRONG .  \n When he said he would never show love,  HE WAS WRONG .  \n When he said he'd never initiate play,  HE WAS WRONG .   \n The baby, you're carrying,  THE DIVA , she's fine.  \n And the Surprise,  Sweet Baby Girl  who comes along just 22 months after THE DIVA, she's fine, too. \n You'll  finish  a marathon in  Boy Wonder's honor  and  his buddies from across town and across the country .  \n You find  the village . The sister mamas. The ones who tell you and who you tell when things go awry, you'll make it ok.  \n But what I really wish I knew on that awful day was that in the end, I'm strong enough to make it ok for my Boy Wonder, and his sisters. I may have to  ask for help  along the way but I will make it ok because there is no other choice.   \n \n \n \n ", "outgoing_links": ["http://adiaryofamom.wordpress.com/", "http://autismville.blogspot.com/", "http://rhemashope.wordpress.com/", "http://imapixiemama.blogspot.com/", "http://teenautism.com/", "http://adiaryofamom.wordpress.com/2011/11/03/the-rabbit-hole-2/", "http://2.bp.blogspot.com/-J3bU_6f8j6Y/Trqlvn0UB-I/AAAAAAAAAHE/IjZQJfjhJmw/s1600/bw2yo.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/11/youll-make-it-ok.html", "title": "\nYou'll Make It Ok\n"},
{"date": "Friday, December 23, 2011", "body": "\n   Editor's Note: This post originally appeared elsewhere in December 2008. While I now I have a much clearer idea of what Boy Wonder's future holds and the knowledge that the miracle of recovery is just about gone, I do have hope that we can help him reach his full potential. Like every child he does have a lot of potential and its my job to make sure he reaches it.    Dear Santa,  \n I think you know what I want for Christmas. Yes, world peace, an end to  the insanity of terrorism and genocide and a nicely rebounding economy  would be nice but really I want the one thing I can't have. So  instead how about a little glimpse of ten years down the line? Just so I  know what's going to happen. Good, bad or indifferent I can take it.  It's the not knowing that wakes me up at night.  \n \nSo I know I am  most likely on the naughty list but hey I usually do use my evil powers  for the greater good. So how about it Santa? Just a five minute peek  into the future 10 years down the line. I'll leave you an extra big  cookie this year and homemade hot cocoa with a little kick to it. \n \nLove, \n \nJersey But what I would write this year...... \n \n Dear Santa, \n So hey I didn't get my peek all at once when I asked, you revealed it gradually over time just what I can mostly expect. You are a smart man, Santa. When I asked to know how this  whole autism thing was gong to play out, you knew I wasn't ready to know just how hard it was going to be. So how about you just get to work on that hope, love and happiness thing? That's what would work. I'm doing my part but if you could kick just a little Christmas magic my way, I'd be eternally grateful. I'm off to make your cookies. THE DIVA is helping. Don't worry I made her wash her hands.  \n Love,  \n Jersey Editor's Note #2 I also highly recommend checking out the  Weekly Whirl-Our Favorite Holiday Blogs . I'm proud to call several of the bloggers close friends . \n \n ", "outgoing_links": ["http://blog.autismspeaks.org/2011/12/23/ww-3/"], "link": "http://theadventuresofboywonder.blogspot.com/2011/12/dear-santa-remix.html", "title": "\nDear Santa The Remix\n"},
{"date": "Friday, December 30, 2011", "body": "\nSo you know how when you meet someone for the first time, whether it's a blind date, job interview or whatever someone walks past you and you think,\" Please God let that not be the person I'm  here to see.\" Yes well I went to my first therapy (Dear God why the fuck am I admitting this shit? I don't talk about my feelings, sex or body parts. Jesus!!) and as I walked down the hall this elderly and yes she's an elderly lady, who was clearly related to Dr. Ruth, walked past me and I thought, \"well I already know God's not in  my fan club. Watch that be my therapist.\" \n \nGuess who was my therapist???? \n \n \n \n \n \n \nAnd I just laughed when I got outside and asked the Sister Mamas,\"Did you bitches have me punked? The therapist was like Dr. Ruth's sister!! OMG!!\" \n \nOH and just so you know inappropriate laughter does not help your psych eval but it did let me know that I am on my way back to my irreverent, find myself funny self which is who I have really missed.   \n \n Ed's Note: For all those who tweeted, texted, emailed and phoned me to offer their love and support while I lost my shit. Thank you. If you need help ask for it. It gets better.  \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-20v5gNfiXsU/Tv5dTu_hM7I/AAAAAAAAAK8/rn9NtyFFVnk/s1600/DrRuth2-1.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/12/another-reason-why-i-dont-do-shit-or.html", "title": "\nAnother Reason Why I Don't Do Shit or God Laughs At Me\n"},
{"date": "Tuesday, January 17, 2012", "body": "\n \nBecause I can't take care of the 3 maniacs if I can't take care of myself. \nBecause the last 6 months nearly broke me. \nBecause the years are short but the days are long especially when you are a special needs mama.  \nBecause I have things going on that are difficult that I can't share just yet. \nBecause I could, I ran away for the weekend and sat by the pool with  my lovely wonderful friend.  \nI needed it. I feel like I can draw a deep breath and I'm ready for whatever 2012 is going to throw my way. \n2012 is the Year Of The Oxygen Mask Project. Do something for you. I did and it feels really really good.  \n \n \n Ed. Note: To learn more about the Oxygen Mask Project, please  click here.   You can also follow the Oxygen Mask Project on Twitter @OxygenMaskProj.  Y ou can also visit their Facebook page at The Oxygen Mask Project. \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-3WQrfLuu6PQ/TxXF4LhR91I/AAAAAAAAALE/DaGq8J1ByjE/s1600/feetbythepool.jpg", "http://adiaryofamom.wordpress.com/2012/01/13/i-really-am/", "http://oxygenmaskproject.com/about/"], "link": "http://theadventuresofboywonder.blogspot.com/2012/01/yearoftheoxygenmask-or-i-ran-away-for.html", "title": "\n#yearoftheoxygenmask or I Ran Away For The Weekend\n"},
{"date": "Thursday, January 19, 2012", "body": "\nBoy I've been a whiny mess lately. Jesus. Time to pull up the boot straps. Ok here is what Boy Wonder has been up to lately. Ready? \n \nOk big one first, he is starting to take himself to the bathroom at home to umm pee unprompted. Yes!!!! He toilet trained himself for um \"Code Brown\", as  Judith  and  Jeneil  call it, years ago.  \n \nNo matter what he asks for he always says please at the end unlike THE DIVA  and Sweet Baby Girl who just say NOW!!! \n \nHe is mastering out of programs at school weekly and he is showing an interest in reading. This is huge but ya'll get that right?? \n \nThe hand biting has almost completely disappeared and his hand has healed.  \n \nHe is learning to ride a bike and he loves it. \n \nHe is trying new foods unprompted. He ate Big Daddy's egg salad. I'm not personally a fan but hey he tried something new that wasn't candy or chips. \n \nHe has his first loose tooth and he is tolerating it well. \n \nHe is initiating playing ring around the rosie and tag with the girlies more and more. \n \nThere's plenty more but these the big and small things that have brought me a lot of joy and hope over the last few weeks.  \n \n \n \n ", "outgoing_links": ["http://autismville.blogspot.com/", "http://rhemashope.wordpress.com/", "http://4.bp.blogspot.com/-yKK9YPERQ3k/Txgyj67ZTOI/AAAAAAAAALM/bZ5y40Zr97s/s1600/xmasbw.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/01/oh-wait-this-blog-is-suppose-to-be.html", "title": "\nOh Wait This Blog Is Suppose To Be About Boy Wonder or Pay Attention Mommy\n"},
{"date": "Monday, January 9, 2012", "body": "\n It takes strength to survive; It takes courage to live. Strength and Courage ~David L. Griffith   The winds of change are blowing wild and free. Make You Feel My Love ~Bob Dylan \n 4 years ago, Boy Wonder was diagnosed. All we've done is survive since then. There's been ups and downs. There's been joy and sorrow. There's been 2 steps forward and 1 step back but we've been in crisis mode. We can't stay here anymore. I can't stay in crisis mode anymore. I also can't be Mommy or Autism Mama all the time anymore.  \n I will never be the blissfully ignorant, happy go lucky person I was once upon a time. The past 4 years have taught me too much about judgments, incorrect perceptions, empathy, acceptance, patience and love. We aren't who we were pre-diagnosis.  \n  So I'm choosing to make changes. I start college this month. I'm looking to go back to work.  I'm practicing forgiveness of myself and others. I'm thinking seriously about what would make me happy no matter what other people may think.   \n It's time to stop surviving in the land of what could've been and time to accept what is and go after what would make all of us happy. Everyone deserves happiness. I just have to let go.  \n \n \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2012/01/time-for-change.html", "title": "\nTime for A Change\n"},
{"date": "Monday, December 26, 2011", "body": "\n Surprise is the greatest gift life can grant us. ~Boris Pasternak \n \nI wrote about   My Surprise   last year.  She still surprises me every day. She is a developmental  milestone ass kicker. She is funny and finds herself funny. She is  speaking in full sentences. She can tell me if she is mad, sad or happy.  And Sweet Baby Girl loves you hard. She is the lovingest squeeziest  baby girl ever. She lives up to her Sweet Baby Girl nickname. I would  love to go back to the scared shaken moment when I found myself very  very unexpectedly pregnant with her and whisper to that woman, \"She will  bring you so much joy. She is the sister THE DIVA needs desperately.\"  And now My Beautiful Surprise is TWO. \n \nHappy Birthday, Sweet Baby Girl. You are TWO in all it's funny, silly, smart, loving and beautiful glory. \n \n \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2011/12/my-surprise-is-two.html", "title": "\nMy Surprise is Two!!\n"},
{"date": "Friday, February 17, 2012", "body": "\nAnd as I finished up training for the NYC Marathon last year, I said never again. I ran it for  all the right reasons  and with tons of support but it was long long months of training and hours spent doing long runs on Sundays but the excitement in the runner's village was contagious.  So I thought to myself well just maybe I'll do it again next year but then I hit mile 18. Mile 18 was my breaking point. I was tired with 6.1 miles to go but I checked my twitter feed and  holy freaking cheering section.  And of course I had the  famous Luau waiting for me at around mile 23.   So I ran on because letting  my hero  down is never ever an option and I  always finish what I start . \n \nSo I finished and I was sore for a few days. I started to think well why not run it again? But I put it on the back burner while I started school and had a few other things going on. But then I got inspired by MrsSgm who decided she'd kick a  little Congressional butt I mean brief them on military families living with autism  and then go on a  national TV show  and ya know tell the nation what's going on.  And my friend who is starting a non profit tennis academy for kids with autsim. Or always Judith who fights for healthcare reform nationwide for her son, my son and everyone else's sons and daughters living with autism. Or Jess who speaks out  with eloquence and class for our comm unity on a daily basis. And all the other mamas who have done so much for all our kids. \n \nI have been blessed by the people who have been on the road ahead of me. They have blazed the trail through a scary forest. They have reached back, grabbed my hand and pulled me forward. They have welcomed me into the village. Now it's my turn, I can reach back and pull someone forward. I can tell them you'll get there. Maybe not in the most direct route, there will be twists and turns and uphill battles and oh watch out for the rabbit hole.  But you are never ever alone . \n \nSo in honor of these amazing people and their sons and their daughters, I decided to really get my crazy on and because ya know  Luau likes as many of us to participate in his crazy  as he can convince to join him, I'll be running the Boston Half Marathon (click > HERE < to donate) on September 16 and then the NYC Marathon (click > HERE < to donate) on November 4 for Autism Speaks. If you are in a position to donate please do so and if not you can just cheer me on on Twitter. \n \nYou can make a difference in this community but only you can figure out how to do it in a way that matters to you the most. This is my way of giving back. What's yours?\n \n ", "outgoing_links": ["http://mamabegood.blogspot.com/2011/11/cheering-them-on.html", "http://runluaurun.com/2011/11/17/new-york-city-marathon-2011/", "http://stimcity.org/2012/02/02/the-briefing/", "http://stimcity.org/2012/02/04/andrea-mitchell-reports/", "http://adiaryofamom.wordpress.com/2011/04/23/game-on/", "http://runluaurun.com/2012/02/14/i-want-you/", "https://www.kintera.org/faf/donorreg/donorpledge.asp?ievent=1003931&supID=337218711", "http://events.autismspeaks.org/faf/donorReg/donorPledge.asp?ievent=1003934&lis=1&kntae1003934=55BEC3A7D1054E25AE94AE3404B84657&supId=337218711"], "link": "http://theadventuresofboywonder.blogspot.com/2012/02/paying-it-forward-with-131-and-262.html", "title": "\nPaying It Forward with 13.1 and 26.2\n"},
{"date": "Sunday, February 26, 2012", "body": "\nSo I took THE DIVA  to Princess Tea Birthday Party yesterday. I got to sit and watch her play withe classmates and learn how to drink tea with her pinky out. The mom had her younger sister and her friend helping out doing hair, makeup, nails and how to act like a princess lessons. THE DIVA kept cracking up the sister's friend. She came over to tell me how much she enjoyed THE DIVA. We chatted a bit. She tells me she is a part time nanny and babysits as well. She also tells me she is an aide at Boy Wonder's school. I'm thinking ooo babysitter as our current babysitter is pregnant and we will need a back up. I ask her if she knows Boy Wonder. Her face lights up and she says oh he's so sweet and such a cutie. Then she says oh you probably know my mom!!! I ask who her mom is. Guess who?? THE SPECIAL ED DIRECTOR. \n \nAnd there you have it reason 8,679 why God loves to mess with me. \n \n \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-mLoTpLY58rY/T0quBWBtLPI/AAAAAAAAALc/ATdOLkcs9ZE/s1600/422807_10150570890587555_722327554_9020947_826526858_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/02/and-yet-more-proof-that-god-loves.html", "title": "\nAnd Yet More Proof That God Loves Messing With Me\n"},
{"date": "Thursday, January 26, 2012", "body": "\n Editor's Note: This post originally appeared elsewhere in March 2010. While our sleep issues have mostly subsided, the Tasmanian Devil is a rare sight these days, and Boy Wonder is far more present, a lot of this is still true. ~J \n \nSome days it's like having a ghost in the room. You can see them but you can't touch them. They can't hear you. \n \nOther  days, it's like someone dropped off a Tasmanian devil. A whirling,  stimming, running, jumping yelling dervish who leaves a path of  destruction in their wake. \n \nEvery day, a constant worry about their  future and selfishly your future cause you sure as hell didn't sign on  for this shit.  Some days the worry is manageable and on the bad days  it's paralyzing. \n \nWondering if something happens to you who will  care for and love your child because you know there are very few if any  people willing to do it. \n \nWatching the news and wondering what  you'll do if your child ever gets so violent your life and that of your  other children could be at risk and praying it never gets to that point  or become the mother who is so overcome she overdoses her child on  medication and kills him. \n \nCringing when you hear other parents  complain about the budget for special education kids in your school  district and kind of wishing you were still that ignorant but knowing  you are a better person now. \n \n1:00 am wake up calls followed by another at 2:30 am and 5:00 am because God forbid we sleep through the night. \n \nYou get to have some one come to your house 6 days a week to give your child therapy. \n \nBut there's  progress, love and hope .  Progress  because you never let up on him EVER.  Love  because he's your child no matter how God made him and when he looks you right in the eye and smiles it's all worth it.  Hope  that all this hard work will pay off in a miracle. \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-Z_vcve082Og/TyFlW7LzASI/AAAAAAAAALU/-ldP7fjbpP8/s1600/DSC00972.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/01/what-its-like-to-have-child-with-autism.html", "title": "\nWhat It's Like To Have A Child With Autism\n"},
{"date": "Sunday, April 1, 2012", "body": "\n \n   Even hundredfold grief is divisible by love.  \n \n  ~Terri Guillemets \n \nIt's a never ending cycle of grief and acceptance when you are raising a child with autism. We celebrate every hard earned skill, every spontaneous expression of love, spontaneous appropriate speech, in this house that'll get you a cookie. You accept that this is your child. You love them unconditionally but once in a while you visit Whatifville, the alternate universe that really never existed for you. \n \n \n \nIt sneaks up when you drop your NT preschooler off at school and you see all the NT kids out at recess running around and playing with their friends and you see the door to school open and watch your son's class come out each of them having their hand held by their one on one aide. Or when your 2 year old can say I sooooo mad Mama!!! Yet your 6 year old just sits and cries and you have no idea why. Or your 4 year old can write her name and your 6 year old can't. The grief takes you right to Whatifville. What if he didn't have autism? What if he didn't have to struggle so damn much? But you love him and those big brown eyes. That enticing smile. The delicious giggle. The way he says so haltingly in a voice barely above a whisper,\" I want up Mommy, please.\" So you pick up your 80 lb child who is too big and too old to be held but you pick him up and hold on tight because whatever makes him happy makes you happy. And you accept his unconditional love because you love him back unconditionally and in that moment when hold you first born the grief falls away and all that is left is pure love.  \n \n \n \n \n \n \n \n \n Editor's Note: April is Autism Awareness Month. Our house will be lit up blue. You can light yours up too. Blue light bulbs are available at your local Home Depot.  \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-51rOFp7XrsQ/T3hmf6k379I/AAAAAAAAAMM/JwjseLOMU5c/s1600/564734_10150634249982555_722327554_9251506_1886719075_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/04/cycle-of-grief-and-acceptance.html", "title": "\nThe Cycle of Grief and Acceptance\n"},
{"date": "Thursday, April 5, 2012", "body": "\n \n \n \n \n \nTwo little girls.  Blonde haired, blue eyed, silly, giggly, fun, smart, hilarious, gorgeous girls. They like a lot of the same things. Mommy's Little Ponies aka My Little Ponies, baby dolls, their doll house, to swing high and fast, be Mommy's backseat drivers (too fast, faster, slow down, stop sign, go the other way). But they are different too. One calls me Mommy, the other calls me Mama. One loves all things girly. There are not enough hairbows aka headbands, jewelry, dresses or fancy shoes in the world. She loves to dance. Watch me twirl Mommy,  now I'll take a bow!! If it's got a Disney Princess on it or in it, it's for her. The other one is all about her sneakers so she can run fast, whether it's a dress or jeans the sneakers go on the little feet. Mama, catch the ball and now throw it to me.  Yay Me!!!! I catched it Mama. Did you see me, Mama? She'd rather watch Mike the Knight instead of Disney Princess movies.  \n \nI took my two delicious little girls to have their birthday photos taken the other day. One was all about the fancy shoes. The other one cried until I caved and let her but on her sparkly fast sneakers. I didn't make her take the sneakers off for the pictures. I wasn't trying to have my friend, Cher, capture some moment of false perfection. I wanted her to capture my girl's distinct personalities. There will be enough people in this world who try to change my girls and it won't be me. I want them to be unique in whatever way they choose. If that's sneakers or fancy shoes, well, you be you, baby girls, cause Mommy/Mama loves you for you.  \n \n \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-nnYODpM7_9s/T33TAx0Xx_I/AAAAAAAAAMc/jzfT1ccDYNg/s1600/photo-4.JPG", "http://4.bp.blogspot.com/-L2IG-98rbf4/T33S0u_qdRI/AAAAAAAAAMU/Nd8Ihg_gNqo/s1600/photo-3.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/04/you-be-you.html", "title": "\nYou Be You\n"},
{"date": "Friday, April 27, 2012", "body": "\nSweet Baby Girl, my third and last, does not get much undivided attention. She naps in the afternoons after I  shove DIVA out of the car without coming to a complete stop  drop DIVA off at school. If she's lucky she'll get 15 minutes of me all to herself here and there. But the week of Spring Break, Big Daddy took Boy Wonder and DIVA off to California to visit their cousins, aunt and Achie and Papa. It was just me and the Littlest. We played whatever she wanted when she wanted. Oh Sweet Baby Girl watched Mike the Knight on repeat without someone (DIVA) screaming, \"I need to watch some princesses RIGHT NOW!!!\" We played in the backyard. We snuggled without sharing Mama's lap. We took walks holding hands. But our favorite day was our adventure at the zoo. Ready for some pictures? \n \n \n \n I'm ready to get wild!! \n \n \n \n We are waiting for the train.  \n \n \n \n \n Let's get on with the chugga chugga choo choo already! \n \n \n \n \n \n Hi Mr. Sea Lion \n \n \n \n \n I got your cheese Mama!!! \n \n \n \n \n Oh Mr. Lion what big teeth you have!! \n \n \n \n \n but Mr. Elephant's teeth are waaaay bigger!!! \n \n \n \n \n There's paparazzi so I must wear my sunglasses while I lunch!!! \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-OzZAo-FWw0g/T5sdqGoO2vI/AAAAAAAAAM0/_av6DVmkpfk/s1600/IMG_3737.jpg", "http://4.bp.blogspot.com/-1GKZpd9ZDzE/T5sdacmS_-I/AAAAAAAAAMk/GVBpIbmtiGM/s1600/IMG_3733.jpg", "http://1.bp.blogspot.com/--XLU_J-5kz4/T5sdhDWVfLI/AAAAAAAAAMs/XK5X_qn5xBc/s1600/IMG_3734.jpg", "http://4.bp.blogspot.com/-_cEBRLckvBw/T5sdtr9i9vI/AAAAAAAAAM8/JMPHPlNa3p4/s1600/IMG_3738.jpg", "http://3.bp.blogspot.com/-lPz86ce5Tws/T5sdzXE0QBI/AAAAAAAAANE/23Lg4OfkuC4/s1600/IMG_3739.jpg", "http://2.bp.blogspot.com/-neegzk5cNqw/T5sd44VyhDI/AAAAAAAAANM/jiRBmUcW4f4/s1600/IMG_3740.jpg", "http://1.bp.blogspot.com/-zcBA5AGbFo0/T5sd9TR7TpI/AAAAAAAAANU/03eBJIq0n6c/s1600/IMG_3741.jpg", "http://1.bp.blogspot.com/-fdG6Jd0_81c/T5seDfmxHyI/AAAAAAAAANc/OgaBLBiM2Ac/s1600/IMG_3742.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/04/fun-with-only-one-i-forgot-how-easy.html", "title": "\nFun With Only One (I Forgot How Easy Just One Is)\n"},
{"date": "Friday, January 27, 2012", "body": "\n  Editors note: This originally appeared elsewhere for THE DIVA's 1st Birthday. As I watch her rapidly approach her 4th (how did that happen) Birthday, I remembered this post. It's one of my favorites.  Because as much as she is being all sass and brass tacks lately, she is really and truly a blessing.  \n \n \n \nLate in July 2007, my cousin U. came to visit me. I was in  probably the best shape of my life. Boy Wonder had yet to be diagnosed but I  knew something either wasn't right or I was a really shitty mother as he  didn't seem to like me. While U. and her daughter K. were here,  I came close to fainting a few times. U. said to me,\"Maybe you're  pregnant!\" I said, \"Maybe I'll slap you.\"  \n \nI tell Big Daddy what U. said and we laugh until I start counting. So I take a pregnancy test and get this..... \n \n \n \nUnexpectedly pregnant!!! Oh shit! I was thrown for a loop but quickly accepted it which led to this....... \n \n \n \nOn  the first day of Spring March 20, 2008, my water broke in Target at  9:30 am which then led to this at 11:21 pm later that evening.... \n \n \n \n \n \nWhich brings us to one year later, Happy 1st Birthday, Diva! Mommy and Daddy love you more then we can ever say!  \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/_VV-wbTJ6FJI/ScMPNqZXo5I/AAAAAAAAAE8/ycM0MwdQ2l4/s1600-h/positive+2.jpg", "http://4.bp.blogspot.com/_VV-wbTJ6FJI/ScMUS9iHWZI/AAAAAAAAAFE/ICQpdDfGjt8/s1600-h/belly.jpg", "http://3.bp.blogspot.com/_VV-wbTJ6FJI/ScMVOUJgnoI/AAAAAAAAAFU/rJdSj0rkg6Q/s1600-h/freshly+hatched.jpg", "http://3.bp.blogspot.com/_VV-wbTJ6FJI/ScMVaVKQ0KI/AAAAAAAAAFc/2tfEmHKAheU/s1600-h/baby+lila.jpg", "http://4.bp.blogspot.com/_VV-wbTJ6FJI/ScMWGP0GEKI/AAAAAAAAAFk/CG9pcw6j2cs/s1600-h/DSC00348.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/01/unexcepted-blessing-or-my-cousin-is.html", "title": "\nUnexcepted Blessing or My cousin is the next Dionne Warwick Physic Friend\n"},
{"date": "Friday, May 11, 2012", "body": "\n \n \n \n Editor's Note: This is my annual Mother's Day post.  \n \n It's relevant every year since I originally wrote it.  \n \n I've only updated the pictures. \n \n \n \nFor the one who is proving the doctors wrong. \n \n \n \n \n \n \n \n \n \n \n \nFor the one who makes me laugh till I have tears streaming down my face. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFor the one who was a total utter surprise but is a joyous smiley  baby  little girl. \n \n \n \n \n \n \n \n \n \n \n \n \n \nFor making me a better person because \nyou have shown me what really matters. \n \nFor teaching me what love is really all about. \n \nFor the smiles, giggles and utter silliness. \n \nFor sleepy hugs. \n \nFor I love yous. \n \nFor a reason to get up in the morning. \n \nFor showing me what real determination  is to each of you. \n \nFor the everyday gift of being your Mommy. \n \nI love each and everyone one of you \nfor exactly who you are at this very moment. \n \nHappy Mother’s Day! \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-GNRo1QfVp5s/T63HK4PAPBI/AAAAAAAAAOA/RjkPEUf4lhM/s1600/534844_10150765003302496_722057495_215622018_1926344723_n.jpg", "http://1.bp.blogspot.com/-OvTsp_VaHJg/T63HzPhqufI/AAAAAAAAAOI/8cq9EpOcLLI/s1600/395535_10150551272432555_722327554_8957892_772592535_n.jpg", "http://4.bp.blogspot.com/-UnTOXDnKLFk/T63H7nCVKtI/AAAAAAAAAOQ/ufyBjUPALHw/s1600/photo-1.PNG", "http://1.bp.blogspot.com/-rMKyFPP_w00/T63J6FWNH-I/AAAAAAAAAOY/7C8tIq8EWoY/s1600/340036_10150308578307555_722327554_8015621_1632420302_o-1.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/05/for-my-kids-on-mothers-day-2012.html", "title": "\nFor My Kids On Mother's Day 2012\n"},
{"date": "Tuesday, March 20, 2012", "body": "\n A girl should be two things; Classy and Fabulous Coco Chanel \n Amazing \n Fabulous \n Smart \n Hilarious \n Giggly \n Silly \n Girly \n Gorgeous \n Loving \n All these words don't even begin to describe what a fantastic little girl you are, Diva. Happy 4th Birthday. May you always be as happy as you are today. Mommy loves you.   \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-30NOk7VQrTU/T2iEdTCaWOI/AAAAAAAAALk/mWd-nRWGoS4/s1600/lila.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/03/classy-fabulous-four.html", "title": "\nClassy & Fabulous Four\n"},
{"date": "Sunday, June 3, 2012", "body": "\n \n \nBoy Wonder needed new sneakers. So I took him off to the mall this morning alone.  Just him and I for a nice and rare change of pace.  No crazy girls in the stroller demanding things and carrying on.  Boy Wonder has very few things he insists upon but when we go to the mall we must park in a certain lot, go in a certain door and then go directly to the bulk candy stand for swedish fish. Don't even think about skipping it or going in a different door. There are no quick stealth trips to the mall with him.  We went and got his sneakers and practiced walking without holding hands but staying close. We rode the escalator for close to half an hour and just wandered. As we passed the food court, Boy Wonder stopped and looked around and walked into the food court. He looked to make sure I was behind him and then continued to walk quickly (ok vocal stimmed and galloped. same difference at this point for me.) to the back of the food court. He stopped and stood with an expectant look on his face. I asked him, \"What do you want, Bobo?\" He said, \"Mommy, I want pizza, please.\" So he got his pizza AND being the liberated evolved kind of guy he is, Boy Wonder let me pay for him, too.  \n \n \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-3ufL3V5y-Es/T8wjn2llECI/AAAAAAAAAPw/_GfItKwXQXY/s1600/555168_10150848747127555_722327554_9722086_972397233_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/06/hot-date-with-my-guy.html", "title": "\nA Hot Date With My Guy\n"},
{"date": "Monday, April 30, 2012", "body": "\n \n \n \n \nToday is the last day of April. The blue lights will come out. Media coverage will slow down. But for those of who love someone with autism we are aware everyday. We never forget, not for a moment. We live a life we never imagined. We celebrate the small miracles of developmental milestones hit years late and cry in disappointment that some dreams are gone forever. We fight the school districts, insurance companies and government to get our loved ones what they need to have a fulfilling life. We fight to show the world that should not be pushed aside and hidden.  They teach compassion by their very existence. They show us the wonder of being able to have a different perspective on the ordinary. They have brought amazing people into our lives that we would have never otherwise met.  \n \nOur children are extraordinary and while they need compassion and understanding as do we, their parents, we don't need pity. While our children may not be leading the life we imagined for them, their lives have purpose, meaning and value. We can all learn so much from them if only you're willing to open your mind to their potential and possibilities. So as April gives way to May remain aware and compassionate because autism exists all year long, not just in April. \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-kFi-fY843Is/T52uSSvYb4I/AAAAAAAAANo/mo6lvCPGwzc/s1600/Autism%252520Awareness%252520Month_thumb%25255B3%25255D.jpg", "http://4.bp.blogspot.com/-8WypbcWupK0/T56B3rocgsI/AAAAAAAAAN0/UPEC9vTEW5c/s1600/471736_10150701252437555_722327554_9470522_1130856778_o.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/04/always-aware.html", "title": "\nAlways Aware\n"},
{"date": "Thursday, June 7, 2012", "body": "\n Editor's Note: This post was inspired by a conversation with my friend Sassy. She's like New England's version of Posh Spice crossed with  a Kennedy only more gorgeous and waaaaaay funnier. \n \nNever feel guilty for doing what's right for your child. \n \nI will knowingly lie and deceive and feel no guilt. \n \nThe Special Ed Director is not my friend. \n \n Nor is the case manager, \n \nsocial worker, \n \nschool psychologist, \n \nbehavior analyst, \n \noccupational therapist, \n \nphysical therapist \n \nor speech therapist. \n \nThey do not know my child the way I do. \n \n They are bound by \n \npolitics, \n \nrhetoric, \n \n budgets \n \nand their own short sightedness. \n \nSome of these people are even grossly incompetent. \n \nMy child is entitled to an appropriate education. \n \nIf I have to lie to get him what he deserves, \n \nI will feel no guilt. \n \nBecause he is MY child.  \n \n \n \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-1hkNbp5HB7o/T9EtgyqoszI/AAAAAAAAAP8/fP5jDqNBmL8/s1600/421537_10150858000977555_722327554_9755834_770998635_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/06/never-feel-guilty.html", "title": "\nNever Feel Guilty\n"},
{"date": "Tuesday, May 22, 2012", "body": "\n \n \nAt the Walk Now for Autism event, I looked away for a  minute while Boy Wonder sat in the double stroller. When I looked back he was gone. Vanished. No where in sight. My friend informed security while Big Daddy and I started to run through the crowd. I went out to the parking lots. Running, looking and praying. There's no way he could have made it out to the road. Someone would have had to notice, especially here, that he's alone and lost and profoundly autistic. \n \nThey found him 10 minutes later hiding behind the bounce house.  I will never look away again. I have followed him from room to room in the house since Sunday. All the doors and the windows are locked. And it will be along time before I trust myself again.   \n \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-p3M84rukCiY/T7xA-8kPHkI/AAAAAAAAAPE/5XPDRaC4Cbo/s1600/stroller.jpg", "http://4.bp.blogspot.com/-GcVJJAL6O58/T7xD0ETwM8I/AAAAAAAAAPQ/JZF65tm-_8o/s1600/476080_10150822797947555_722327554_9639925_797383933_o.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/05/gone.html", "title": "\nGone\n"},
{"date": "Thursday, June 14, 2012", "body": "\nTomorrow is the preschool picnic for THE DIVA. It will be a big difference from  Boy Wonder's preschool picnic  last year. She will participate, sing and laugh. Knowing her love of an audience she will put on quite the show during the sing-a-long. Her self-confidence and her misguided belief that she can sing are a joyful and hilarious sight to behold. But Boy Wonder will be in there in the back of my mind as I watch the kids from his old class participate. The ease with which things come to THE DIVA are a gift to watch. But my eyes will drift to the kids from Boy Wonder's old class because while I know their parents are thrilled to see their kids in a school program, it is hard to see your kids alongside their typical peers. And I know what will be going on behind those too bright smiles. \n \nBut tomorrow is THE DIVA'S day. She has worked hard for it and she deserves my undivided attention.  So I will try for just a little while to shrug off my Autism Mama sash for my little girl who needs me to that for her every once in a while. \n \n \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-pPnDo4CDFH8/T9qbd2znihI/AAAAAAAAAQI/k13QDxVvjOo/s1600/470025_10150871688882555_1356724698_o.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/06/other-side-of-double-edge-sword.html", "title": "\nThe Other Side of The Double Edge Sword\n"},
{"date": "Saturday, May 26, 2012", "body": "\n \n \n \n \n \nBecause a 14 year age difference doesn't mean a thing. Because genetics are at play in a twisted sense of humor, wonky left hips and evil grins. Because she is an amazing person who gets Boy Wonder, can get the DIVA calm more quickly in a way you only wish you could and who named Sweet Baby Girl because hey I was out of names.  Super Cuzzy moves 3, 000 miles away this week. We will miss her weekend visits that are planned via last minute texts. She's on to her next adventure courtesy of Uncle Sam. She'll be farther away but hey I've got frequent flier miles and I know how to use them.  \n \nWe love you SuperCuzzy! \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-99rYpT7cOI0/T8Gimgn4IrI/AAAAAAAAAPc/J2ow6_vdKZI/s1600/375919_10100851649479511_1252006308_n.jpg", "http://2.bp.blogspot.com/-3cwVZtXuoS4/T8Gi13mhs0I/AAAAAAAAAPk/YQn00UQwQg0/s1600/560588_10101521586834681_10034300_65779504_1997749742_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/05/cross-country.html", "title": "\nCross Country\n"},
{"date": "Wednesday, July 4, 2012", "body": "\nSweet Baby Girl started camp yesterday for two morning a week. She is so ready. She needs it and after almost 7 years of full time mommyhood I need a break. My friend (you know who you are) asked if I had a hard time sending her off to be a \"big girl\". My answer was no. Every developmental milestone and rite of passage that SBG and DIVA serve up on a silver platter is cause for celebration for me. While I, on a rare occasion, miss the baby days with each milestone they hit I breathe a little easier.  This is easy. Hard was putting Boy Wonder on the \"short bus\" at 3 years old but sending the girls off to grow, learn and develop is easy.  \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-nvVPZhqND3A/T_R3R28xRpI/AAAAAAAAAQc/QQmhpMQDSHM/s1600/561157_10150905942747555_54217253_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/07/easy-vs-hard.html", "title": "\nEasy vs. Hard\n"},
{"date": "Friday, September 9, 2011", "body": "\n I'm different; not less. Temple Grandin \n F.A.P.E. - Free and Appropriate Public Education  \n- is an educational right of children with disabilities that is guaranteed by the Rehabilitation Act of 1973  and the Individuals with Disabilities Education Act. \n I'd like to remind the school districts that it is your responsibility to educate our children with disabilities. They are entitled to an education under FEDERAL LAW. We, as the parents of children with special needs, realize that the cost to raise and educate our children is extraordinary.  But you never ever hear me say, \"Cut the extra curricular activities for the typical children. My kid can't participate. Too bad. What do I care about your kid?\"  \n \nBut we as, special needs parents, hear this refrain constantly. Some school districts point us out. They put the bulls-eye on our backs and  are creating an us vs. them mentality. It's unnecessary. All I want for Boy Wonder and his peers is an appropriate education.  I and the other parents want to watch our kids grow, learn and succeed, just like any other parent.  Just as I want for my two darling neuro-typical girls who will participate in extra-curricular activities that Boy Wonder can not currently participate in. \n \nOur kids are a vital part of the community. They teach compassion and empathy by just their very existence.  They have a lot to offer the world, if they are educated properly and given opportunities to succeed. I can only quote Temple Grandin,\"Different not LESS!!!\"\" \n \nSo listen up School Districts of America, do not  MAKE ME GET THE CHICKEN . We are only asking for what our kids are entitled to both our special needs kids and the typical kids. A free and appropriate public education. \n \n \n \n.\n \n ", "outgoing_links": ["http://thebloggess.com/2011/07/knock-knock-motherfucker-giant-metal-chickens-revisited/", "http://2.bp.blogspot.com/-u63Zn5e_Ekg/TmpUWkSENBI/AAAAAAAAAEg/nQ5ch_EE5s4/s1600/fapechicken.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2011/09/rant-about-fape.html", "title": "\nA Rant About F.A.P.E.\n"},
{"date": "Wednesday, July 25, 2012", "body": "\n Editor's Note: OMFG sick of my own whining and introspection. Someone smack me. In an effort to get over my own bullshit, I shall mock myself and my kids for your entertainment. Enjoy!!! \n \n1. I See Your Butt (Pull Up Your Damn Pants!) \n \n2. No No No No No (I Said NOOOOOO!!!) \n \n3. The Whining Song (Oh God Make It Stop!!!))) \n \n4. My Kids Are Nekkid in the Driveway (Must Be Summer) \n \n5. Is 10 AM Too Early for Tequila? (No Seriously) \n \n6. Don't Drink from the Puddles (You'll Get The Shits) \n \n7. Stop Touching Each Other  \n \n8. Oh God It's Only 3 O'clock ( Praying for Bedtime) \n \n9. Where's Big Daddy? (Cause Why Should I Have All The Fun?) \n \n10. Late Afternoon Nap Blues (Shoot Me Now) \n \n11. Begging for Ice Pops (All Damn Day) \n \n12.  You're Turning Me Into Grandma (Cause I Said I'd Never Say That) \n \n13. I Love You Mommy (Can I Have Candy?) \n \n14. Even Stevens (Not Just For Kids for Spouses Too) \n \n15. 3 Kids and A Crazy Lady (Never Go to Target Alone)  \n \n16. Dreaming of September (Hurry the Fuck Up) \n \nBonus Track: There's Nothing Here for YOU to See (Mind Your Own Fucking Business) \n \n \n \n \n \n \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2012/07/soundtrack-of-my-summer-sahm-made-up.html", "title": "\nSoundtrack of My Summer ( A SAHM Made up Playlist)\n"},
{"date": "Saturday, July 14, 2012", "body": "\n \n \n \n \n \n \n \n \nWe skipped housework this weekend so excuse the mess.    \n \n \n \n \n \n \nAnd we headed to our favorite place  \n \n \n \n \n \nTHE BEACH!!!  \n \n \n \n \n \n \nA Handsome Sensory Seeker's Heaven!!  \n \n \n \n \n \n \nWorld's Most Gorgeous Mermaid!! \n \n \n \n \n \nI will build a sandcastle than smash it than build it again.   \n \n \n \n \n \n \nLove this face.. \n \n \n \n \n \nand this face.....  \n \n \n \n \n \nand this face!!!!  \n \n \n \n \n \nDigging in the sand.   \n \n \n \n \n \nWaiting for lunch to be served.   \n \n \n \n \n \nTopped off by dinner out!!!  \n \n \n \n \n \n \n \nAnd Boy Wonder had apparently had enough of Sass and Brass Tacks today.  \n \nMommy's not stupid. I went and sat with Boy Wonder.  \n \nBut I do hope they remember what a good time they had today TOGETHER. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-ap7UOY149lk/UAIa6F3TK3I/AAAAAAAAAQ4/OJP1hUFMtMQ/s1600/IMG_4565.JPG", "http://4.bp.blogspot.com/-E9IUKy63XD0/UAIbB2ITEbI/AAAAAAAAARA/w8BcUP1UuAw/s1600/IMG_4563.JPG", "http://2.bp.blogspot.com/-i2Vdd-PXXYA/UAIbfsijcYI/AAAAAAAAARI/67dweyf1rFg/s1600/IMG_4556.JPG", "http://1.bp.blogspot.com/-Wt-15C0eLt4/UAIbm4SvQDI/AAAAAAAAARQ/hoZwb9sTLKw/s1600/IMG_4560.JPG", "http://2.bp.blogspot.com/-z_mZyouzfDM/UAIbpKlGKJI/AAAAAAAAARY/aeEbb2t2sVQ/s1600/IMG_4559.JPG", "http://4.bp.blogspot.com/-4Co5C1hCONM/UAIbsR1OeBI/AAAAAAAAARg/OCESmODmer4/s1600/IMG_4558.JPG", "http://1.bp.blogspot.com/-Rrq-p4WzVEc/UAIbzvjPiaI/AAAAAAAAARo/aVllEiZ3L04/s1600/IMG_4561.JPG", "http://1.bp.blogspot.com/-veqYVbJpa7o/UAIb2E28owI/AAAAAAAAARw/Cl2rmfeXwh8/s1600/IMG_4555.JPG", "http://1.bp.blogspot.com/-AZRzSmaC7KQ/UAIb4_G4rZI/AAAAAAAAAR4/qzjIh-mQCUU/s1600/IMG_4554.JPG", "http://1.bp.blogspot.com/-30LVcCxgoks/UAIb-AJpO-I/AAAAAAAAASA/WInTAW2HPeE/s1600/IMG_4562.JPG", "http://3.bp.blogspot.com/-9unGjKIiKUQ/UAIcMjHapWI/AAAAAAAAASI/jHtvqrm0Djs/s1600/IMG_4564.JPG", "http://2.bp.blogspot.com/-W_duvODKgIE/UAIcQ3LUqlI/AAAAAAAAASQ/F-kx17LWRxo/s1600/IMG_4552.JPG", "http://2.bp.blogspot.com/-_WUrdTXs1L0/UAIcUZxjx3I/AAAAAAAAASY/G_i1y7YId0A/s1600/IMG_4557.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/07/day-at-beach-in-pictures.html", "title": "\nA Day At The Beach In Pictures\n"},
{"date": "Sunday, July 8, 2012", "body": "\n \n \"Mile 18 almost broke me.\" \n \n One of my tweets from the 2011 NYC Marathon. \n \n \n \n \n \n \n \n There has been a lot of Mile 18s lately. I have come to accept them as part of my life. And while I may walk or crawl the next few miles, I am never out or down for long. Mile 18 is part of everyone's life. You may call it something else but we all have those days and weeks. I have the power to make myself happy and my children happy. Sometimes other people add to our happiness. Sometimes it's for the long term and sometimes only the short term. \n \n So tomorrow morning when I lace up my running shoes and head out the door, I will think of Winston Churchill's quote, \"If you're going through Hell, keep going.\"  I'll keep going  because I know that Mile 23 is never as far as I think it is and that I never know who will be waiting there.  I have faith and hope and for now that's enough.  \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-M-M-OJaHzig/T_oI7scghaI/AAAAAAAAAQo/DReWcnR0abw/s1600/384390_10150350693867555_941695334_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/07/mile-18.html", "title": "\nMile 18\n"},
{"date": "Wednesday, May 16, 2012", "body": "\n \n \n \n \nIt appears we have been perhaps holding Boy Wonder back in his independent living skills. He has taken to getting himself his own food. \n \nOn Mother's Day, he was tired of waiting for cake. He had the three key ingredients. Inspiration, opportunity and motivation in the form of chocolate cake. \n \n \n \nHe enjoyed himself immensely till I walked in the kitchen at his aunt's house and snagged him chowing down. I got the big Oh Hi Mommy grin. \n \nMonday morning, I hear an odd sound as I come down the stairs. I go in the kitchen and find that Boy Wonder has poured himself, the counter and the floor some chocolate milk. We cleaned that up together. \n \nTuesday afternoon, I'm in the kitchen making dinner. Boy Wonder comes strolling in, opens the cabinet and gets himself a plate. I don't stop him as I'm interested in seeing where he's going with this mission. He strolls over to the fridge, gets out some chicken nuggets.  I keep waiting for him to tell me in his whispery voice,\"I want chicken please.\" but he doesn't he just keeps on going. He opens the ziploc bag and puts some chicken nuggets on the plate, opens the microwave, sticks his head in and looks around. He pull his head out, puts the plate in and slams the door shut. He studies the control panel for a few seconds and decides 10 minutes for 4 chicken nuggets looks about right except ummm yeah they'd explode. (No you may not ask how I know this information. You'll just take my word for it and like it.) I stopped the microwave and helped him push the 30 second button. He stood patiently waiting peering through the window. Once the microwave beeped, he said, \"All done\" opened the door and took out his plate of chicken nuggets, left the microwave door wide open, put his plate on the kitchen table and ate his self made dinner.  \n \n \n \n \n \nMy Boy Wonder wants to start doing things on his own. I am thrilled. Next task we are working on you ask? Bathroom cleaning!! Mommy's not stupid.  \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-adJLaoJ_lfs/T7RokEjm6vI/AAAAAAAAAOk/9gdnf-xlSp0/s1600/self+service", "http://4.bp.blogspot.com/-DLmLQVKDEiU/T7RpPo3MheI/AAAAAAAAAOs/jta5tZERWR0/s1600/556788_10150799647062555_722327554_9576061_915611505_n.jpg", "http://2.bp.blogspot.com/-sbrbXT-B6uc/T7Rs5_rMWGI/AAAAAAAAAO4/KePiFKrFTFo/s1600/photo-2.PNG", "http://www.goodreads.com/author/show/11343.Thomas_Stephen_Szasz"], "link": "http://theadventuresofboywonder.blogspot.com/2012/05/self-service.html", "title": "\nSelf Service\n"},
{"date": "Monday, July 16, 2012", "body": "\n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n ", "outgoing_links": ["rtsp://v1.cache6.googlevideo.com/ChoLENy73wIaEQmLjjjrh9TMDBMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://theadventuresofboywonder.blogspot.com/2012/07/letter-of-day-is.html", "title": "\nThe Letter of the Day is...\n"},
{"date": "Tuesday, July 24, 2012", "body": "\nIt's the same as it's been for 18 months. The alarm goes off and I'm up. Throw on the sneakers and turn on the iPod. Out I go for miles because the physical pain is easier to bear then the worry and fear. We won't even discuss the anger. I push myself up the hills at faster paces till my lungs burn and my legs cramp. I run like  a child on the downhill because downhill is easy but I've never done easy. Because the last year has been a fucking roller coaster of the unexpected. Up and down, twisting then right side up then upside down. The highest of highs and the lowest of lows. The realization that the time for a miracle for Boy Wonder has come and gone. That being self reliant is the only way for me. That some things can not be fixed no matter how I try. That walls are necessary and trust is earned. That I am one of the few people unafraid of change. But my kids are happy so I am doing something right. Time to let go and move on. I've done it before I can do it again. \n \n \n \n \n \n \n White knuckles and sweaty palms from hanging on too tight\n \nClench of jaw, I've got another headache again tonight\n \nEyes on fire, eyes on fire, and the burn from all the tears\n \nI've been crying, I've been crying, I've been dying over you\n \nTie a knot in the rope, trying to hold, trying to hold,\n \nBut there's nothing to grab so I let go  \n \n Blow Me (One Last Kiss) P!nk  \n \n \n \n \n \n\n  \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/--UgQGs92PVk/UA6pnp9aFHI/AAAAAAAAASo/x3BZshf4HH8/s1600/kids+"], "link": "http://theadventuresofboywonder.blogspot.com/2012/07/450-am.html", "title": "\n4:50 am\n"},
{"date": "Monday, July 30, 2012", "body": "\n \n  Mirror, Mirror on the wall, \n \n Who's the fairest of them all? \n \n Evil Queen, Snow White \n \n \nSeveral weeks ago as we were on the check out line, the cashier said to DIVA,\" Aren't you a pretty princess? Is this your mommy? You look just like her.\"  To which DIVA respsonded,\" THAT'S NOT MY MOTHER. SHE'S THE EVIL QUEEN.\" \n \nYes yes I am the Evil Queen. Still doesn't keep these kids in line but hey it's a promotion from domestic slave. \n \n \n \n \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-8UmnJ7Yfm28/UBbD9iNbq-I/AAAAAAAAAS0/BZYwijj2zHw/s1600/580846_10150960819987555_2028035556_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/07/cause-diva-is-funny.html", "title": "\nCause the DIVA is FUNNY\n"},
{"date": "Wednesday, August 8, 2012", "body": "\n240 hours or 10 days. Boy Wonder, DIVA and Sweet Baby Girl are off with Big Daddy to California for a visit with their grandparents, aunt, uncle and cousins. I am staying home. I have finals exams and other things to take care of while they're gone. \n \nI have plans to get to the beach, lunch with girlfriends and a weekend trip. I need a break from all of them. I admit it. I can not to do all the things I do at a breakneck speed without a break. I have earned this break. Having a child with autism and plus three kids all together so close in age is like parenting at warp speed some days. Whoever said the years are short and the days are long was so right. \n \nI need to put the  oxygen mask  on for a while. I need time to reflect on the last year, make peace with some things and plan for the future. I need to do things for me so I can continue to do for my three babies.  I'll miss them but right now I miss me more. I'm tired, restless and can't focus.  \n \nSo don't look for me here. I'll be enjoying the peace and quiet. \n \n Ed. Note: To learn more about the Oxygen Mask Project, please  click here.   You can also follow the Oxygen Mask Project on Twitter @OxygenMaskProj.  Y ou can also visit their Facebook page at The Oxygen Mask Project. \n \n \n ", "outgoing_links": ["http://oxygenmaskproject.com/about/"], "link": "http://theadventuresofboywonder.blogspot.com/2012/08/240-hours-or-yearoftheoxygenmask-round-2.html", "title": "\n240 Hours or #yearoftheoxygenmask round 2\n"},
{"date": "Monday, August 6, 2012", "body": "\nThere is no direct map from getting from point A to point B with autism. You try things they work for awhile then they stop working. Or there's that dirty word, regression. \n \nWe made the decision a year ago to put Boy Wonder on risperdone. Putting a not quite 5 year old on an anti-psychotic was not quite the parenting decision I ever imagined I'd make. Aggressive behavior towards me, self injurious hand biting to the point his hand bore teeth marks constantly like the inside of a mouth guard, lack of focus, and waking up for the day at 3 AM and off the wall vocal stimming forced our hand. We had no choice. Every behavior plan did nothing. \n \nSo we put him on the medicine and the effect was profound. His hand no longer bore teeth marks. He didn't go after me. I was allowed to sit at the kitchen table without him getting made or pulling me off my chair. The vocal stimming was tolerable. \n \nBut then he began to pee his pants which is a side effect. The boy who was on the edge of being fully toilet trained after 5 long years of potty training. His bloodwork came back with cholesterol just below stroke level. The hand biting has returned. I've been bitten and slapped and pulled off the kitchen chair. The vocal stimming is so loud and goes on for hours. He is back to getting up at 3 AM once or twice a week. Risperdone is no longer working. We only are getting the side effects now.  \n \nSo back we go to the pediatric neurologist for help because even though I was so against the medicine at first, it helped him gain so much ground. Big Daddy and I are capable of making the tough decisions for Boy Wonder but it sucks. \n \nThere is a bright beautiful intelligent little boy locked away in his autism. We get glimpses of it every day. In the big smiles. In the silly giggles. In the games we play. In the fact that he is learning to read and do math. Whatever we have to do to help him struggle less and help him reach his potential we will do it. \n \n \n \n   \n \n \n ", "outgoing_links": ["http://2.bp.blogspot.com/-Rj1RCBI4Zag/UB_MH8JJjJI/AAAAAAAAATI/LAeaTcSell4/s1600/524007_10150950925767496_1760681050_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/08/try-something-else.html", "title": "\nTry Something Else\n"},
{"date": "Tuesday, August 7, 2012", "body": "\n \n \n \n When you judge another,  \n \n you do not define them, \n \n you define yourself. \n \n ~Wayne Dyer \n \n \n \n \n \n \n \n @font-face {\n  font-family: \"Times\";\n}@font-face {\n  font-family: \"ＭＳ 明朝\";\n}@font-face {\n  font-family: \"ＭＳ 明朝\";\n}@font-face {\n  font-family: \"Cambria\";\n}p.MsoNormal, li.MsoNormal, div.MsoNormal { margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Cambria; }a:link, span.MsoHyperlink { color: blue; text-decoration: underline; }a:visited, span.MsoHyperlinkFollowed { color: purple; text-decoration: underline; }p { margin-right: 0in; margin-left: 0in; font-size: 10pt; font-family: Times; }.MsoChpDefault { font-family: Cambria; }div.WordSection1 { page: WordSection1; } \n\n\n\n\n \nI do not usually engage in\nconversations about politics, religion or other peoples parenting choices.\nHowever, if you are going to presume to tell me how to parent my children well\nthen, hey, let's go. Jersey just took her earrings off and put her hair in a\nponytail. I am not thrilled with some of you. \n \nI parent my children in the way\nthat is best for them at this moment in time. For Boy Wonder that means ABA,\nattending public school and home therapies. It means a no tolerance policy of\nhis aggressive behaviors. This is what is working for him. He can not\ncommunicate most of his thoughts and feelings to me. I have to guess all day\neveryday. I am filled with self-doubt on a regular basis. I have tried bio-med\ntherapies and therapies other than ABA. They did not work for MY SON. \n \nI know people for who the special\ndiets, DIR/Floortime and other alternative therapies have worked. I am thrilled for them that THEIR CHOICES\nworked for THEIR CHILD. I am thrilled when any parents choices work for THEIR\nCHILD because it means they are parenting THEIR CHILD in the way that is best\nfor THAT CHILD. \n \nNow I'm going to rant..... \n \nYou do not know me. You do not know\nmy son the way I know him. I parent him to the best of my capabilities. I play\nto his strengths and strive to overcome his deficits. I dislike intensely his\nautism. I have wondered every day for nearly 7 years what he is thinking and feeling. I see my\nchild through a thick glass wall. He is yelling to me but I have to interpret\nand guess and make the best choices on limited information. I am alternately\nloving and stern with Boy Wonder depending on the day and situation. \n \nI work on the assumption that he\nunderstands every word I say. I never say anything negative about him in front\nof him. I do not tolerate anyone else doing it either.  I realized that\nthis was not the way to go years ago. After reading  Carly's\nVoice ,  I knew that it was a great freaking parenting choice. \n \nI am preparing for two different futures for my son. One in which he can live independently which is not likely and one in which he will need to live in a group home which is the one that is currently likely. I strive to change that every day. I also on occasion pray for it too.   \n \nSo for your review, I do not judge\nyour parenting choices of your special needs kid. You are doing what works for\nyour child. I am doing what works for MY CHILD. I am entitled to my thoughts\nand feelings on Boy Wonder's particular brand of autism just as you are\nentitled to your thoughts and feelings on YOUR CHILD'S autism. \n \nFor the adults on the spectrum who\nfeel their parents didn't parent them in the way they would liked to be\nparented, I am sorry for your pain and experiences. I value your opinions. You\nare the ones leading the way for my son and other children on the spectrum. I\ntry to learn from you. Your insight offers me a wonderful perspective. I\nappreciate and value it. At the end of the day, I am just trying to do the\nright thing for my son and for me that path is not always clear.  \n \n @font-face {\n  font-family: \"Times\";\n}@font-face {\n  font-family: \"ＭＳ 明朝\";\n}@font-face {\n  font-family: \"Cambria Math\";\n}@font-face {\n  font-family: \"Cambria\";\n}p.MsoNormal, li.MsoNormal, div.MsoNormal { margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Cambria; }p { margin-right: 0in; margin-left: 0in; font-size: 10pt; font-family: Times; }.MsoChpDefault { font-family: Cambria; }div.WordSection1 { page: WordSection1; } \n\n\n\n\n \nWe ask people outside our community\nto treat us and our children with respect. How can we have the audacity to do\nthat when we can’t treat each others choices with respect?  \n \n\n\n \n \n \n \n\n\n \n \n \n \n ", "outgoing_links": ["http://www.blogger.com/goog_1531748708", "http://www.amazon.com/Carlys-Voice-Breaking-Through-Autism/dp/1439194149/ref=sr_1_1?s=books&ie=UTF8&qid=1344293486&sr=1-1&keywords=carly%27s+voice", "http://4.bp.blogspot.com/-uroZnSx-g_w/UCDynTRNszI/AAAAAAAAATc/1ZUcLEA6lXQ/s1600/IMG_4373.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/08/parenting-freedom-of-choice.html", "title": "\nParenting & Freedom of Choice\n"},
{"date": "Tuesday, August 21, 2012", "body": "\nSo last year I was given the honor of hosting  Solange, the village's giant metal chicken mascot, by Rachel over at Stim City.    The deal is that our chicken gets passed on to members of  our village  who needed the laugh and the reminder of our connection and love for each other. Solange was inspired by the  Bloggess' Beyonce who taught us to laugh and to pick our battles.  \n \nSo Friday afternoon, I loaded Solange up and we headed out.  \n \n  \n \n \n      Solange called shotgun but I thought driving up the highway with a giant metal chicken in the front seat would get me pulled over.  So it was the trunk for him.  \n \n \n \n \n \n \n \nAnd we were off to visit friends. Traffic got me where we were going way later then I intended. Solange was not thrilled with his excessive time in the trunk. There was some angry clucking coming from the back of the truck. Finally we arrived at our destination. It was time for a little Knock Knock MoFo. \n \n \n \n \n \n \n \n \n \n \n \n \nThe front door was opened and Solange was greeted with laughter from  Jess ,  Luau , Katie and Brooke.  \n \n \n \nI had a wonderful weekend with all of them. We went to an autism event and I got to see one of my favorite people ever.  \n \n \n \n \n \n \n \n \n Jersey & Texas together again.  \n \nI collected some shells for DIVA  and Sweet Baby Girl. \n \n \n \n \n \n And saw some beautiful views. \n \n \n \n \n \n \n \nAnd then Sunday morning I got to run with the Team Up with Autism Speaks Boston team with Luau. I showed them how we run Jersey style. Oh you want to donate??  CLICK HERE \n \n \n \n \n \n \n \nThen our running buddy Doug who couldn't make the training run came looking for us.  He asked Luau where I was. Luau told Doug she's up a bit she's wearing.... forget it you'll know it when you see her. He found me alright. \n \n \n \n \n \n Doug, Me & Luau \n \n \n \n   We met up with the rest of the group for a picture.  \n \n \n \n \n \n \n \n \n \n \n \n                \n \nI had a wonderful weekend with friends. It was a whirlwind but I really enjoyed it.  \n \n \n \nI had some very interesting conversations with Katie. To see her interact with Brooke and watch her really get her sister is a beautiful thing. I am beginning to see it in my own girls with Boy Wonder. Katie and Brooke give me hope that the kind of relationship I would like my girls to have with their brother is a very real possibility.  \n \n \n \nAnd then after a quick picture with Jess and Solange it was time to hit the road. My babies were on a plane and headed home.  Back to reality.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://stimcity.org/2011/10/04/beyonces-little-brother-solange/", "http://thebloggess.com/2011/06/and-thats-why-you-should-learn-to-pick-your-battles/", "http://1.bp.blogspot.com/-eaO7g0L6cZM/UDOc5tSOyuI/AAAAAAAAATw/qg1K1pG0oaY/s1600/photo-29.JPG", "http://1.bp.blogspot.com/-_SJJshLfhhw/UDOdL16549I/AAAAAAAAAUo/pJCOXwGICaQ/s1600/photo-27.JPG", "http://1.bp.blogspot.com/-DpUIyUsNMNw/UDOdOssco0I/AAAAAAAAAUw/kWDO6AnLNsQ/s1600/photo-28.JPG", "http://adiaryofamom.wordpress.com/", "http://runluaurun.com/", "http://4.bp.blogspot.com/-b_3MwZz2ILI/UDOdFS9AgPI/AAAAAAAAAUQ/FM45YmOmvSU/s1600/photo-24.JPG", "http://1.bp.blogspot.com/-UJnEmHmNnV8/UDOdI5InxxI/AAAAAAAAAUg/ZNo-dhuBXGs/s1600/photo-26.JPG", "http://4.bp.blogspot.com/-gINxHF6zRSU/UDOdGb7gBFI/AAAAAAAAAUY/ybNqxu9sQ9M/s1600/photo-25.JPG", "http://events.autismspeaks.org/faf/donorReg/donorPledge.asp?ievent=1003931&lis=1&kntae1003931=4D9AC41D066648C9BB8FBC9F9F0C1237&supId=337218711", "http://1.bp.blogspot.com/-gJa4-FeSFuc/UDOom9fC3dI/AAAAAAAAAVQ/PeNxjAQj_wg/s1600/photo-22.JPG", "http://3.bp.blogspot.com/-Ux1EcXKFSq4/UDOdEqw6NnI/AAAAAAAAAUI/R5owxmbKPH8/s1600/photo-23.JPG", "http://2.bp.blogspot.com/-BRUeYfXVDMM/UDOsJOwlQFI/AAAAAAAAAVc/RwVJYqPvBto/s1600/photo-31.JPG", "http://1.bp.blogspot.com/-MZf-PAqNzDI/UDOdC81lIaI/AAAAAAAAAT4/_gerqFWM6kk/s1600/photo-21.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/08/visiting-or-solange-takes-road-trip.html", "title": "\nVisiting Or Solange Takes a Road Trip\n"},
{"date": "Friday, September 14, 2012", "body": "\nThose three words they told you that you would most likely never hear from your profoundly autistic non verbal child. They were wrong. He's come a very long way in 5 years. He's no longer locked away. He comes out further each day. He laughs. He plays in his own way. He's engaging. He's affectionate. His smile and giggle light up the world. And those three words you thought you would never ever hear from him, you hear them. \n \n \n \n \n \n \n \n \n \n \n ", "outgoing_links": ["rtsp://v7.cache1.googlevideo.com/ChoLENy73wIaEQkrBvuUIjw3GxMYDSANFEgDDA==/0/0/0/video.3gp"], "link": "http://theadventuresofboywonder.blogspot.com/2012/09/three-words.html", "title": "\nThree Words\n"},
{"date": "Monday, September 17, 2012", "body": "\n \n \nOH and you can still donate!!! Click the links in the upper right hand corner. \n \n ", "outgoing_links": [], "link": "http://theadventuresofboywonder.blogspot.com/2012/09/we-meaning-you-too-can-make-difference.html", "title": "\nWE (meaning you too) Can Make A Difference\n"},
{"date": "Friday, September 21, 2012", "body": "\nIt was a gorgeous morning to run. Bright, clear and cool which is just the way I like it but I hadn't slept well the night before because as usual the mind stays on all the damn time. I was thinking about Boy Wonder who has made some great progress lately but who has some old aggressive behaviors crop up. I was thinking about my friend who wasn't there. And always thinking about how did I get here from 19 months ago without having ever really run.  \n \n \n I was really grateful for my friends,  Jess  and  Luau  and their beautiful girls who let me stay with them and are just fabulous friends. Again the whole autism sucks thing but wow I have made some amazing friends because of autism. (click their names and read their race recaps) I could tell you that their Katie gives me a glimpse into what it's like to have a tween cause shopping was hilarious (go to Sephora with her cause it was fun) and she is a smart charming beautiful compassionate young lady and hell if my girls are half of what she is I will consider it a job well done.  Or that Brooke has quite the sense of humor and wow she can draw or that when she calls me Jersey in that sweet little voice of hers my heart melts. I could tell you that I finally met  Paula  and what an awesome person she is and that I'm so touched that she ran one of her miles in honor of my son.  \n \nBut the morning of the race, we load up and head in. It was a quick ride. I'm shaking off the lack of sleep, fooling around being me, remind myself that this is my 3rd half marathon this year. (NYC Half and the Asbury Half, thank you very much) and that I am capable of this and want to beat my Asbury time. I think of my boy who they said would never speak and never connect and remind myself that he can talk and oh boy does he connect. I think of my girls who always ask when I get back from a race,\"Did you win Mommy? Can I wear your medal?\" and how they are surprising me already with just how much they get their big brother. \n \nWe find Sassy and Doug and make our way to the start line. Doug and I trash talk cause hey it's what we do. (I'm way better at it though ssshhhh) Sassy is all cute and sassy in her running skirt. We hug Jess and promise to look for her on the course and  we are off. We are moving along the four of us. Me cursing, Sassy looking cute, Doug and Luau chatting like tween girls. (Sorry boys lol)  At some point Doug tears his calf muscle and pulls over but he makes a comeback.  And somewhere around mile 8 or 9 I can't keep up the 9 minute per mile pace. The sight of all the Team UP shirts is starting to get to me. It's an overwhelming sight and yet it's only a very small piece of the enormous pie.  Sassy takes off and Luau stays with me cause he's good like that.   And Doug comes tearing past us and I know I'm losing my bet to him. \n \nWe get to the last half mile or so and Luau says, \"After this hill, you've got it. We're almost there.\" I may have screamed at this point,\"What the fuck you said the course was flat?????!!!\" really really loudly. \n \nAnd I finish in 2:04:44 beating my Asbury Half time by a whole 3 seconds.  \n \n \n \n \n \n \n Suffolk Downs after the race \n \n \n \n ", "outgoing_links": ["http://adiaryofamom.wordpress.com/2012/09/17/lo-hicimos/", "http://runluaurun.com/2012/09/19/boston-13-1-the-metaphor/", "http://biggreenpen.com/2012/09/17/listparttwo/", "http://3.bp.blogspot.com/-y_e6-7kjr8o/UFxpJxchF4I/AAAAAAAAAYk/cwBns0ThpeE/s1600/photo-52.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/09/boston-good-bad-ugly.html", "title": "\nBoston The Good The Bad The Ugly\n"},
{"date": "Monday, September 10, 2012", "body": "\n \n \n \n \n \n \n \n \n \n \n \n \nAnd they were off to school. My house is empty and quiet for the first time in years. I love them all madly but the peace and quiet were hard earned and are needed. Now if you'll excuse me, I'm going to go jump on the couch and then do my own schoolwork. \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-VawETtI8ffQ/UE3WTlIjhAI/AAAAAAAAAWA/XhShsYZyCW4/s1600/photo-33.JPG", "http://1.bp.blogspot.com/-XoL4Z45mABU/UE3WXFDP8MI/AAAAAAAAAWI/QI38ahj9EEc/s1600/photo-34.JPG", "http://2.bp.blogspot.com/-BDKNJPHmLhU/UE3WZu6DubI/AAAAAAAAAWQ/zLBfF4afzU4/s1600/photo-36.JPG", "http://2.bp.blogspot.com/-7ggFuIlrwB0/UE3WdUPu_jI/AAAAAAAAAWY/O5rGSbBPNrA/s1600/photo-35.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/09/and-then-there-were-none.html", "title": "\nAnd Then There Were None\n"},
{"date": "Thursday, October 4, 2012", "body": "\n \nSeven years.... \n \n \n \nof big silly grins \n \n \n \ndelicious belly laughs \n \n \n \nof those big brown eyes  \n \n \n \npuckered up kisses \n \n \n \ncarrying you on my left hip \n \n \n \nof ups and downs \n \n \n \nof small and big miracles \n \n \n \nof pure unadulterated love \n \n \n \n \n \n \nHappy 7th Birthday Boy Wonder!! \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/-2YsRvjW5KOU/UGzsCv8lJUI/AAAAAAAAAZY/YEm_HxIJdUo/s1600/photo-53.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/10/seven.html", "title": "\nSeven\n"},
{"date": "Tuesday, September 11, 2012", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n @font-face {\n  font-family: \"Arial\";\n}@font-face {\n  font-family: \"Times\";\n}@font-face {\n  font-family: \"ＭＳ 明朝\";\n}@font-face {\n  font-family: \"Cambria Math\";\n}@font-face {\n  font-family: \"Cambria\";\n}p.MsoNormal, li.MsoNormal, div.MsoNormal { margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Cambria; }p { margin-right: 0in; margin-left: 0in; font-size: 10pt; font-family: Times; }.MsoChpDefault { font-family: Cambria; }div.WordSection1 { page: WordSection1; } \n\n\n\n\n \n Tomorrow is a promise to no one \n \n ~Clint Eastwood   \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n @font-face {\n  font-family: \"Arial\";\n}@font-face {\n  font-family: \"ＭＳ 明朝\";\n}@font-face {\n  font-family: \"ＭＳ 明朝\";\n}@font-face {\n  font-family: \"Cambria\";\n}p.MsoNormal, li.MsoNormal, div.MsoNormal { margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Cambria; }.MsoChpDefault { font-family: Cambria; }div.WordSection1 { page: WordSection1; } \n\n\n\n\n \n \n \n \n We’d been up at the top of\nthe towers the weekend before it happened. The next week the NYC skyline, we\nhad all grown up with was changed irrevocably. Lives were changed. Lives were\nlost. Families, friends and loved ones gone in an instant of carefully planned\ninsanity. Their tomorrows were gone.    Potential unfulfilled, dreams lost and the\nlast chance for an apology or an I love you gone. \n \n \n \n Choose to live the life you\nwant. Choose to love freely, openly and passionately. Pursue your dreams. Find\nthe humor in every situation. Don’t be afraid of change because life will bring\nyou change whether you want it or not. Learn, grow, try new things. Get out\nthere and live the life that was taken from so many on this day.    What are you waiting for?  \n \n \n \n \n \n \n \n\n\n \n \n   \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-UIAlYbIGq_k/UE8yNmfR8vI/AAAAAAAAAWw/SfzJanberh4/s1600/photo-37.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/09/tomorrow.html", "title": "\nTomorrow\n"},
{"date": "Thursday, September 27, 2012", "body": "\n \n Boy Wonder, age 2 years 1 month, presents with a complete lack of joint attention. \n \n Boy Wonder's Initial Evaluation  \n \n November 9, 2007 \n \n \n \nOne of the best things about parenting small children, ya know other then the whining and your pants being a walking tissue, is seeing the wonder and laughter in their faces when they experience things for the first time and their little faces looking back at you to see if you are seeing and experiencing what they are experiencing.  That type of connection with your child is what every parent expects but when you have a child with autism those moments are hard to come by. They are focused inward. You fight your way into their world and try to bring them out to your world. You wait for that connection and in our case we waited years.  \n \n \n \nWhile not a daily occurrence, joint attention does happen more and more with Boy Wonder. We took all of them to the Bronx Zoo on Saturday.  They had a Dora and Diego 4-D short film exhibit about a robot butterfly. We were hesitant to take Boy Wonder in. Would he keep the glasses on? Would he vocal stim loudly to the point of annoying other people? Would he just flip out and need to be taken out quickly? We looked inside the theater. It wasn't even a quarter of the way filled. We decided to sit in the front row with Boy Wonder and Big Daddy positioned near the exit. Boy Wonder decided he'd sit on his Daddy's lap.  As the lights went down we put the 4-D glasses on him and Dora and Diego sprang out at him and he laughed, his big delicious belly laugh. He watched the butterflies come dancing onto the screen and reached out to touch them and then he looked over at me to see if I was watching and laughing too and when he saw I was laughing,  he laughed harder. That connection is all that more meaningful because it's been an uphill battle and we are rewarded with the sweetest victory. \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://1.bp.blogspot.com/--ENLRkV_nJM/UGStV3dFn4I/AAAAAAAAAZA/zv0ZToHmAv4/s1600/548431_10151053058762555_330986036_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/09/joint-attention.html", "title": "\nJoint Attention\n"},
{"date": "Thursday, October 11, 2012", "body": "\n \n Mommy, you're going running again??? Can't you stay home? \n \n ~Diva \n \n \n \n Mama, watch me watch me. I run fast just like you. Give me a medal. \n \n ~Sweet Baby Girl \n \n \n \nI don't only run to raise awareness and fund raise for Boy Wonder, although I'd run barefoot across the surface of the sun for that kid if it would help him.  I run for my girls who will grow up as siblings to a brother with serious special needs. I run for the girls because their happiness is just as important as their brother's although at times to them it may not feel like it.  \n \n \n \n   \n \nI can not change the fact that Boy Wonder has autism. What I am trying to prevent is my girls from hearing is \"your child has autism.\" I would like  my girls to never know this heartache. I'd like for them to never know worry and fear, sleepless nights over your child's future who can't take care of themselves.  \n \n \n \nSo I don't only run for my son, Boy Wonder but for his sisters who love him fiercely and who often deserves more then they get in the way of time and attention but all I do is for them too. Especially the running.  \n \n \n \n \n \n \n \n ", "outgoing_links": ["http://4.bp.blogspot.com/-dL5ORYvR_zY/UHbpSH9PZZI/AAAAAAAAAZw/Pf6TpISg7rQ/s1600/photo-54.JPG"], "link": "http://theadventuresofboywonder.blogspot.com/2012/10/the-other-two-reasons-i-run-run-for-my.html", "title": "\nThe Other Two Reasons I Run (Run for My Girls)\n"},
{"date": "Monday, November 5, 2012", "body": "\n \n \n \n \n \n \n \nWe are here. Alive and grateful that we only lost power for 36 hours. We have heat, electricity and running water. \n \nOur friends and loved ones on the Jersey Shore were not so lucky. They lost everything. My BFF, D and her husband are spearheading a donation drive. They are renting at their own expense a very large U-Haul truck. Please help us fill it.  \n \nThe people need, diapers, wipes, cleaning supplies, bleach, rubber gloves, toilet paper, paper towels, toothbrushes, toothpaste, feminine hygiene products,  soap, rubber boots, warm adult and children's clothing, coats, hats, blankets, etc. Anything you can think of they need. \n \n If you would like to donate, please email me at boywondersmom1004@yahoo.com. We are in the Northern New Jersey area. If you can help in anyway, it will be greatly appreciated by this Jersey Girl.  \n \nWe are down but we are never out. Why? Cause we're from Jersey.  \n \n \n \n ", "outgoing_links": ["http://3.bp.blogspot.com/-0TkfEhazIQI/UJfxsDlfMaI/AAAAAAAAAaQ/Fc3_UTI_xgA/s1600/486152_287250591394819_1935974527_n.jpg"], "link": "http://theadventuresofboywonder.blogspot.com/2012/11/restore-shore.html", "title": "\nRestore The Shore\n"}
]